pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301054E: Register word32 keyMgmtGetKeySize_internal(Stack word32 dwArg38, Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out ptr32 s2Out)
// Called from:
//      keyMgmtGetKeySize
word32 keyMgmtGetKeySize_internal(word32 dwArg38, Eq_2 dwArg0168, union Eq_2 & a0Out, ptr32 & s2Out)
{
	struct Eq_52743 * s1_28;
	word32 s2_33;
	word32 a2_97;
	word32 a5_98;
	word32 a6_99;
	word32 s3_100;
	word32 s4_101;
	word32 s5_102;
	word32 s6_103;
	word32 s7_104;
	word32 s8_105;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_28, out a2_97, out a5_98, out a6_99, out s2_33, out s3_100, out s4_101, out s5_102, out s6_103, out s7_104, out s8_105);
	if (s2_33 != 0x00)
		((word32) s1_28->b0004 & 0x08) == 0x00;
	else
	{
		ui32 a5_39 = (word32) s1_28->b0003;
	}
	word32 s1_65;
	ptr32 s2_70;
	word32 a2_106;
	word32 a5_107;
	word32 a6_108;
	word32 s3_109;
	word32 s4_110;
	word32 s5_111;
	word32 s6_112;
	word32 s7_113;
	word32 s8_114;
	Eq_2 a0_75 = dbg_test_print(&g_b23075D78, dwArg0168, out s1_65, out a2_106, out a5_107, out a6_108, out s2_70, out s3_109, out s4_110, out s5_111, out s6_112, out s7_113, out s8_114);
	0x00 = dwArg38;
	a0Out = a0_75;
	s2Out = s2_70;
	return s1_65;
}

// 230105E2: Register Eq_2 isApReplayCounterFresh(Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_52826 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s7Out)
// Called from:
//      KeyMgmtSta_IsRxEAPOLValid
Eq_2 isApReplayCounterFresh(Eq_2 dwArg0158, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_52826 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s7Out)
{
	Eq_2 s2_33;
	word32 s1_162;
	word32 a2_163;
	word32 a5_164;
	word32 a6_165;
	word32 s3_166;
	word32 s4_167;
	word32 s5_168;
	word32 s6_169;
	word32 s7_170;
	word32 s8_171;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_162, out a2_163, out a5_164, out a6_165, out s2_33, out s3_166, out s4_167, out s5_168, out s6_169, out s7_170, out s8_171);
	word32 a1_172;
	word32 a2_173;
	word32 a3_174;
	word32 a4_175;
	word32 a5_176;
	word32 a6_177;
	word32 a7_178;
	memcpy(fp + ~0x17, s2_33, 0x04, out a1_172, out a2_173, out a3_174, out a4_175, out a5_176, out a6_177, out a7_178);
	uint32 a4_57;
	word32 a1_179;
	word32 a2_180;
	word32 a3_181;
	word32 a5_182;
	word32 a6_183;
	word32 a7_184;
	memcpy(fp + ~0x13, (word32) s2_33 + 4, 0x04, out a1_179, out a2_180, out a3_181, out a4_57, out a5_182, out a6_183, out a7_184);
	Eq_52826 a1_81 = a4_57 >> 0x08 & 0x0FFFFF00;
	ptr32 a4_149 = 0x10000000;
	Eq_52826 a3_148 = (word32) a1_81.u0 + (((a4_57 << 0x18) + (a4_57 >> 0x18)) + (a4_57 << 0x08 & 0x00FF0000));
	if (a1_81 >= a3_148 && a1_81 == a3_148)
	{
		a3_148.u0 = 0x00;
		a4_149 = 0x00100000;
	}
	ptr32 s1_117;
	ptr32 s2_122;
	ptr32 s7_126;
	word32 a2_185;
	word32 a5_186;
	word32 a6_187;
	word32 s3_188;
	word32 s4_189;
	word32 s5_190;
	word32 s6_191;
	word32 s8_192;
	Eq_2 s0_116 = dbg_test_print(&g_b23075D78, dwArg0158, out s1_117, out a2_185, out a5_186, out a6_187, out s2_122, out s3_188, out s4_189, out s5_190, out s6_191, out s7_126, out s8_192);
	s1Out = s1_117;
	a0Out = s0_116;
	a3Out = a3_148;
	a4Out = a4_149;
	s2Out = s2_122;
	s7Out = s7_126;
	return s0_116;
}

// 230106C4: Register Eq_2 updateApReplayCounter(Stack Eq_2 dwArg84, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_49738) a4Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      KeyMgmtStaHsk_Recvd_GrpMsg1
//      KeyMgmtStaHsk_Recvd_PWKMsg3
Eq_2 updateApReplayCounter(Eq_2 dwArg84, Eq_2 dwArg0158, struct Eq_49738 & a4Out, ptr32 & s3Out, ptr32 & s5Out)
{
	word32 s1_28;
	Eq_2 s2_33;
	word32 a2_152;
	word32 a5_153;
	word32 a6_154;
	word32 s3_155;
	word32 s4_156;
	word32 s5_157;
	word32 s6_158;
	word32 s7_159;
	word32 s8_160;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_28, out a2_152, out a5_153, out a6_154, out s2_33, out s3_155, out s4_156, out s5_157, out s6_158, out s7_159, out s8_160);
	word32 a1_161;
	word32 a2_162;
	word32 a3_163;
	word32 a4_164;
	word32 a5_165;
	word32 a6_166;
	word32 a7_167;
	memcpy(fp + ~0x17, s2_33, 0x04, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165, out a6_166, out a7_167);
	uint32 a3_62;
	word32 a1_168;
	word32 a2_169;
	word32 a4_170;
	word32 a5_171;
	word32 a6_172;
	word32 a7_173;
	memcpy(fp + ~0x13, (word32) s2_33 + 4, 0x04, out a1_168, out a2_169, out a3_62, out a4_170, out a5_171, out a6_172, out a7_173);
	struct Eq_53018 * a5_82 = (a3_62 << 0x18) + (a3_62 >> 0x18) + (a3_62 << 0x08 & 0x00FF0000) + (a3_62 >> 0x08 & dwArg84);
	a5_82->dw0064 = s1_28;
	struct Eq_49738 * a4_91 = (dwArg84 & 0x00100000) + 0x10;
	a4_91->dw0060 = s1_28;
	if ((a5_82 | a4_91) == 0x00)
		*(word32 *) 0x69 = s1_28;
	ptr32 s3_117;
	ptr32 s5_118;
	word32 s1_174;
	word32 a2_175;
	word32 a5_176;
	word32 a6_177;
	word32 s2_178;
	word32 s4_179;
	word32 s6_180;
	word32 s7_181;
	word32 s8_182;
	Eq_2 s0_110 = dbg_test_print(&g_b23075D78, dwArg0158, out s1_174, out a2_175, out a5_176, out a6_177, out s2_178, out s3_117, out s4_179, out s5_118, out s6_180, out s7_181, out s8_182);
	a4Out = a4_91;
	s3Out = s3_117;
	s5Out = s5_118;
	return s0_110;
}

// 23010784: Register Eq_2 formEAPOLEthHdr(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      KeyMgmtSta_PrepareEAPOLFrame
//      PrepDefaultEapolMsg
Eq_2 formEAPOLEthHdr(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 s4_37;
	Eq_2 s5_43;
	word32 s1_128;
	word32 a2_129;
	word32 a5_130;
	word32 a6_131;
	word32 s2_132;
	word32 s3_133;
	word32 s6_134;
	word32 s7_135;
	word32 s8_136;
	Eq_2 s0_35 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_128, out a2_129, out a5_130, out a6_131, out s2_132, out s3_133, out s4_37, out s5_43, out s6_134, out s7_135, out s8_136);
	word32 a1_137;
	word32 a2_138;
	word32 a3_139;
	word32 a4_140;
	word32 a5_141;
	word32 a6_142;
	word32 a7_143;
	memcpy(s0_35, s5_43, 0x06, out a1_137, out a2_138, out a3_139, out a4_140, out a5_141, out a6_142, out a7_143);
	ptr32 a4_65;
	word32 a1_144;
	word32 a2_145;
	word32 a3_146;
	word32 a5_147;
	word32 a6_148;
	word32 a7_149;
	memcpy((word32) s0_35 + 6, s4_37, 0x06, out a1_144, out a2_145, out a3_146, out a4_65, out a5_147, out a6_148, out a7_149);
	((word32) s0_35 + 0x0C)->u1 = 0x88;
	((word32) s0_35 + 0x0D)->u1 = 0x8E;
	ptr32 s1_99;
	ptr32 s4_100;
	ptr32 s2_104;
	ptr32 s3_105;
	word32 a2_150;
	word32 a5_151;
	word32 a6_152;
	word32 s5_153;
	word32 s6_154;
	word32 s7_155;
	word32 s8_156;
	Eq_2 s0_98 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_99, out a2_150, out a5_151, out a6_152, out s2_104, out s3_105, out s4_100, out s5_153, out s6_154, out s7_155, out s8_156);
	s1Out = s1_99;
	a4Out = a4_65;
	s2Out = s2_104;
	s3Out = s3_105;
	s4Out = s4_100;
	return s0_98;
}

