pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301080C: Register Eq_2 IsEAPOL_MICValid(Register Eq_2 ra, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtSta_IsRxEAPOLValid
//      ProcessPWKMsg4
//      ProcessPWKMsg2
Eq_2 IsEAPOL_MICValid(Eq_2 ra, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a0_124;
	Eq_2 s1_35;
	Eq_2 s5_42;
	word32 a2_207;
	word32 a5_208;
	word32 a6_209;
	word32 s2_210;
	word32 s3_211;
	word32 s4_212;
	word32 s6_213;
	word32 s7_214;
	word32 s8_215;
	Eq_2 s0_34 = dbg_test_print(&g_b23075D64, dwArg0148, out s1_35, out a2_207, out a5_208, out a6_209, out s2_210, out s3_211, out s4_212, out s5_42, out s6_213, out s7_214, out s8_215);
	word32 a1_216;
	word32 a2_217;
	word32 a3_218;
	word32 a4_219;
	word32 a5_220;
	word32 a6_221;
	word32 a7_222;
	memcpy(fp + -48, s1_35, 0x10, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out a6_221, out a7_222);
	word32 t1_223;
	word32 a0_224;
	word32 a1_225;
	word32 a2_226;
	word32 a3_227;
	word32 a4_228;
	word32 a5_229;
	Eq_2 ra_70 = memset(ra, s1_35, 0x00, 0x10, out t1_223, out a0_224, out a1_225, out a2_226, out a3_227, out a4_228, out a5_229);
	uint32 a5_77 = (word32) *((word32) s0_34 + 3) << 8 | (word32) (*((word32) s0_34 + 2));
	ptr32 s10_106;
	ptr32 s9_113;
	word32 s3_230;
	word32 s4_231;
	Eq_2 s1_105;
	ptr32 s2_107;
	ptr32 s5_110;
	ptr32 s7_112;
	Eq_2 ra_103 = ComputeEAPOL_MIC(ra_70, s0_34, (word32) (word16) ((a5_77 >> 8 | a5_77 << 0x08) + 4), s5_42, 0x10, 0x00, out s1_105, out s2_107, out s3_230, out s4_231, out s5_110, out s7_112, out s9_113, out s10_106);
	ptr32 a3_120;
	ptr32 a4_121;
	word32 a1_232;
	word32 a2_233;
	word32 a5_234;
	if (memcmp(s1_105, fp + -48, 0x10, out a1_232, out a2_233, out a3_120, out a4_121, out a5_234) == 0x00)
	{
		word32 a2_235;
		word32 a5_236;
		word32 a6_237;
		word32 s3_238;
		word32 s4_239;
		word32 s6_240;
		word32 s8_241;
		dbg_test_print(&g_b23075D78, dwArg0148, out s1_105, out a2_235, out a5_236, out a6_237, out s2_107, out s3_238, out s4_239, out s5_110, out s6_240, out s7_112, out s8_241);
		a0_124 = 0x01;
	}
	else
		a0_124 = 0x00;
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_105;
	a0Out = a0_124;
	a3Out = a3_120;
	a4Out = a4_121;
	s2Out = s2_107;
	s5Out = s5_110;
	s7Out = s7_112;
	s9Out = s9_113;
	s10Out = s10_106;
	return ra_103;
}

// 230108C0: Register Eq_2 KeyMgmtSta_PopulateEAPOLLengthMic(Register Eq_2 ra, Register ui32 a4, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
//      GeneratePWKMsg3
Eq_2 KeyMgmtSta_PopulateEAPOLLengthMic(Eq_2 ra, ui32 a4, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 s5_48;
	word32 s6_49;
	word32 s1_199;
	word32 a2_200;
	word32 a5_201;
	word32 a6_202;
	word32 s2_203;
	word32 s3_204;
	word32 s4_205;
	word32 s7_206;
	word32 s8_207;
	Eq_2 s0_40 = dbg_test_print(&g_b23075D64, dwArg0148, out s1_199, out a2_200, out a5_201, out a6_202, out s2_203, out s3_204, out s4_205, out s5_48, out s6_49, out s7_206, out s8_207);
	if (s0_40 != 0x00)
	{
		uint32 a1_55 = (word32) *((word32) s0_40 + 112) << 8 | (word32) (*((word32) s0_40 + 111));
		((word32) s0_40 + 0x0F)->u1 = 0x03;
		uint32 s4_57 = a1_55 + 95 << 16;
		uint32 a5_65 = (word32) (word16) (s4_57 >> 0x10 << 0x08 | s4_57 >> 0x18);
		((word32) s0_40 + 16)->u1 = (byte) a5_65;
		*((word32) s0_40 + 0x0011) = (byte) (a5_65 >> 8);
		uint32 a5_73 = (word32) (word16) (a1_55 << 0x08 | a1_55 >> 0x08);
		((word32) s0_40 + 111)->u1 = (byte) a5_73;
		*((word32) s0_40 + 0x0E) = (byte) s6_49;
		*((word32) s0_40 + 112) = (byte) (a5_73 >> 8);
		word32 s1_208;
		word32 s2_209;
		word32 s3_210;
		word32 s4_211;
		word32 s5_212;
		word32 s7_213;
		word32 s9_214;
		word32 s10_215;
		ra = ComputeEAPOL_MIC(ra, (word32) s0_40 + 0x0E, (word32) (word16) (a1_55 + 99), s5_48, 0x10, a4, out s1_208, out s2_209, out s3_210, out s4_211, out s5_212, out s7_213, out s9_214, out s10_215);
		word32 s1_216;
		word32 a2_217;
		word32 a5_218;
		word32 a6_219;
		word32 s2_220;
		word32 s3_221;
		word32 s4_222;
		word32 s5_223;
		word32 s6_224;
		word32 s7_225;
		word32 s8_226;
		dbg_test_print(&g_b23075D78, dwArg0148, out s1_216, out a2_217, out a5_218, out a6_219, out s2_220, out s3_221, out s4_222, out s5_223, out s6_224, out s7_225, out s8_226);
	}
	0x00 = (uint16) dwArg0128;
	return ra;
}

// 23010996: Register word32 parseKeyKDE(Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_53488 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_53492 s6Out, Register out ptr32 s7Out)
// Called from:
//      parseKeyKDE_DataType
word32 parseKeyKDE(Eq_2 dwArg0168, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_53488 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_53492 & s6Out, ptr32 & s7Out)
{
	word32 a2_119;
	word32 a5_120;
	word32 a6_121;
	word32 s2_122;
	word32 s8_123;
	word32 s1_102;
	ptr32 s3_104;
	ptr32 s4_105;
	ptr32 s5_106;
	Eq_53492 s6_107;
	ptr32 s7_108;
	Eq_2 s0_23 = dbg_test_print(&g_b23075D64, dwArg0168, out s1_102, out a2_119, out a5_120, out a6_121, out s2_122, out s3_104, out s4_105, out s5_106, out s6_107, out s7_108, out s8_123);
	Eq_53488 a4_34 = (word32) *s0_23;
	if (a4_34 == 0x00DD)
	{
		a4_34 = (word32) *((word32) s0_23 + 1);
		if (a4_34 > 0x07)
		{
			word32 a1_129;
			word32 a2_130;
			word32 a5_131;
			if (memcmp((word32) s0_23 + 2, 587783572, 0x03, out a1_129, out a2_130, out a3, out a4_34, out a5_131) == 0x00)
			{
l230109F2:
				a0Out = s0_23;
				a3Out = a3;
				a4Out = a4_34;
				s3Out = s3_104;
				s4Out = s4_105;
				s5Out = s5_106;
				s6Out = s6_107;
				s7Out = s7_108;
				return s1_102;
			}
		}
	}
	word32 a2_124;
	word32 a5_125;
	word32 a6_126;
	word32 s2_127;
	word32 s8_128;
	s0_23 = dbg_test_print(&g_b23075D78, dwArg0168, out s1_102, out a2_124, out a5_125, out a6_126, out s2_127, out s3_104, out s4_105, out s5_106, out s6_107, out s7_108, out s8_128);
	goto l230109F2;
}

// 23010A1E: Register word32 parseKeyKDE_DataType(Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      parseKeyDataGTK
word32 parseKeyKDE_DataType(Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	word32 s8_230;
	word32 s4_226;
	word32 s5_227;
	word32 s6_228;
	word32 s7_229;
	word32 a2_222;
	word32 a5_223;
	word32 a6_224;
	word32 s2_225;
	word32 s1_221;
	int32 s3_46;
	Eq_2 s0_111 = dbg_test_print(&g_b23075D64, dwArg0148, out s1_221, out a2_222, out a5_223, out a6_224, out s2_225, out s3_46, out s4_226, out s5_227, out s6_228, out s7_229, out s8_230);
	if (s0_111 != 0x00)
	{
		Eq_2 s1_50 = s0_111;
		int32 s4_135 = 0x02;
		int32 s6_137 = 0x00DD;
		word32 s7_53 = ~0x01;
		for (; s4_135 < s3_46; s3_46 += a4)
		{
			if ((word32) *s1_50 == s6_137)
			{
				Eq_2 a0_62;
				word32 s5_73;
				s1_50 = parseKeyKDE(dwArg0138, out a0_62, out a3, out a4, out s3_46, out s4_135, out s5_73, out s6_137, out s7_53);
				s0_111 = a0_62;
				if (a0_62 != 0x00 && (word32) (*((word32) a0_62 + 5)) == s5_73)
					goto l23010A8E;
				if ((word32) *((word32) s1_50 + 1) == 0x00)
					s3_46 = 0x02;
			}
			word32 a5_87 = (word32) *((word32) s1_50 + 1);
			a4 = s7_53 - a5_87;
			s1_50 = (word32) s1_50 + (a5_87 + 0x02);
		}
		word32 s5_238;
		word32 s6_239;
		word32 s7_240;
		word32 s8_241;
		word32 a6_234;
		word32 s2_235;
		word32 s3_236;
		word32 s4_237;
		word32 s1_231;
		word32 a2_232;
		word32 a5_233;
		s0_111 = dbg_test_print(&g_b23075D78, dwArg0148, out s1_231, out a2_232, out a5_233, out a6_234, out s2_235, out s3_236, out s4_237, out s5_238, out s6_239, out s7_240, out s8_241);
	}
l23010A8E:
	0x00 = (uint16) dwArg0128;
	a0Out = s0_111;
	a3Out = a3;
	a4Out = a4;
	return dwArgE4;
}

// 23010AD8: Register word32 parseKeyDataGTK(Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a4Out)
// Called from:
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
word32 parseKeyDataGTK(Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a4Out)
{
	word32 s1_199;
	word32 a2_200;
	word32 a5_201;
	word32 a6_202;
	word32 s2_203;
	word32 s3_204;
	word32 s4_205;
	word32 s5_206;
	word32 s6_207;
	word32 s7_208;
	word32 s8_209;
	dbg_test_print(&g_b23075D64, dwArg0148, out s1_199, out a2_200, out a5_201, out a6_202, out s2_203, out s3_204, out s4_205, out s5_206, out s6_207, out s7_208, out s8_209);
	struct Eq_53715 * a0_45;
	ptr32 a4_121;
	word32 a3_126;
	Eq_2 s0_50 = parseKeyKDE_DataType(dwArgF8, dwArg0108, dwArg0118, out a0_45, out a3_126, out a4_121);
	if (a0_45 != null)
	{
		word32 a1_221;
		word32 a2_222;
		word32 a3_223;
		word32 a4_224;
		word32 a5_225;
		word32 a6_226;
		word32 a7_227;
		memcpy(s0_50, &a0_45->b0006 + 2, (word32) a0_45->b0001 + ~0x05, out a1_221, out a2_222, out a3_223, out a4_224, out a5_225, out a6_226, out a7_227);
		*((word32) s0_50 + 38) = (word16) ((word32) a0_45->b0006 & 0x03);
		word32 a1_228;
		word32 a2_229;
		word32 a3_230;
		word32 a4_231;
		word32 a5_232;
		word32 a6_233;
		word32 a7_234;
		memcpy(fp + -40, (word32) s0_50 + 24, 0x08, out a1_228, out a2_229, out a3_230, out a4_231, out a5_232, out a6_233, out a7_234);
		word32 a1_235;
		word32 a2_236;
		word32 a3_237;
		word32 a4_238;
		word32 a5_239;
		word32 a6_240;
		word32 a7_241;
		memcpy((word32) s0_50 + 24, (word32) s0_50 + 16, 0x08, out a1_235, out a2_236, out a3_237, out a4_238, out a5_239, out a6_240, out a7_241);
		word32 a1_242;
		word32 a2_243;
		word32 a5_244;
		word32 a6_245;
		word32 a7_246;
		memcpy((word32) s0_50 + 16, fp + -40, 0x08, out a1_242, out a2_243, out a3_126, out a4_121, out a5_244, out a6_245, out a7_246);
	}
	word32 s1_210;
	word32 a2_211;
	word32 a5_212;
	word32 a6_213;
	word32 s2_214;
	word32 s3_215;
	word32 s4_216;
	word32 s5_217;
	word32 s6_218;
	word32 s7_219;
	word32 s8_220;
	dbg_test_print(&g_b23075D78, dwArg0148, out s1_210, out a2_211, out a5_212, out a6_213, out s2_214, out s3_215, out s4_216, out s5_217, out s6_218, out s7_219, out s8_220);
	0x00 = (uint16) dwArg0128;
	a4Out = a4_121;
	return a3_126;
}

