pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23010B8A: Register Eq_2 KeyMgmtSta_ApplyKEK(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out Eq_53852 a4Out, Register out ptr32 s3Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
Eq_2 KeyMgmtSta_ApplyKEK(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a3Out, union Eq_53852 & a4Out, ptr32 & s3Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a3_116;
	Eq_53852 a4_117;
	struct Eq_53858 * s2_37;
	Eq_2 s3_38;
	word32 s1_195;
	word32 a2_196;
	word32 a5_197;
	word32 a6_198;
	word32 s4_199;
	word32 s5_200;
	word32 s6_201;
	word32 s7_202;
	word32 s8_203;
	Eq_2 s0_31 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_195, out a2_196, out a5_197, out a6_198, out s2_37, out s3_38, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203);
	ui32 a5_42 = (word32) *((word32) s0_31 + 66);
	s2_37->w0024 = (word16) (a5_42 << 8);
	s2_37->w0024 = (word16) (a5_42 << 8 | (word32) (*((word32) s0_31 + 65)));
	s2_37->dw0020 = ~0x00;
	uint32 a5_55 = (word32) *((word32) s0_31 + 98) << 8 | (word32) (*((word32) s0_31 + 97));
	Eq_53921 a4_60 = (word32) (word16) (a5_55 << 0x08 | a5_55 >> 8);
	*((word32) s0_31 + 98) = (byte) (a4_60 >> 0x08);
	ui32 a5_63 = (word32) *((word32) s0_31 + 6);
	((word32) s0_31 + 97)->u1 = (byte) a4_60;
	if ((a5_63 & 0x07) == 0x01)
		a3_116 = RC4_Encrypt(s3_38, (word32) s0_31 + 49, 0x10, (word32) s0_31 + 99, a4_60, 0x0100, out a4_117);
	else
	{
		a3_116 = BL_AesUnWrap(s3_38, 0x02, (a4_60 >> 0x03) + ~0x00, (word32) s0_31 + 99, (word32) s0_31 + 99, out s9, out s10);
		a4_117 = (word32) *((word32) s0_31 + 97);
		uint32 a5_96 = ((word32) *((word32) s0_31 + 98) << 8 | a4_117) + ~0x07 << 16;
		((word32) s0_31 + 97)->u1 = (byte) (a5_96 >> 16);
		*((word32) s0_31 + 98) = (byte) (a5_96 >> 24);
	}
	ptr32 s1_147;
	ptr32 s3_153;
	word32 a2_204;
	word32 a5_205;
	word32 a6_206;
	word32 s2_207;
	word32 s4_208;
	word32 s5_209;
	word32 s6_210;
	word32 s7_211;
	word32 s8_212;
	Eq_2 s0_146 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_147, out a2_204, out a5_205, out a6_206, out s2_207, out s3_153, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212);
	s1Out = s1_147;
	a3Out = a3_116;
	a4Out = a4_117;
	s3Out = s3_153;
	s9Out = s9;
	s10Out = s10;
	return s0_146;
}

// 23010C7A: Register Eq_2 KeyMgmtSta_IsRxEAPOLValid(Register Eq_2 ra, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      GetKeyMsgNonceFromEAPOL
Eq_2 KeyMgmtSta_IsRxEAPOLValid(Eq_2 ra, Eq_2 dwArg38, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a0_136;
	word32 a2_257;
	word32 a5_258;
	word32 a6_259;
	word32 s3_260;
	word32 s4_261;
	word32 s5_262;
	word32 s6_263;
	word32 s8_264;
	Eq_2 s1_126;
	ptr32 s2_131;
	ptr32 s7_101;
	Eq_2 s0_27 = dbg_test_print(&g_b23075D64, dwArg0168, out s1_126, out a2_257, out a5_258, out a6_259, out s2_131, out s3_260, out s4_261, out s5_262, out s6_263, out s7_101, out s8_264);
	if (s1_126 != 0x00 && s0_27 != 0x00)
	{
		word32 a0_40;
		struct Eq_54087 * s0_48 = isApReplayCounterFresh(dwArg0148, out s1_126, out a0_40, out a3, out a4, out s2_131, out s7_101);
		if (a0_40 == 0x00)
			goto l23010CAE;
		if (((word32) s0_48->b0005 & 0x01) != 0x00)
		{
			if (((word32) s0_48->b0006 & 0x08) != 0x00)
			{
				word32 a1_273;
				word32 a2_274;
				word32 a5_275;
				if (memcmp(&s0_48->b0006 + 11, s1_126, 32, out a1_273, out a2_274, out a3, out a4, out a5_275) != 0x00)
					goto l23010CAE;
			}
			word32 a0_84;
			word32 s0_276;
			word32 s5_277;
			ra = IsEAPOL_MICValid(ra, dwArg0118, dwArg0138, out s0_276, out s1_126, out a0_84, out a3, out a4, out s2_131, out s5_277, out s7_101, out s9, out s10);
			if (a0_84 == 0x00)
				goto l23010CAE;
		}
		word32 a2_265;
		word32 a5_266;
		word32 a6_267;
		word32 s3_268;
		word32 s4_269;
		word32 s5_270;
		word32 s6_271;
		word32 s8_272;
		dbg_test_print(&g_b23075D78, dwArg0168, out s1_126, out a2_265, out a5_266, out a6_267, out s2_131, out s3_268, out s4_269, out s5_270, out s6_271, out s7_101, out s8_272);
		a0_136 = 0x01;
l23010CB0:
		0x00 = (uint16) dwArg38;
		s1Out = s1_126;
		a0Out = a0_136;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2_131;
		s7Out = s7_101;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	else
	{
l23010CAE:
		a0_136 = 0x00;
		goto l23010CB0;
	}
}

// 23010D1E: Register Eq_2 KeyMgmtSta_PrepareEAPOLFrame(Register Eq_2 ra, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_49458 a4Out)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
Eq_2 KeyMgmtSta_PrepareEAPOLFrame(Eq_2 ra, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_49458 & a4Out)
{
	word32 s1_40;
	word32 s8_302;
	word32 s7_301;
	word32 s6_300;
	word32 s5_299;
	word32 s4_298;
	word32 s3_297;
	word32 s2_296;
	word32 a6_295;
	word32 a5_294;
	word32 a2_293;
	Eq_2 s0_39 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_40, out a2_293, out a5_294, out a6_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s7_301, out s8_302);
	if (s0_39 == 0x00 || s1_40 == 0x00)
	{
		s0Out = s1;
		a4Out = a4;
		return ra;
	}
	else
	{
		word32 a1_305;
		word32 a2_306;
		word32 a3_307;
		word32 a4_308;
		word32 a5_309;
		word32 a0_304;
		word32 t1_303;
		Eq_2 ra_69 = memset(ra, s0_39, 0x00, 114, out t1_303, out a0_304, out a1_305, out a2_306, out a3_307, out a4_308, out a5_309);
		struct Eq_54227 * s1_84;
		Eq_2 s3_86;
		word32 a4_310;
		word32 s2_311;
		word32 s4_312;
		struct Eq_54232 * s0_83 = formEAPOLEthHdr(dwArg0138, dwArg0158, out s1_84, out a4_310, out s2_311, out s3_86, out s4_312);
		s0_83->b0012 = (byte) (word32) s1_84->b0004;
		ui32 a5_105 = (word32) s0_83->b0014 & ~0x08 | (word32) s1_84->b0006 & 8;
		ui32 a4_106 = (word32) s0_83->b0013;
		s0_83->b0014 = (byte) a5_105;
		s0_83->b0013 = (byte) (a4_106 | 1);
		s0_83->b0013 = (byte) ((a4_106 | 1) & ~0x02 | (word32) s1_84->b0005 & 0x02);
		uint32 a3_125 = (word32) s1_84->b000C << 24 | (((word32) s1_84->b000A << 8 | (word32) s1_84->b0009) | (word32) s1_84->b000B << 16);
		s0_83->b0017 = (byte) a3_125;
		s0_83->b0018 = (byte) (a3_125 >> 0x08);
		s0_83->b0019 = (byte) (a3_125 >> 0x10);
		s0_83->b001A = (byte) (a3_125 >> 24);
		uint32 a3_142 = (word32) s1_84->b0010 << 24 | (((word32) s1_84->b000E << 8 | (word32) s1_84->b000D) | (word32) s1_84->b000F << 16);
		s0_83->b001B = (byte) a3_142;
		s0_83->b001C = (byte) (a3_142 >> 0x08);
		s0_83->b001D = (byte) (a3_142 >> 0x10);
		s0_83->b001E = (byte) (a3_142 >> 24);
		ui32 a4_150 = (word32) s1_84->b0006;
		s0_83->b0014 = (byte) (a5_105 & ~0x07 | a4_150 & 0x07);
		Eq_49458 a4_151 = a4_150 & 0x07;
		if (s3_86 != 0x00)
		{
			word32 a1_313;
			word32 a2_314;
			word32 a3_315;
			word32 a5_316;
			word32 a6_317;
			word32 a7_318;
			memcpy(&s0_83->b001E + 1, s3_86, 32, out a1_313, out a2_314, out a3_315, out a4_151, out a5_316, out a6_317, out a7_318);
		}
		word32 s1_319;
		word32 a2_320;
		word32 a5_321;
		word32 a6_322;
		word32 s2_323;
		word32 s3_324;
		word32 s4_325;
		word32 s5_326;
		word32 s6_327;
		word32 s7_328;
		word32 s8_329;
		s0Out = dbg_test_print(&g_b23075D78, dwArg0178, out s1_319, out a2_320, out a5_321, out a6_322, out s2_323, out s3_324, out s4_325, out s5_326, out s6_327, out s7_328, out s8_329);
		a4Out = a4_151;
		return ra_69;
	}
}

// 23010E7E: Register word32 supplicantAkmIsWpaWpa2(Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      supplicantAkmIsWpaWpa2Psk
word32 supplicantAkmIsWpaWpa2(Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_110;
	word32 a6_142;
	word32 a5_141;
	word32 a2_140;
	word32 s4_143;
	word32 s5_144;
	word32 s6_145;
	word32 s7_146;
	word32 s8_147;
	word32 s1_121;
	ptr32 s2_123;
	Eq_2 s3_125;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_121, out a2_140, out a5_141, out a6_142, out s2_123, out s3_125, out s4_143, out s5_144, out s6_145, out s7_146, out s8_147);
	word32 a1_148;
	word32 a2_149;
	word32 a3_150;
	word32 a5_151;
	ptr32 a4_115;
	if (memcmp(s3_125, 0x2308DDB0, 0x03, out a1_148, out a2_149, out a3_150, out a4_115, out a5_151) != 0x00)
	{
		word32 a1_152;
		word32 a2_153;
		word32 a3_154;
		word32 a5_155;
		if (memcmp(s3_125, 587783572, 0x03, out a1_152, out a2_153, out a3_154, out a4_115, out a5_155) != 0x00)
		{
			word32 a2_156;
			word32 a5_157;
			word32 a6_158;
			word32 s4_159;
			word32 s5_160;
			word32 s6_161;
			word32 s7_162;
			word32 s8_163;
			dbg_test_print(&g_b23075D78, dwArg0158, out s1_121, out a2_156, out a5_157, out a6_158, out s2_123, out s3_125, out s4_159, out s5_160, out s6_161, out s7_162, out s8_163);
			a0_110 = 0x00;
l23010EC4:
			a0Out = a0_110;
			a4Out = a4_115;
			s2Out = s2_123;
			s3Out = s3_125;
			s4Out = dwArg04;
			return s1_121;
		}
	}
	a0_110 = 0x01;
	goto l23010EC4;
}

// 23010F00: Register word32 supplicantAkmIsWpa2(Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 s2Out)
// Called from:
//      supplicantAkmUsesKdf
word32 supplicantAkmIsWpa2(Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & s2Out)
{
	ptr32 a0_48;
	Eq_2 s3_34;
	word32 a2_108;
	word32 a5_109;
	word32 a6_110;
	word32 s4_111;
	word32 s5_112;
	word32 s6_113;
	word32 s7_114;
	word32 s8_115;
	word32 s1_28;
	ptr32 s2_100;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_28, out a2_108, out a5_109, out a6_110, out s2_100, out s3_34, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115);
	word32 a1_116;
	word32 a2_117;
	word32 a3_118;
	word32 a4_119;
	word32 a5_120;
	if (memcmp(s3_34, 587783572, 0x03, out a1_116, out a2_117, out a3_118, out a4_119, out a5_120) != 0x00)
	{
		word32 a2_121;
		word32 a5_122;
		word32 a6_123;
		word32 s3_124;
		word32 s4_125;
		word32 s5_126;
		word32 s6_127;
		word32 s7_128;
		word32 s8_129;
		dbg_test_print(&g_b23075D78, dwArg0158, out s1_28, out a2_121, out a5_122, out a6_123, out s2_100, out s3_124, out s4_125, out s5_126, out s6_127, out s7_128, out s8_129);
		a0_48 = 0x00;
	}
	else
		a0_48 = 0x01;
	a0Out = a0_48;
	s2Out = s2_100;
	return s1_28;
}

// 23010F70: Register Eq_2 supplicantAkmIsWpaWpa2Psk(Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a4Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
Eq_2 supplicantAkmIsWpaWpa2Psk(Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a4Out)
{
	Eq_2 s0_68;
	word32 s1_126;
	word32 a2_127;
	word32 a5_128;
	word32 a6_129;
	word32 s2_130;
	word32 s3_131;
	word32 s4_132;
	word32 s5_133;
	word32 s6_134;
	word32 s7_135;
	word32 s8_136;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_126, out a2_127, out a5_128, out a6_129, out s2_130, out s3_131, out s4_132, out s5_133, out s6_134, out s7_135, out s8_136);
	word32 a0_41;
	struct Eq_54631 * s4_52;
	word32 s2_137;
	word32 s3_138;
	ptr32 a4_116;
	supplicantAkmIsWpaWpa2(dwArg0138, out a0_41, out a4_116, out s2_137, out s3_138, out s4_52);
	if (a0_41 != 0x00)
	{
		Eq_54669 a5_79 = (word32) s4_52->b0003;
		a4_116 = 0x02;
		s0_68.u0 = 0x01;
		if ((a5_79 & 0x00FB) != 0x02)
			s0_68 = (word32) (a5_79 < -5);
	}
	else
	{
		word32 s1_139;
		word32 a2_140;
		word32 a5_141;
		word32 a6_142;
		word32 s2_143;
		word32 s3_144;
		word32 s4_145;
		word32 s5_146;
		word32 s6_147;
		word32 s7_148;
		word32 s8_149;
		s0_68 = dbg_test_print(&g_b23075D78, dwArg0158, out s1_139, out a2_140, out a5_141, out a6_142, out s2_143, out s3_144, out s4_145, out s5_146, out s6_147, out s7_148, out s8_149);
	}
	a4Out = a4_116;
	return s0_68;
}

// 23010FF2: Register word32 supplicantAkmUsesKdf(Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
word32 supplicantAkmUsesKdf(Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	word32 s1_120;
	word32 a2_121;
	word32 a5_122;
	word32 a6_123;
	word32 s2_124;
	word32 s3_125;
	word32 s4_126;
	word32 s5_127;
	word32 s6_128;
	word32 s7_129;
	word32 s8_130;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_120, out a2_121, out a5_122, out a6_123, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out s7_129, out s8_130);
	word32 a0_35;
	word32 s2_112;
	struct Eq_54711 * s1_43 = supplicantAkmIsWpa2(dwArg0148, out a0_35, out s2_112);
	if (a0_35 == 0x00 || ((word32) s1_43->b0003 + ~0x02 & 0x00FF) > 0x03)
	{
		word32 s1_131;
		word32 a2_132;
		word32 a5_133;
		word32 a6_134;
		word32 s3_135;
		word32 s4_136;
		word32 s5_137;
		word32 s6_138;
		word32 s7_139;
		word32 s8_140;
		dbg_test_print(&g_b23075D78, dwArg0168, out s1_131, out a2_132, out a5_133, out a6_134, out s2_112, out s3_135, out s4_136, out s5_137, out s6_138, out s7_139, out s8_140);
	}
	return s2_112;
}

// 23011066: Register word32 supplicantConstructContext(Stack word32 dwArgA8, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      KeyMgmt_DerivePTK
word32 supplicantConstructContext(word32 dwArgA8, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & a6Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 a1_79;
	Eq_2 s4_44;
	Eq_2 s2_48;
	Eq_2 s3_49;
	Eq_2 s5_50;
	Eq_2 s6_51;
	word32 s8_257;
	word32 a6_255;
	word32 s7_256;
	word32 a2_253;
	word32 a5_254;
	word32 s1_252;
	Eq_2 s0_42 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_252, out a2_253, out a5_254, out a6_255, out s2_48, out s3_49, out s4_44, out s5_50, out s6_51, out s7_256, out s8_257);
	word32 a4_261;
	word32 a5_262;
	word32 a2_259;
	word32 a3_260;
	word32 a1_258;
	if (memcmp(s4_44, s5_50, 0x06, out a1_258, out a2_259, out a3_260, out a4_261, out a5_262) < 0x00)
	{
		word32 a1_270;
		word32 a2_271;
		word32 a3_272;
		word32 a4_273;
		word32 a5_274;
		word32 a6_275;
		word32 a7_276;
		memcpy(s0_42, s4_44, 0x06, out a1_270, out a2_271, out a3_272, out a4_273, out a5_274, out a6_275, out a7_276);
		a1_79 = s5_50;
	}
	else
	{
		word32 a4_266;
		word32 a3_265;
		word32 a1_263;
		word32 a2_264;
		word32 a5_267;
		word32 a6_268;
		word32 a7_269;
		memcpy(s0_42, s5_50, 0x06, out a1_263, out a2_264, out a3_265, out a4_266, out a5_267, out a6_268, out a7_269);
		a1_79 = s4_44;
	}
	Eq_2 a1_145;
	word32 a1_298;
	word32 a2_299;
	word32 a3_300;
	word32 a4_301;
	word32 a5_302;
	word32 a6_303;
	word32 a7_304;
	memcpy(s6_51, a1_79, 0x06, out a1_298, out a2_299, out a3_300, out a4_301, out a5_302, out a6_303, out a7_304);
	word32 a1_305;
	word32 a2_306;
	word32 a3_307;
	word32 a4_308;
	word32 a5_309;
	if (memcmp(s2_48, s3_49, 32, out a1_305, out a2_306, out a3_307, out a4_308, out a5_309) < 0x00)
	{
		word32 a1_284;
		word32 a2_285;
		word32 a3_286;
		word32 a4_287;
		word32 a5_288;
		word32 a6_289;
		word32 a7_290;
		memcpy((word32) s0_42 + 0x0C, s2_48, 32, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288, out a6_289, out a7_290);
		a1_145 = s3_49;
	}
	else
	{
		word32 a1_277;
		word32 a2_278;
		word32 a3_279;
		word32 a4_280;
		word32 a5_281;
		word32 a6_282;
		word32 a7_283;
		memcpy((word32) s0_42 + 0x0C, s3_49, 32, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a6_282, out a7_283);
		a1_145 = s2_48;
	}
	word32 a1_310;
	word32 a2_311;
	word32 a3_312;
	word32 a4_313;
	word32 a5_314;
	word32 a6_315;
	word32 a7_316;
	memcpy((word32) s0_42 + 44, a1_145, 32, out a1_310, out a2_311, out a3_312, out a4_313, out a5_314, out a6_315, out a7_316);
	0x00 = dwArgA8;
	ptr32 a6_203;
	word32 s1_205;
	ptr32 s2_210;
	ptr32 s3_211;
	word32 a2_291;
	word32 a5_292;
	word32 s4_293;
	word32 s5_294;
	word32 s6_295;
	word32 s7_296;
	word32 s8_297;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_205, out a2_291, out a5_292, out a6_203, out s2_210, out s3_211, out s4_293, out s5_294, out s6_295, out s7_296, out s8_297);
	a6Out = a6_203;
	s2Out = s2_210;
	s3Out = s3_211;
	return s1_205;
}

