pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301114C: Register Eq_2 KeyMgmt_DerivePTK(Register Eq_2 ra, Stack word32 dwArg04, Stack word32 dwArg78, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      KeyMgmtSta_DeriveKeys
Eq_2 KeyMgmt_DerivePTK(Eq_2 ra, word32 dwArg04, word32 dwArg78, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	word32 s1_236;
	word32 a2_237;
	word32 a5_238;
	word32 a6_239;
	word32 s2_240;
	word32 s3_241;
	word32 s4_242;
	word32 s5_243;
	word32 s6_244;
	word32 s7_245;
	word32 s8_246;
	dbg_test_print(&g_b23075D64, dwArg0148, out s1_236, out a2_237, out a5_238, out a6_239, out s2_240, out s3_241, out s4_242, out s5_243, out s6_244, out s7_245, out s8_246);
	word32 a6_68;
	Eq_2 s2_72;
	Eq_2 s3_73;
	Eq_2 s1_71 = supplicantConstructContext(dwArg78, dwArg0128, dwArg0148, out a6_68, out s2_72, out s3_73);
	if (a6_68 != 0x00)
		bl_sha256_crypto_kdf(ra, s3_73, 32, s1_71, 76, s2_72, 384);
	else
	{
		word32 s0_247;
		word32 s1_248;
		word32 s4_249;
		Bl_PRF(ra, s3_73, 32, 0x23076090, 22, s1_71, 76, s2_72, 64, dwArg04, out s0_247, out s1_248, out s4_249);
	}
	0x00 = (uint16) dwArg0128;
	ptr32 s1_179;
	ptr32 s4_180;
	ptr32 s3_185;
	ptr32 s6_187;
	word32 a2_250;
	word32 a5_251;
	word32 a6_252;
	word32 s2_253;
	word32 s5_254;
	word32 s7_255;
	word32 s8_256;
	Eq_2 s0_178 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_179, out a2_250, out a5_251, out a6_252, out s2_253, out s3_185, out s4_180, out s5_254, out s6_187, out s7_255, out s8_256);
	s1Out = s1_179;
	s3Out = s3_185;
	s4Out = s4_180;
	s6Out = s6_187;
	return s0_178;
}

// 23011216: Register word32 KeyMgmtSta_DeriveKeys(Register Eq_2 ra)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      KeyMgmtAp_DerivePTK
word32 KeyMgmtSta_DeriveKeys(Eq_2 ra)
{
	word32 s4_55;
	word32 s5_61;
	word32 s1_263;
	word32 a2_264;
	word32 a5_265;
	word32 a6_266;
	word32 s2_267;
	word32 s3_268;
	word32 s6_269;
	word32 s7_270;
	word32 s8_271;
	Eq_2 s0_53 = dbg_test_print(&g_b23075D64, dwLocC8, out s1_263, out a2_264, out a5_265, out a6_266, out s2_267, out s3_268, out s4_55, out s5_61, out s6_269, out s7_270, out s8_271);
	if (s5_61 != 0x00 && (s4_55 != 0x00 && s0_53 != 0x00))
	{
		Eq_2 s4_85;
		Eq_2 s6_87;
		word32 s1_272;
		word32 s3_273;
		Eq_2 s0_80 = KeyMgmt_DerivePTK(ra, dwLoc023C, dwLoc01C8, dwLoc0118, dwLocF8, dwLocC8, out s1_272, out s3_273, out s4_85, out s6_87);
		word32 a1_274;
		word32 a2_275;
		word32 a3_276;
		word32 a4_277;
		word32 a5_278;
		word32 a6_279;
		word32 a7_280;
		memcpy(s4_85, fp + -0x0224, 0x10, out a1_274, out a2_275, out a3_276, out a4_277, out a5_278, out a6_279, out a7_280);
		word32 a1_281;
		word32 a2_282;
		word32 a3_283;
		word32 a4_284;
		word32 a5_285;
		word32 a6_286;
		word32 a7_287;
		memcpy(s6_87, fp + -532, 0x10, out a1_281, out a2_282, out a3_283, out a4_284, out a5_285, out a6_286, out a7_287);
		word32 a1_288;
		word32 a2_289;
		word32 a3_290;
		word32 a4_291;
		word32 a5_292;
		word32 a6_293;
		word32 a7_294;
		memcpy(s0_80, fp + -516, 0x10, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out a6_293, out a7_294);
		word32 a1_295;
		word32 a2_296;
		word32 a3_297;
		word32 a4_298;
		word32 a5_299;
		word32 a6_300;
		word32 a7_301;
		memcpy((word32) s0_80 + 16, fp + -500, 0x08, out a1_295, out a2_296, out a3_297, out a4_298, out a5_299, out a6_300, out a7_301);
		word32 a1_302;
		word32 a2_303;
		word32 a3_304;
		word32 a5_305;
		word32 a6_306;
		word32 a7_307;
		memcpy((word32) s0_80 + 24, fp + -492, 0x08, out a1_302, out a2_303, out a3_304, out a4, out a5_305, out a6_306, out a7_307);
		word32 s1_308;
		word32 a2_309;
		word32 a5_310;
		word32 a6_311;
		word32 s2_312;
		word32 s3_313;
		word32 s4_314;
		word32 s5_315;
		word32 s6_316;
		word32 s7_317;
		word32 s8_318;
		dbg_test_print(&g_b23075D78, dwLocC8, out s1_308, out a2_309, out a5_310, out a6_311, out s2_312, out s3_313, out s4_314, out s5_315, out s6_316, out s7_317, out s8_318);
	}
	return a4;
}

// 23011318: Register word32 SetEAPOLKeyDescTypeVersion(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      PrepDefaultEapolMsg
word32 SetEAPOLKeyDescTypeVersion(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s5Out)
{
	struct Eq_55246 * s1_32;
	word32 a2_90;
	word32 a5_91;
	word32 a6_92;
	word32 s2_93;
	word32 s3_94;
	word32 s4_95;
	word32 s5_96;
	word32 s6_97;
	word32 s7_98;
	word32 s8_99;
	Eq_2 s0_31 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_32, out a2_90, out a5_91, out a6_92, out s2_93, out s3_94, out s4_95, out s5_96, out s6_97, out s7_98, out s8_99);
	ui32 a2_42 = (word32) s1_32->b0014;
	s1_32->b0012 = 0x02;
	s1_32->b0014 = (byte) (a2_42 & ~0x07 | (word32) (s0_31 != 0x00) + 0x02);
	ptr32 a5_62;
	word32 s1_65;
	ptr32 s3_71;
	ptr32 s5_72;
	word32 a2_100;
	word32 a6_101;
	word32 s2_102;
	word32 s4_103;
	word32 s6_104;
	word32 s7_105;
	word32 s8_106;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_65, out a2_100, out a5_62, out a6_101, out s2_102, out s3_71, out s4_103, out s5_72, out s6_104, out s7_105, out s8_106);
	a5Out = a5_62;
	s3Out = s3_71;
	s5Out = s5_72;
	return s1_65;
}

// 2301138C: Register Eq_2 GetKeyMsgNonceFromEAPOL(Register Eq_2 ra, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
Eq_2 GetKeyMsgNonceFromEAPOL(Eq_2 ra, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg4C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_2 s0_130;
	word32 s1_223;
	word32 a2_224;
	word32 a5_225;
	word32 a6_226;
	word32 s2_227;
	word32 s3_228;
	word32 s4_229;
	word32 s5_230;
	word32 s6_231;
	word32 s7_232;
	word32 s8_233;
	struct Eq_55330 * s0_38 = *((word32) dbg_test_print(&g_b23075D64, dwArg0168, out s1_223, out a2_224, out a5_225, out a6_226, out s2_227, out s3_228, out s4_229, out s5_230, out s6_231, out s7_232, out s8_233) + 8);
	word32 a0_41;
	ptr32 a4_179;
	ptr32 a3_177;
	ptr32 s1_131;
	ptr32 s10_100;
	Eq_2 s2_136;
	ptr32 s7_140;
	ptr32 s9_109;
	Eq_2 ra_185 = KeyMgmtSta_IsRxEAPOLValid(ra, dwArg28, dwArg0108, dwArg0128, dwArg0138, dwArg0158, out s1_131, out a0_41, out a3_177, out a4_179, out s2_136, out s7_140, out s9_109, out s10_100);
	if (a0_41 != 0x00)
	{
		if (((word32) s0_38->b0005 & 0x01) == 0x00)
		{
			word32 a1_242;
			word32 a2_243;
			word32 a3_244;
			word32 a4_245;
			word32 a5_246;
			word32 a6_247;
			word32 a7_248;
			memcpy(s2_136, &s0_38->b0005 + 0x0C, 32, out a1_242, out a2_243, out a3_244, out a4_245, out a5_246, out a6_247, out a7_248);
			word32 s0_249;
			word32 s1_250;
			word32 a0_251;
			ra_185 = supplicantGenerateRand(ra_185, dwArg00, dwArg04, dwArg4C, dwArgF8, dwArg0148, dwArg0168, out s0_249, out s1_250, out a0_251, out a3_177, out a4_179, out s9_109, out s10_100);
		}
		word32 a2_234;
		word32 a5_235;
		word32 a6_236;
		word32 s3_237;
		word32 s4_238;
		word32 s5_239;
		word32 s6_240;
		word32 s8_241;
		s0_130 = dbg_test_print(&g_b23075D78, dwArg0168, out s1_131, out a2_234, out a5_235, out a6_236, out s2_136, out s3_237, out s4_238, out s5_239, out s6_240, out s7_140, out s8_241);
	}
	else
		s0_130.u0 = 0x00;
	0x00 = (uint16) dwArg38;
	s1Out = s1_131;
	a0Out = s0_130;
	a3Out = a3_177;
	a4Out = a4_179;
	s2Out = s2_136;
	s7Out = s7_140;
	s9Out = s9_109;
	s10Out = s10_100;
	return ra_185;
}

