pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301141E: Register Eq_2 ProcessRxEAPOL_PwkMsg3(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_51381) s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg3
Eq_2 ProcessRxEAPOL_PwkMsg3(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, struct Eq_51381 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_2 s0_172;
	word32 s1_300;
	word32 a2_301;
	word32 a5_302;
	word32 a6_303;
	word32 s2_304;
	word32 s3_305;
	word32 s4_306;
	word32 s5_307;
	word32 s6_308;
	word32 s7_309;
	word32 s8_310;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_300, out a2_301, out a5_302, out a6_303, out s2_304, out s3_305, out s4_306, out s5_307, out s6_308, out s7_309, out s8_310);
	struct Eq_55460 * a0_42;
	Eq_2 a4_139;
	ptr32 a3_138;
	struct Eq_51381 * s1_119;
	ptr32 s10_253;
	ptr32 s2_120;
	ptr32 s7_125;
	ptr32 s9_103;
	Eq_2 ra_50 = GetKeyMsgNonceFromEAPOL(ra, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg2C, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_119, out a0_42, out a3_138, out a4_139, out s2_120, out s7_125, out s9_103, out s10_253);
	if (a0_42 != null)
	{
		s1_119->w00F8 = 0x01;
		s1_119->dw00F4 = 0x00;
		if (((word32) a0_42->b0005 & 0x10) != 0x00)
		{
			word32 a2_319;
			word32 a5_320;
			mm_timer_clear(&s1_119->w00F8 + 8, a4_139, out a2_319, out a5_320);
			word32 s1_321;
			word32 s3_322;
			KeyMgmtSta_ApplyKEK(dwArg0138, dwArg0158, out s1_321, out a3_138, out a4_139, out s3_322, out s9_103, out s10_253);
			word32 a0_114;
			s1_119 = keyMgmtProcessMsgExt(dwArg18, dwArg0148, out a0_114, out s2_120, out s7_125);
			if (a0_114 == 0x00)
				goto l2301145C;
			a3_138 = parseKeyDataGTK(dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out a4_139);
		}
		word32 a2_311;
		word32 a5_312;
		word32 a6_313;
		word32 s3_314;
		word32 s4_315;
		word32 s5_316;
		word32 s6_317;
		word32 s8_318;
		s0_172 = dbg_test_print(&g_b23075D78, dwArg0158, out s1_119, out a2_311, out a5_312, out a6_313, out s2_120, out s3_314, out s4_315, out s5_316, out s6_317, out s7_125, out s8_318);
l2301145E:
		s1Out = s1_119;
		a0Out = s0_172;
		a3Out = a3_138;
		a4Out = a4_139;
		s2Out = s2_120;
		s7Out = s7_125;
		s9Out = s9_103;
		s10Out = s10_253;
		return ra_50;
	}
	else
	{
l2301145C:
		s0_172.u0 = 0x00;
		goto l2301145E;
	}
}

// 230114DC: Register Eq_2 ProcessRxEAPOL_GrpMsg1(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_GrpMsg1
Eq_2 ProcessRxEAPOL_GrpMsg1(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s10Out)
{
	Eq_2 s0_240;
	word32 a0_373;
	word32 s2_374;
	word32 s7_375;
	word32 s1_372;
	word32 s9_376;
	ptr32 a4_166;
	ptr32 a3_171;
	ptr32 s10_28;
	Eq_2 ra_26 = GetKeyMsgNonceFromEAPOL(ra, dwLoc30, dwLoc2C, dwLoc08, dwArg08, dwArg1C, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_372, out a0_373, out a3_171, out a4_166, out s2_374, out s7_375, out s9_376, out s10_28);
	word32 s1_377;
	word32 a2_378;
	word32 a5_379;
	word32 a6_380;
	word32 s3_381;
	word32 s4_382;
	word32 s5_383;
	word32 s6_384;
	word32 s7_385;
	word32 s8_386;
	ptr32 s2_218;
	if (dbg_test_print(&g_b23075D64, dwArg0148, out s1_377, out a2_378, out a5_379, out a6_380, out s2_218, out s3_381, out s4_382, out s5_383, out s6_384, out s7_385, out s8_386) != 0x00)
	{
		Eq_2 a4_77;
		struct Eq_55605 * s1_82;
		Eq_2 s3_85;
		word32 a3_387;
		word32 s9_388;
		struct Eq_55540 * s0_81 = KeyMgmtSta_ApplyKEK(dwArg0128, dwArg0148, out s1_82, out a3_387, out a4_77, out s3_85, out s9_388, out s10_28);
		*(struct Eq_55605 **) 117 = s1_82;
		word32 a2_389;
		word32 a5_390;
		mm_timer_clear(&s1_82->w00D2 + 27, a4_77, out a2_389, out a5_390);
		ui32 a5_110 = (word32) s0_81->b0061;
		ui32 a2_111 = (word32) s0_81->b0062;
		if ((word32) s0_81->b0004 == 0x02)
		{
			a3_171 = parseKeyDataGTK(dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a4_166);
			word32 a0_212;
			word32 s7_417;
			keyMgmtProcessMsgExt(dwArg08, dwArg0138, out a0_212, out s2_218, out s7_417);
			if (a0_212 == 0x00)
				goto l23011518;
		}
		else
		{
			word32 a1_391;
			word32 a2_392;
			word32 a3_393;
			word32 a4_394;
			word32 a5_395;
			word32 a6_396;
			word32 a7_397;
			memcpy(s3_85, &s0_81->b0062 + 1, a2_111 << 8 | a5_110, out a1_391, out a2_392, out a3_393, out a4_394, out a5_395, out a6_396, out a7_397);
			word32 a1_398;
			word32 a2_399;
			word32 a3_400;
			word32 a4_401;
			word32 a5_402;
			word32 a6_403;
			word32 a7_404;
			memcpy(fp + -40, &s1_82->dw000C + 46, 0x08, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a6_403, out a7_404);
			word32 a1_405;
			word32 a2_406;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a6_410;
			word32 a7_411;
			memcpy(&s1_82->dw000C + 46, &s1_82->dw000C + 44, 0x08, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a6_410, out a7_411);
			word32 a1_412;
			word32 a2_413;
			word32 a5_414;
			word32 a6_415;
			word32 a7_416;
			memcpy(&s1_82->dw000C + 44, fp + -40, 0x08, out a1_412, out a2_413, out a3_171, out a4_166, out a5_414, out a6_415, out a7_416);
			s1_82->w00D2 = (word16) ((word32) s0_81->b0006 >> 4 & 0x03);
		}
		word32 s1_418;
		word32 a2_419;
		word32 a5_420;
		word32 a6_421;
		word32 s3_422;
		word32 s4_423;
		word32 s5_424;
		word32 s6_425;
		word32 s7_426;
		word32 s8_427;
		s0_240 = dbg_test_print(&g_b23075D78, dwArg0148, out s1_418, out a2_419, out a5_420, out a6_421, out s2_218, out s3_422, out s4_423, out s5_424, out s6_425, out s7_426, out s8_427);
l2301151A:
		0x00 = (uint16) dwArg0128;
		a0Out = s0_240;
		a3Out = a3_171;
		a4Out = a4_166;
		s2Out = s2_218;
		s10Out = s10_28;
		return ra_26;
	}
	else
	{
l23011518:
		s0_240.u0 = 0x00;
		goto l2301151A;
	}
}

