pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 230115D6: Register word32 KeyMgmtResetCounter(Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s3Out)
// Called from:
//      supplicantInit
word32 KeyMgmtResetCounter(Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s3Out)
{
	struct Eq_55776 * s1_24;
	word32 a6_76;
	word32 a5_75;
	word32 a2_74;
	word32 s2_77;
	word32 s3_78;
	word32 s4_79;
	word32 s5_80;
	word32 s6_81;
	word32 s7_82;
	word32 s8_83;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_24, out a2_74, out a5_75, out a6_76, out s2_77, out s3_78, out s4_79, out s5_80, out s6_81, out s7_82, out s8_83);
	if (s1_24 != null)
	{
		s1_24->dw0070 = 0x00;
		s1_24->dw006C = 0x00;
	}
	word32 s1_52;
	ptr32 s3_58;
	word32 a2_84;
	word32 a5_85;
	word32 a6_86;
	word32 s2_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_52, out a2_84, out a5_85, out a6_86, out s2_87, out s3_58, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92);
	s3Out = s3_58;
	return s1_52;
}

// 23011636: Register word32 keyMgmtSta_StartSession_internal(Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s3Out)
// Called from:
//      keyMgmtSta_StartSession
word32 keyMgmtSta_StartSession_internal(Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s3Out)
{
	struct Eq_55837 * s2_35;
	word32 s3_36;
	word32 a6_115;
	word32 a5_114;
	word32 a2_113;
	word32 s1_112;
	word32 s4_116;
	word32 s5_117;
	word32 s6_118;
	word32 s7_119;
	word32 s8_120;
	Eq_2 s0_29 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_112, out a2_113, out a5_114, out a6_115, out s2_35, out s3_36, out s4_116, out s5_117, out s6_118, out s7_119, out s8_120);
	if (*((word32) s0_29 + 260) == 0x00)
	{
		word32 s1_121;
		word32 a0_122;
		word32 a1_123;
		word32 a2_124;
		word32 a4_125;
		word32 a5_126;
		word32 s2_127;
		word32 s3_128;
		word32 s4_129;
		word32 s8_130;
		s0_29 = mm_timer_set((word32) s0_29 + 264, s2_35->dw0120 + s3_36, a4, mstatus, out s1_121, out a0_122, out a1_123, out a2_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s8_130);
	}
	*((word32) s0_29 + 96) = 0x00;
	((word32) s0_29 + 100)->u0 = 0x00;
	((word32) s0_29 + 0x0068)->u0 = 0x00;
	word32 s1_82;
	ptr32 s3_88;
	word32 a2_131;
	word32 a5_132;
	word32 a6_133;
	word32 s2_134;
	word32 s4_135;
	word32 s5_136;
	word32 s6_137;
	word32 s7_138;
	word32 s8_139;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_82, out a2_131, out a5_132, out a6_133, out s2_134, out s3_88, out s4_135, out s5_136, out s6_137, out s7_138, out s8_139);
	s3Out = s3_88;
	return s1_82;
}

// 230116B6: Register Eq_2 KeyMgmtSta_InitSession(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      KeyMgmtInitSta
Eq_2 KeyMgmtSta_InitSession(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 s1_84;
	word32 a2_85;
	word32 a5_86;
	word32 a6_87;
	word32 s2_88;
	word32 s3_89;
	word32 s4_90;
	word32 s5_91;
	word32 s6_92;
	word32 s7_93;
	word32 s8_94;
	Eq_2 s0_27 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_84, out a2_85, out a5_86, out a6_87, out s2_88, out s3_89, out s4_90, out s5_91, out s6_92, out s7_93, out s8_94);
	((word32) s0_27 + 116)->u0 = 0x00;
	((word32) s0_27 + 0x0078)->u0 = 0x00;
	((word32) s0_27 + 0x0080)->u0 = 0x00;
	((word32) s0_27 + 0x007C)->u0 = 0x00;
	((word32) s0_27 + 268)->u1 = 0x23010430;
	*((word32) s0_27 + 272) = s0_27;
	ptr32 s2_66;
	word32 s1_95;
	word32 a2_96;
	word32 a5_97;
	word32 a6_98;
	word32 s3_99;
	word32 s4_100;
	word32 s5_101;
	word32 s6_102;
	word32 s7_103;
	word32 s8_104;
	Eq_2 s0_60 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_95, out a2_96, out a5_97, out a6_98, out s2_66, out s3_99, out s4_100, out s5_101, out s6_102, out s7_103, out s8_104);
	s2Out = s2_66;
	return s0_60;
}

// 2301172C: Register Eq_2 set_psk(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_10470) s1Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_sta_add
Eq_2 set_psk(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, struct Eq_8990 & s1Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out)
{
	Eq_2 s3_42;
	word32 s1_142;
	word32 a2_143;
	word32 a5_144;
	word32 a6_145;
	word32 s2_146;
	word32 s4_147;
	word32 s5_148;
	word32 s6_149;
	word32 s7_150;
	word32 s8_151;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_142, out a2_143, out a5_144, out a6_145, out s2_146, out s3_42, out s4_147, out s5_148, out s6_149, out s7_150, out s8_151);
	word32 t1_152;
	word32 a0_153;
	word32 a1_154;
	word32 a2_155;
	word32 a3_156;
	word32 a4_157;
	word32 a5_158;
	Eq_2 ra_56 = memset(ra, 0x42047EA4, 0x00FF, 67, out t1_152, out a0_153, out a1_154, out a2_155, out a3_156, out a4_157, out a5_158);
	word32 a1_159;
	word32 a2_160;
	word32 a3_161;
	word32 a4_162;
	word32 a5_163;
	strlen(s3_42, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163);
	word32 s2_164;
	pmkCacheSetPassphrase(ra_56, mstatus, dwLoc08, dwArg38, dwArg78, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s2_164);
	struct Eq_8990 * s1_104;
	ptr32 s4_105;
	ptr32 s2_109;
	byte * s3_110;
	word32 a2_165;
	word32 a5_166;
	word32 a6_167;
	word32 s5_168;
	word32 s6_169;
	word32 s7_170;
	word32 s8_171;
	Eq_2 s0_103 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_104, out a2_165, out a5_166, out a6_167, out s2_109, out s3_110, out s4_105, out s5_168, out s6_169, out s7_170, out s8_171);
	s1Out = s1_104;
	s2Out = s2_109;
	s3Out = s3_110;
	s4Out = s4_105;
	return s0_103;
}

// 230117B4: Register word32 remove_psk(Register Eq_2 ra, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_10922) s3Out, Register out (ptr32 Eq_10923) s6Out)
// Called from:
//      mm_sta_del
word32 remove_psk(Eq_2 ra, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178, struct Eq_10922 & s3Out, struct Eq_10923 & s6Out)
{
	word32 s1_106;
	word32 a2_107;
	word32 a5_108;
	word32 a6_109;
	word32 s2_110;
	word32 s3_111;
	word32 s4_112;
	word32 s5_113;
	word32 s6_114;
	word32 s7_115;
	word32 s8_116;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_106, out a2_107, out a5_108, out a6_109, out s2_110, out s3_111, out s4_112, out s5_113, out s6_114, out s7_115, out s8_116);
	word32 s2_117;
	pmkCacheDeletePSK(ra, dwArgF8, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out s2_117);
	word32 s1_78;
	struct Eq_10922 * s3_84;
	struct Eq_10923 * s6_86;
	word32 a2_118;
	word32 a5_119;
	word32 a6_120;
	word32 s2_121;
	word32 s4_122;
	word32 s5_123;
	word32 s7_124;
	word32 s8_125;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_78, out a2_118, out a5_119, out a6_120, out s2_121, out s3_84, out s4_122, out s5_123, out s6_86, out s7_124, out s8_125);
	s3Out = s3_84;
	s6Out = s6_86;
	return s1_78;
}

// 23011816: void bl_sha256_crypto_kdf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_55030 a1, Register Eq_2 a4, Register int32 a5, Register Eq_2 a6, Register int32 a7)
// Called from:
//      KeyMgmt_DerivePTK
void bl_sha256_crypto_kdf(Eq_2 ra, Eq_2 a0, Eq_55030 a1, Eq_2 a4, int32 a5, Eq_2 a6, int32 a7)
{
	Eq_2 s2_14 = (word32) a4 + a5;
	Eq_55030 s7_41 = a1;
	word16 wLoc72_156 = (word16) a7;
	word16 wLoc62_157 = 0x01;
	Eq_2 s1_106 = s2_14;
	uint32 s0_107 = a7 + 0x00FF >> 8 & 0x00FF;
	while (s0_107 >= (word32) wLoc62_157)
	{
		a6 = hmac_sha256_vector(ra, a0, s7_41, 0x04, fp + -96, fp + -80, s1_106, out s7_41);
		s1_106 = (word32) s1_106 + 32;
		s0_107 = dwLoc78;
		wLoc62_157 = (word16) ((word32) SLICE(a5, word16, 16) + 0x01);
	}
	word32 a7_207;
	word32 a6_206;
	word32 a5_205;
	word32 a4_204;
	word32 a3_203;
	word32 a2_202;
	word32 a1_201;
	memcpy(a6, s2_14, (word32) wLoc72_156 >> 3, out a1_201, out a2_202, out a3_203, out a4_204, out a5_205, out a6_206, out a7_207);
}

// 230118CA: Register Eq_2 pmkCacheFindPSK(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a4Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
Eq_2 pmkCacheFindPSK(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a4Out)
{
	word32 a6_204;
	word32 a5_203;
	word32 a2_202;
	word32 s1_201;
	word32 s2_205;
	word32 s3_206;
	word32 s4_207;
	word32 s5_208;
	word32 s6_209;
	word32 s7_210;
	word32 s8_211;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_201, out a2_202, out a5_203, out a6_204, out s2_205, out s3_206, out s4_207, out s5_208, out s6_209, out s7_210, out s8_211);
	word32 s3_212;
	word32 s4_213;
	word32 s5_214;
	ptr32 a4_117;
	if (pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_117, out s3_212, out s4_213, out s5_214) == 0x00 && (word32) g_b42047F70 != 0x00)
	{
		pmkCacheAddPSK(ra, dwArgE8, dwArgF8, dwArg0108, dwArg0138, dwArg0158);
		Eq_2 s4_100;
		word32 a4_226;
		word32 s3_227;
		word32 s5_228;
		Eq_2 a0_89 = pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_226, out s3_227, out s4_100, out s5_228);
		word32 a1_229;
		word32 a2_230;
		word32 a3_231;
		word32 a4_232;
		word32 a5_233;
		word32 s1_234;
		word32 a5_235;
		pmkCacheGeneratePSK(ra, strlen((word32) s4_100 - 144, out a1_229, out a2_230, out a3_231, out a4_232, out a5_233) & 0x00FF, s4_100, mstatus, dwArg18, dwArg58, dwArg98, dwArgE8, dwArg0108, dwArg0128, dwArg0158, out s1_234, out a5_235);
		a4_117 = (word32) a0_89 + 32;
	}
	word32 s1_215;
	word32 a2_216;
	word32 a5_217;
	word32 a6_218;
	word32 s2_219;
	word32 s3_220;
	word32 s4_221;
	word32 s5_222;
	word32 s6_223;
	word32 s7_224;
	word32 s8_225;
	Eq_2 a0_163 = dbg_test_print(&g_b23075D78, dwArg0158, out s1_215, out a2_216, out a5_217, out a6_218, out s2_219, out s3_220, out s4_221, out s5_222, out s6_223, out s7_224, out s8_225);
	a4Out = a4_117;
	return a0_163;
}

// 2301197A: Register Eq_2 pmkCacheSetPassphrase(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      set_psk
Eq_2 pmkCacheSetPassphrase(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out)
{
	Eq_2 s1_38;
	word32 a2_205;
	word32 a5_206;
	word32 a6_207;
	word32 s2_208;
	word32 s3_209;
	word32 s4_210;
	word32 s5_211;
	word32 s6_212;
	word32 s7_213;
	word32 s8_214;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_38, out a2_205, out a5_206, out a6_207, out s2_208, out s3_209, out s4_210, out s5_211, out s6_212, out s7_213, out s8_214);
	if (s1_38 != 0x00)
	{
		word32 a1_215;
		word32 a2_216;
		word32 a3_217;
		word32 a4_218;
		word32 a5_219;
		word32 a6_220;
		word32 a7_221;
		memcpy(0x42047F70, s1_38, 64, out a1_215, out a2_216, out a3_217, out a4_218, out a5_219, out a6_220, out a7_221);
		pmkCacheAddPSK(ra, dwArgE8, dwArgF8, dwArg0108, dwArg0138, dwArg0158);
		Eq_56345 s3_99;
		Eq_2 s4_100;
		word32 a4_222;
		word32 s5_223;
		pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_222, out s3_99, out s4_100, out s5_223);
		word32 s1_224;
		word32 a5_225;
		pmkCacheGeneratePSK(ra, s3_99, s4_100, mstatus, dwArg18, dwArg58, dwArg98, dwArgE8, dwArg0108, dwArg0128, dwArg0158, out s1_224, out a5_225);
	}
	ptr32 s2_153;
	word32 s1_226;
	word32 a2_227;
	word32 a5_228;
	word32 a6_229;
	word32 s3_230;
	word32 s4_231;
	word32 s5_232;
	word32 s6_233;
	word32 s7_234;
	word32 s8_235;
	Eq_2 s0_147 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_226, out a2_227, out a5_228, out a6_229, out s2_153, out s3_230, out s4_231, out s5_232, out s6_233, out s7_234, out s8_235);
	s2Out = s2_153;
	return s0_147;
}

// 23011A1A: Register Eq_2 pmkCacheInit(Register Eq_2 ra, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
// Called from:
//      supplicantRestoreDefaults
Eq_2 pmkCacheInit(Eq_2 ra, Eq_2 dwArg38, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	word32 s1_94;
	word32 a2_95;
	word32 a5_96;
	word32 a6_97;
	word32 s2_98;
	word32 s3_99;
	word32 s4_100;
	word32 s5_101;
	word32 s6_102;
	word32 s7_103;
	word32 s8_104;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_94, out a2_95, out a5_96, out a6_97, out s2_98, out s3_99, out s4_100, out s5_101, out s6_102, out s7_103, out s8_104);
	word32 t1_105;
	word32 a0_106;
	word32 a1_107;
	word32 a2_108;
	word32 a3_109;
	word32 a4_110;
	word32 a5_111;
	word32 t1_112;
	word32 a0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a3_116;
	word32 a4_117;
	word32 a5_118;
	Eq_2 ra_57 = memset(memset(ra, 0x42047EE8, 0x00, 0x0086, out t1_105, out a0_106, out a1_107, out a2_108, out a3_109, out a4_110, out a5_111), 0x42047F70, 0x00, 64, out t1_112, out a0_113, out a1_114, out a2_115, out a3_116, out a4_117, out a5_118);
	g_b42048FB0 = 0x00;
	0x00 = (uint16) dwArg38;
	word32 s1_119;
	word32 a2_120;
	word32 a5_121;
	word32 a6_122;
	word32 s2_123;
	word32 s3_124;
	word32 s4_125;
	word32 s5_126;
	word32 s6_127;
	word32 s7_128;
	word32 s8_129;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_119, out a2_120, out a5_121, out a6_122, out s2_123, out s3_124, out s4_125, out s5_126, out s6_127, out s7_128, out s8_129);
	return ra_57;
}

// 23011A96: Register Eq_2 pmkCacheRomInit(Stack Eq_2 dwArg38, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      supplicantRestoreDefaults
Eq_2 pmkCacheRomInit(Eq_2 dwArg38, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 s1_78;
	word32 a2_79;
	word32 a5_80;
	word32 a6_81;
	word32 s2_82;
	word32 s3_83;
	word32 s4_84;
	word32 s5_85;
	word32 s6_86;
	word32 s7_87;
	word32 s8_88;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_78, out a2_79, out a5_80, out a6_81, out s2_82, out s3_83, out s4_84, out s5_85, out s6_86, out s7_87, out s8_88);
	g_dw42048FBC = 0x02;
	g_dw42048FB8 = 0x42047EE8;
	g_dw42048FB4 = 0x42047F70;
	0x00 = (uint16) dwArg38;
	ptr32 s2_63;
	word32 s1_89;
	word32 a2_90;
	word32 a5_91;
	word32 a6_92;
	word32 s3_93;
	word32 s4_94;
	word32 s5_95;
	word32 s6_96;
	word32 s7_97;
	word32 s8_98;
	Eq_2 s0_57 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_89, out a2_90, out a5_91, out a6_92, out s2_63, out s3_93, out s4_94, out s5_95, out s6_96, out s7_97, out s8_98);
	s2Out = s2_63;
	return s0_57;
}

