pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23011B10: Register ptr32 pmkCacheNewElement(Register Eq_2 ra, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      pmkCacheAddPSK
ptr32 pmkCacheNewElement(Eq_2 ra, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	struct Eq_56634 * s4_43;
	struct Eq_56635 * s2_47;
	struct Eq_56636 * s5_49;
	word32 s6_50;
	word32 a6_249;
	word32 s7_250;
	word32 s8_251;
	word32 a5_248;
	word32 s1_246;
	word32 a2_247;
	Eq_2 s3_102;
	Eq_2 s0_109 = dbg_test_print(&g_b23075D64, dwArg0148, out s1_246, out a2_247, out a5_248, out a6_249, out s2_47, out s3_102, out s4_43, out s5_49, out s6_50, out s7_250, out s8_251);
	while (true)
	{
		Eq_2 a5_54 = s5_49->tFFFFFFBC;
		if (s0_109 >= a5_54)
			break;
		if ((int32) s2_47->bFFFFFFB0 == a5_54)
		{
			struct Eq_56695 * a5_62 = (word32) s4_43->tFFFFFFB8 + ((word32) s0_109 + s6_50);
			a5_62->b0042 = (byte) ((word32) a5_62->b0042 + ~0x00);
		}
		if (s3_102 == 0x00)
		{
			int32 s7_70 = (word32) s0_109 + s6_50;
			Eq_2 s1_74 = (word32) s4_43->tFFFFFFB8 + s7_70;
			if ((int32) *((word32) s1_74 + 66) == 0x00)
			{
				word32 t1_260;
				word32 a2_263;
				word32 a3_264;
				word32 a1_262;
				word32 a0_261;
				word32 a4_265;
				word32 a5_266;
				ra = memset(ra, s1_74, 0x00, 67, out t1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266);
				Eq_2 a5_91 = (int32) s2_47->bFFFFFFB0;
				if (a5_91 < s5_49->tFFFFFFBC)
					s2_47->b0FB0 = (byte) ((word32) a5_91 + 1);
				(word32) s4_43->tFFFFFFB8 + s7_70 + 66 = (int32) (byte) (word32) s2_47->bFFFFFFB0;
				s3_102 = s1_74;
			}
		}
		s0_109 = (word32) s0_109 + 1 & 0x00FF;
	}
	word32 a2_253;
	word32 s8_259;
	word32 s7_258;
	word32 s6_257;
	ptr32 s2_134;
	ptr32 s3_135;
	ptr32 s5_136;
	word32 a5_254;
	word32 s4_256;
	word32 a6_255;
	word32 s1_252;
	dbg_test_print(&g_b23075D78, dwArg0148, out s1_252, out a2_253, out a5_254, out a6_255, out s2_134, out s3_135, out s4_256, out s5_136, out s6_257, out s7_258, out s8_259);
	0x00 = (uint16) dwArg0128;
	s2Out = s2_134;
	s3Out = s3_135;
	s4Out = dwArg78;
	s5Out = s5_136;
	return s3_135;
}

// 23011C06: void pmkCacheUpdateReplacementRank(Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
// Called from:
//      pmkCacheFindPSKElement
void pmkCacheUpdateReplacementRank(Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	struct Eq_56779 * s1_24;
	word32 a2_125;
	word32 a5_126;
	word32 a6_127;
	word32 s2_128;
	word32 s3_129;
	word32 s4_130;
	word32 s5_131;
	word32 s6_132;
	word32 s7_133;
	word32 s8_134;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_24, out a2_125, out a5_126, out a6_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134);
	if (s1_24 != null)
	{
		int32 a2_35 = (int32) g_b42047FB0;
		if ((int32) s1_24->b0042 != a2_35)
		{
			int32 a1_38 = g_dw42047FBC;
			int32 a0_40 = g_dw42047FB8;
			int32 a5_42 = 0x00;
			while (a5_42 < a1_38)
			{
				struct Eq_56823 * a4_51 = a5_42 + 67 + a0_40;
				int32 a3_52 = (int32) a4_51->b0042;
				if ((int32) s1_24->b0042 < a3_52)
					a4_51->b0042 = (byte) (a3_52 + ~0x00);
				a5_42 = a5_42 + 0x01 & 0x00FF;
			}
			s1_24->b0042 = (byte) a2_35;
		}
	}
	word32 s1_135;
	word32 a2_136;
	word32 a5_137;
	word32 a6_138;
	word32 s2_139;
	word32 s3_140;
	word32 s4_141;
	word32 s5_142;
	word32 s6_143;
	word32 s7_144;
	word32 s8_145;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_135, out a2_136, out a5_137, out a6_138, out s2_139, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145);
}

// 23011CAC: Register word32 pmkCacheFindPSKElement(Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
//      pmkCacheAddPSK
//      pmkCacheDeletePSK
word32 pmkCacheFindPSKElement(Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 s8_47;
	Eq_2 s2_50;
	struct Eq_56880 * s3_51;
	Eq_2 s6_53;
	struct Eq_56882 * s7_54;
	word32 s4_198;
	word32 s5_199;
	word32 a5_196;
	word32 a6_197;
	word32 s1_194;
	word32 a2_195;
	Eq_2 s0_44 = dbg_test_print(&g_b23075D64, dwArg0148, out s1_194, out a2_195, out a5_196, out a6_197, out s2_50, out s3_51, out s4_198, out s5_199, out s6_53, out s7_54, out s8_47);
	while (s0_44 < s7_54->tFFFFFFBC)
	{
		Eq_2 a0_63 = s3_51->dwFFFFFFB8 + ((word32) s0_44 + s8_47);
		if ((int32) *((word32) a0_63 + 66) != 0x00 && (word32) (*((word32) a0_63 + 64)) == s2_50)
		{
			word32 a1_208;
			word32 a2_209;
			word32 a3_210;
			word32 a5_211;
			memcmp(a0_63, s6_53, s2_50, out a1_208, out a2_209, out a3_210, out a4, out a5_211) != 0x00;
		}
		s0_44 = (word32) s0_44 + 1 & 0x00FF;
	}
	pmkCacheUpdateReplacementRank(dwArg0138, dwArg0148);
	word32 s4_204;
	word32 s8_207;
	word32 s1_113;
	ptr32 s3_119;
	ptr32 s5_120;
	word32 s7_206;
	word32 s6_205;
	word32 a6_202;
	word32 s2_203;
	word32 a2_200;
	word32 a5_201;
	dbg_test_print(&g_b23075D78, dwArg0148, out s1_113, out a2_200, out a5_201, out a6_202, out s2_203, out s3_119, out s4_204, out s5_120, out s6_205, out s7_206, out s8_207);
	0x00 = (uint16) dwArg0128;
	a4Out = a4;
	s3Out = s3_119;
	s4Out = dwArg78;
	s5Out = s5_120;
	return s1_113;
}

// 23011D72: void pmkCacheAddPSK(Register Eq_2 ra, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
// Called from:
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
void pmkCacheAddPSK(Eq_2 ra, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	word32 s1_219;
	word32 a2_220;
	word32 a5_221;
	word32 a6_222;
	word32 s2_223;
	word32 s3_224;
	word32 s4_225;
	word32 s5_226;
	word32 s6_227;
	word32 s7_228;
	word32 s8_229;
	dbg_test_print(&g_b23075D64, dwArg0158, out s1_219, out a2_220, out a5_221, out a6_222, out s2_223, out s3_224, out s4_225, out s5_226, out s6_227, out s7_228, out s8_229);
	word32 a4_230;
	word32 s4_231;
	Eq_2 s3_107;
	word32 s5_125;
	Eq_2 a0_50 = pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_230, out s3_107, out s4_231, out s5_125);
	Eq_2 s0_110 = a0_50;
	if (a0_50 == 0x00)
	{
		Eq_2 s2_79;
		Eq_2 s4_81;
		Eq_2 a0_69 = pmkCacheNewElement(ra, dwArg0108, dwArg0128, out s2_79, out s3_107, out s4_81, out s5_125);
		word32 a1_232;
		word32 a2_233;
		word32 a3_234;
		word32 a4_235;
		word32 a5_236;
		word32 a6_237;
		word32 a7_238;
		memcpy(a0_69, s4_81, s2_79, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236, out a6_237, out a7_238);
		*((word32) a0_69 + 64) = (byte) s2_79;
		s0_110 = a0_69;
	}
	if (s3_107 != 0x00)
	{
		word32 a1_239;
		word32 a2_240;
		word32 a3_241;
		word32 a4_242;
		word32 a5_243;
		word32 a6_244;
		word32 a7_245;
		memcpy((word32) s0_110 + 32, s3_107, 32, out a1_239, out a2_240, out a3_241, out a4_242, out a5_243, out a6_244, out a7_245);
		((word32) s0_110 + 65)->u1 = (byte) s5_125;
	}
	word32 s1_246;
	word32 a2_247;
	word32 a5_248;
	word32 a6_249;
	word32 s2_250;
	word32 s3_251;
	word32 s4_252;
	word32 s5_253;
	word32 s6_254;
	word32 s7_255;
	word32 s8_256;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_246, out a2_247, out a5_248, out a6_249, out s2_250, out s3_251, out s4_252, out s5_253, out s6_254, out s7_255, out s8_256);
}

