pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23011E12: Register Eq_2 pmkCacheDeletePSK(Register Eq_2 ra, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      remove_psk
Eq_2 pmkCacheDeletePSK(Eq_2 ra, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 a4_115;
	word32 s3_116;
	word32 s4_117;
	word32 s5_118;
	pmkCacheFindPSKElement(dwArg0118, dwArg0128, dwArg0138, out a4_115, out s3_116, out s4_117, out s5_118);
	Eq_2 s1_41;
	word32 a2_119;
	word32 a5_120;
	word32 a6_121;
	word32 s2_122;
	word32 s3_123;
	word32 s4_124;
	word32 s5_125;
	word32 s6_126;
	word32 s7_127;
	word32 s8_128;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_41, out a2_119, out a5_120, out a6_121, out s2_122, out s3_123, out s4_124, out s5_125, out s6_126, out s7_127, out s8_128);
	if (s1_41 != 0x00)
	{
		word32 t1_129;
		word32 a0_130;
		word32 a1_131;
		word32 a2_132;
		word32 a3_133;
		word32 a4_134;
		word32 a5_135;
		memset(ra, s1_41, 0x00, 67, out t1_129, out a0_130, out a1_131, out a2_132, out a3_133, out a4_134, out a5_135);
		g_b42048FB0 = (byte) ((word32) g_b42047FB0 + ~0x00);
	}
	ptr32 s2_88;
	word32 s1_136;
	word32 a2_137;
	word32 a5_138;
	word32 a6_139;
	word32 s3_140;
	word32 s4_141;
	word32 s5_142;
	word32 s6_143;
	word32 s7_144;
	word32 s8_145;
	Eq_2 s0_82 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_136, out a2_137, out a5_138, out a6_139, out s2_88, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145);
	s2Out = s2_88;
	return s0_82;
}

// 23011E88: Register word32 pmkCacheGetHexNibble(Stack Eq_2 dwArg0158, Register out Eq_57184 a0Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      pmkCacheGeneratePSK
word32 pmkCacheGetHexNibble(Eq_2 dwArg0158, union Eq_57184 & a0Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 s0_49;
	word32 a2_101;
	word32 a5_102;
	word32 a6_103;
	word32 s2_104;
	word32 s4_105;
	word32 s6_106;
	word32 s7_107;
	word32 s8_108;
	ptr32 s3_34;
	word32 s1_28;
	ptr32 s5_35;
	Eq_2 s0_27 = dbg_test_print(&g_b23075D64, dwArg0158, out s1_28, out a2_101, out a5_102, out a6_103, out s2_104, out s3_34, out s4_105, out s5_35, out s6_106, out s7_107, out s8_108);
	if (s0_27 > 96)
		s0_49 = (word32) s0_27 - 87;
	else if (s0_27 > 64)
		s0_49 = (word32) s0_27 - 55;
	else
	{
		word32 a2_109;
		word32 a5_110;
		word32 a6_111;
		word32 s2_112;
		word32 s4_113;
		word32 s6_114;
		word32 s7_115;
		word32 s8_116;
		s0_49 = dbg_test_print(&g_b23075D78, dwArg0158, out s1_28, out a2_109, out a5_110, out a6_111, out s2_112, out s3_34, out s4_113, out s5_35, out s6_114, out s7_115, out s8_116);
	}
	a0Out = s0_49 & 0x00FF;
	s3Out = s3_34;
	s4Out = dwArg04;
	s5Out = s5_35;
	return s1_28;
}

// 23011F04: Register Eq_2 pmkCacheGeneratePSK(Register Eq_2 ra, Register Eq_56345 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a5Out)
// Called from:
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
//      KeyMgmtInit
Eq_2 pmkCacheGeneratePSK(Eq_2 ra, Eq_56345 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a5Out)
{
	Eq_2 s1_40;
	Eq_2 s4_41;
	Eq_2 s3_46;
	word32 s5_239;
	word32 s6_240;
	word32 s7_241;
	word32 s8_242;
	word32 s2_238;
	word32 a6_237;
	word32 a5_236;
	word32 a2_235;
	Eq_2 s0_39 = dbg_test_print(&g_b23075D64, dwArg0148, out s1_40, out a2_235, out a5_236, out a6_237, out s2_238, out s3_46, out s4_41, out s5_239, out s6_240, out s7_241, out s8_242);
	if (s4_41 != 0x00 && s0_39 != 0x00)
	{
		if (a3 <= -63)
			utils_wifi_psk_cal_fast_bin(ra, s0_39, s1_40, s3_46, s3_46, s4_41, mstatus, s4, dwArg38, dwArg78, dwArgB8, dwArg0108);
		else if (a3 == 64)
		{
			do
			{
				word32 a0_252;
				word32 s3_253;
				word32 s4_254;
				word32 s5_255;
				pmkCacheGetHexNibble(dwArg0128, out a0_252, out s3_253, out s4_254, out s5_255);
				ui32 a0_79;
				int32 s3_87;
				int32 s4_88;
				int32 s5_89;
				*((word32) (s3_87 >> 0x01) + s4_88) = (byte) (a0_79 | pmkCacheGetHexNibble(dwArg0128, out a0_79, out s3_87, out s4_88, out s5_89) << 0x04);
			} while (s3_87 + 0x02 != s5_89);
		}
	}
	0x00 = (uint16) dwArg0128;
	ptr32 a5_152;
	ptr32 s1_155;
	word32 a6_244;
	word32 a2_243;
	word32 s2_245;
	word32 s3_246;
	word32 s4_247;
	word32 s5_248;
	word32 s6_249;
	word32 s7_250;
	word32 s8_251;
	Eq_2 s0_154 = dbg_test_print(&g_b23075D78, dwArg0178, out s1_155, out a2_243, out a5_152, out a6_244, out s2_245, out s3_246, out s4_247, out s5_248, out s6_249, out s7_250, out s8_251);
	s1Out = s1_155;
	a5Out = a5_152;
	return s0_154;
}

// 23011FCC: void prepare_key(Register ptr32 a0, Register int32 a1, Register (ptr32 Eq_57359) a2)
// Called from:
//      RC4_Encrypt
void prepare_key(ptr32 a0, int32 a1, struct Eq_57359 * a2)
{
	int32 a5_3;
	for (a5_3 = 0x00; a5_3 != 0x0100; ++a5_3)
		a2[a5_3] = (struct Eq_57359) (byte) a5_3;
	a2[0x0100] = (struct Eq_57359) 0x00;
	a2[0x0101] = (struct Eq_57359) 0x00;
	struct Eq_57359 * a3_13 = a2;
	ui32 a7_15 = 0x00;
	int32 a4_16 = 0x00;
	do
	{
		word32 a6_25 = (word32) a3_13->b0000;
		ui32 a5_30 = (word32) (a0 + a4_16) + a6_25 + a7_15;
		byte * a5_34 = a2 + (a5_30 & 0x00FF);
		++a3_13;
		a3_13[0x0FFF] = (struct Eq_57359) (byte) (word32) *a5_34;
		*a5_34 = (byte) a6_25;
		a7_15 = a5_30 & 0x00FF;
		a4_16 = (a4_16 + 0x01 | a1) & 0x00FF;
	} while (a2 + 0x0100 != a3_13);
}

// 2301202A: Register ui32 rc4(Register ptr32 a0, Register Eq_53921 a1, Register int32 a2, Register (ptr32 Eq_57425) a3)
// Called from:
//      RC4_Encrypt
ui32 rc4(ptr32 a0, Eq_53921 a1, int32 a2, struct Eq_57425 * a3)
{
	word32 t3_5 = (word32) a3->b0100;
	ui32 a4_21 = (word32) a3->b0101;
	int32 a5_26 = 0x00;
	while (true)
	{
		ui32 a6_10 = t3_5 + a5_26;
		if (a5_26 >= a2)
			break;
		byte * a6_16 = a3 + ((a6_10 & 0x00FF) + 0x01 & 0x00FF) / 258;
		word32 t1_18 = (word32) *a6_16;
		ui32 a4_22 = a4_21 + t1_18;
		byte * a7_24 = a3 + (a4_22 & 0x00FF) / 258;
		*a6_16 = (byte) (word32) *a7_24;
		*a7_24 = (byte) t1_18;
		a4_21 = a4_22 & 0x00FF;
		a5_26 = (int32) (word16) (a5_26 + 0x01);
	}
	Eq_53921 a7_29 = 0x00;
	while (true)
	{
		ui32 a5_32 = (word32) a7_29.u0 + (a6_10 & 0x00FF);
		if (a7_29 >= a1)
			break;
		byte * a5_38 = a3 + ((a5_32 & 0x00FF) + 0x01 & 0x00FF) / 258;
		word32 a2_40 = (word32) *a5_38;
		ui32 a4_42 = a4_21 + a2_40;
		byte * t1_44 = a3 + (a4_42 & 0x00FF) / 258;
		*a5_38 = (byte) (word32) *t1_44;
		*t1_44 = (byte) a2_40;
		byte * t1_50 = (word32) a7_29.u0 + a0;
		*t1_50 = (byte) ((word32) a3[(a2_40 + (word32) (*a5_38) & 0x00FF) / 258] ^ (word32) (*t1_50));
		a4_21 = a4_42 & 0x00FF;
		a7_29.u0 = (int32) (word16) ((word32) a7_29.u0 + 1);
	}
	a3->b0100 = (byte) (a5_32 & 0x00FF);
	a3->b0101 = (byte) a4_21;
	return a4_21;
}

