pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301266A: Register Eq_2 KeyMgmtInit(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 a5Out)
// Called from:
//      InitGroupKey
Eq_2 KeyMgmtInit(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & a5Out)
{
	word32 a5_139;
	word32 a4_138;
	struct Eq_50194 * a0_12 = cm_GetApInfo(a0, out a4_138, out a5_139);
	struct Eq_58487 * s0_28;
	Eq_2 s4_34;
	ptr32 s1_121;
	Eq_2 ra_27 = ROM_InitGTK(ra, &a0_12->dw00B8 + 5, &a0_12->w00F2 + 1, (word32) a0 + 70, dwLoc08, dwArg58, dwArgA8, dwArgC8, out s0_28, out s1_121, out s4_34);
	ptr32 a5_116 = 0x01;
	if (s0_28->dw00B8 == 0x01)
	{
		word32 a5_144;
		word32 a4_143;
		word32 a3_142;
		word32 a2_141;
		word32 a1_140;
		pmkCacheGeneratePSK(ra_27, strlen((char *) s0_28 + 24, out a1_140, out a2_141, out a3_142, out a4_143, out a5_144) & 0x00FF, s4_34, mstatus, dwArg18, dwArg58, dwArg98, dwArgE8, dwArg0108, dwArg0128, dwArg0158, out s1_121, out a5_116)->dw00B8 = 0x00;
	}
	s1Out = s1_121;
	a5Out = a5_116;
	return ra_27;
}

// 230126C8: Register Eq_2 PrepDefaultEapolMsg(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      GeneratePWKMsg1
//      GeneratePWKMsg3
Eq_2 PrepDefaultEapolMsg(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg0118, Eq_2 dwArg0138, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 a4_203;
	word32 a5_204;
	cm_GetApData(a0, out a4_203, out a5_204);
	Eq_2 a4_28;
	word32 a5_205;
	cm_GetApInfo(a0, out a4_28, out a5_205);
	Eq_2 a0_36;
	word32 s1_206;
	ptr32 a5_113;
	ptr32 a4_170;
	ptr32 s5_120;
	Eq_2 ra_176 = GetTxEAPOLBuffer(ra, a3, a4_28, mstatus, s2, dwArg0118, out s1_206, out a0_36, out a4_170, out a5_113, out s5_120);
	Eq_2 s1_116 = a0_36;
	if (a0_36 != 0x00)
	{
		word32 t1_207;
		word32 a0_208;
		word32 a1_209;
		word32 a2_210;
		word32 a3_211;
		word32 a4_212;
		word32 a5_213;
		ra_176 = memset(ra_176, a0_36, 0x00, 114, out t1_207, out a0_208, out a1_209, out a2_210, out a3_211, out a4_212, out a5_213);
		struct Eq_58610 * s2_83;
		word32 s1_214;
		word32 s3_215;
		word32 s4_216;
		formEAPOLEthHdr(dwArg0118, dwArg0138, out s1_214, out a4_170, out s2_83, out s3_215, out s4_216);
		((word32) s2_83->b0014 & 0x08) != 0x00;
		ptr32 * s3_118;
		s1_116 = SetEAPOLKeyDescTypeVersion(dwArg0118, dwArg0138, out a5_113, out s3_118, out s5_120);
		*s3_118 = a5_113;
	}
	s1Out = s1_116;
	a0Out = s1_116;
	a4Out = a4_170;
	a5Out = a5_113;
	s4Out = dwArgF4;
	s5Out = s5_120;
	return ra_176;
}

// 2301274C: Register word32 GeneratePWKMsg1(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out (ptr32 Eq_58659) a4Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      GenerateApEapolMsg
word32 GeneratePWKMsg1(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a0Out, struct Eq_58659 & a4Out, ptr32 & s5Out, ptr32 & s10Out)
{
	ptr32 a0_172;
	word32 a4_254;
	word32 a5_255;
	cm_GetApData(a0, out a4_254, out a5_255);
	struct Eq_58669 * a5_29;
	word32 a0_45;
	word32 s4_256;
	ptr32 s5_160;
	word32 s1_154;
	struct Eq_58659 * a4_148;
	Eq_2 ra_31 = PrepDefaultEapolMsg(ra, a0, a3, s2, mstatus, dwArgE8, dwArg0108, out s1_154, out a0_45, out a4_148, out a5_29, out s4_256, out s5_160);
	if (a0_45 != 0x00)
	{
		a5_29->dw001D = a5_29->dw001C;
		if (a5_29 == (struct Eq_58669 *) 0x01)
			a4_148->dw0021 = a4_148->dw0020;
		struct Eq_50194 * a0_70;
		struct Eq_58697 * s0_79;
		Eq_2 s1_80;
		word32 a3_257;
		word32 a4_258;
		word32 s9_259;
		word32 s10_260;
		Eq_2 ra_78 = supplicantGenerateRand(ra_31, s2, s0, dwArg2C, dwArgD8, dwArg0128, dwArg0148, out s0_79, out s1_80, out a0_70, out a3_257, out a4_258, out s9_259, out s10_260);
		struct Eq_58713 * a4_108;
		PopulateKeyMsg(a0_70, (char *) s0_79 + 20, 0x00FFF800, fp + -24, s1_80, out a4_108);
		uint32 a1_126 = ((word32) a4_108->b0070 << 8 | (word32) a4_108->b006F) + 95 << 16;
		a4_108->b000E = (byte) (word32) s0_79->b0054;
		a4_108->b000F = 0x03;
		uint32 a5_135 = (word32) (word16) (a1_126 >> 16 << 0x08 | a1_126 >> 0x18);
		a4_108->b0010 = (byte) a5_135;
		a4_108->b0011 = (byte) (a5_135 >> 8);
		word32 s3_261;
		word32 s7_262;
		UpdateEAPOLWcbLenAndTransmit(ra_78, fflags, frm, mstatus, dwLoc08, dwArg24, dwArg2C, dwArg48, dwArg68, dwArg88, dwArg0128, dwArg0148, out s1_154, out a4_148, out s3_261, out s5_160, out s7_262, out s10);
		a0_172 = 0x00;
	}
	else
		a0_172 = 0x01;
	0x00 = (uint16) dwArg0128;
	a0Out = a0_172;
	a4Out = a4_148;
	s5Out = s5_160;
	s10Out = s10;
	return s1_154;
}

// 230127F6: Register word32 GeneratePWKMsg3(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      GenerateApEapolMsg
word32 GeneratePWKMsg3(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s5Out, ptr32 & s10Out)
{
	ptr32 a0_272;
	Eq_2 s4_34;
	word32 a0_43;
	word32 a5_508;
	ptr32 s5_184;
	word32 s1_254;
	ptr32 a4_248;
	Eq_2 ra_182 = PrepDefaultEapolMsg(ra, a0, a3, s2, mstatus, dwArgE8, dwArg0108, out s1_254, out a0_43, out a4_248, out a5_508, out s4_34, out s5_184);
	if (a0_43 == 0x00)
	{
l23012890:
		a0_272 = 0x01;
		goto l230128D4;
	}
	word32 a4_509;
	word32 a5_510;
	cm_GetApData(s4_34, out a4_509, out a5_510);
	struct Eq_58850 * a5_57;
	struct Eq_58851 * a4_56;
	struct Eq_50194 * a0_55 = cm_GetApInfo(s4_34, out a4_56, out a5_57);
	struct Eq_58857 * s0_58 = a5_57->ptr001C;
	a5_57->ptr001D = s0_58;
	if (a5_57 == (struct Eq_58850 *) 0x01)
	{
		s0_58 = a4_56->ptr0020;
		a4_56->ptr0021 = s0_58;
		a4_56 = (struct Eq_58851 *) ((char *) a4_56 + 1);
	}
	struct Eq_58857 * s0_76 = a4_56->ptr0020;
	word32 a4_511;
	struct Eq_58729 * a0_89 = PopulateKeyMsg(a0_55, &s0_76->w0012 + 1, (word32) (word16) ((word32) s0_58->w0012 << 0x0A & 0xF8000000 | 0x00FFF880), fp + -40, (word32) s4_34 + 0x00A4, out a4_511);
	ui32 a5_103 = (word32) s0_76->w0012;
	Eq_2 a3_104 = 0x00;
	if ((a5_103 & 8) == 0x00 && (a5_103 & 32) != 0x00)
		a3_104.u0 = 0x4201D0F8;
	ui32 a4_121;
	Eq_2 a5_122;
	Eq_2 a2_119;
	Eq_2 a0_117 = KeyData_UpdateKeyMaterial(a0_89, &s0_76->w0012, 0x00, a3_104, out a2_119, out a4_121, out a5_122);
	if (a0_117 != 0x00)
	{
		if (((word32) s0_76->w0012 & 32) != 0x00)
		{
			word32 s0_142;
			word32 a0_146;
			Eq_2 a3_148;
			Eq_2 s1_152;
			Eq_2 s3_154;
			ra_182 = Encrypt_keyData(prepareKDE(ra_182, a0_117, &a0_55->dw00B8 + 5, &a0_55->w0008, out s0_142, out s1_152, out a0_146, out a3_148, out s3_154), s1_152, a0_146, s0_142 + 0x0044, s3_154, a3_148, s3_154, mstatus, s2, s0, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a0_117, out a2_119, out a4_121, out a5_122, out s5_184, out s10);
			if (a0_117 == 0x00)
				goto l23012884;
		}
		word32 s3_529;
		word32 s7_530;
		UpdateEAPOLWcbLenAndTransmit(KeyMgmtSta_PopulateEAPOLLengthMic(ra_182, a4_121, dwArgF8, dwArg0118), fflags, frm, mstatus, dwLoc08, dwArg24, dwArg2C, dwArg48, dwArg68, dwArg88, dwArg0128, dwArg0148, out s1_254, out a4_248, out s3_529, out s5_184, out s7_530, out s10);
		a0_272 = 0x00;
l230128D4:
		0x00 = (uint16) dwArg0128;
		a0Out = a0_272;
		a4Out = a4_248;
		s5Out = s5_184;
		s10Out = s10;
		return s1_254;
	}
	else
	{
l23012884:
		Eq_2 a2_280;
		Eq_2 a5_283;
		Eq_2 s1_284;
		word32 s0_512;
		word32 a0_513;
		word32 a1_514;
		word32 a3_515;
		word32 a4_516;
		word32 a6_517;
		word32 s4_518;
		word32 t3_519;
		vPortFree(a0_117, a2_119, a5_122, mstatus, dwArg0128, dwArg0168, out s0_512, out s1_284, out a0_513, out a1_514, out a2_280, out a3_515, out a4_516, out a5_283, out a6_517, out s4_518, out t3_519);
		word32 s0_520;
		word32 a0_521;
		word32 a1_522;
		word32 a2_523;
		word32 a3_524;
		word32 a5_525;
		word32 a6_526;
		word32 s4_527;
		word32 t3_528;
		vPortFree(s1_284, a2_280, a5_283, mstatus, dwArg0128, dwArg0168, out s0_520, out s1_254, out a0_521, out a1_522, out a2_523, out a3_524, out a4_248, out a5_525, out a6_526, out s4_527, out t3_528);
		goto l23012890;
	}
}

// 230128E4: Register word32 ProcessPWKMsg4(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg01A4, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataAp
word32 ProcessPWKMsg4(Eq_2 ra, Eq_2 s0, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg6C, Eq_2 dwArgB8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg01A4, ptr32 & s5Out, ptr32 & s10Out)
{
	word32 a4_173;
	word32 a5_174;
	cm_GetApData(s0, out a4_173, out a5_174);
	word32 a0_21;
	Eq_2 s0_30;
	Eq_2 s1_31;
	word32 a3_175;
	word32 s2_176;
	word32 s7_177;
	word32 s9_178;
	word32 a4_147;
	ptr32 s10_153;
	ptr32 s5_159;
	Eq_2 ra_29 = IsEAPOL_MICValid(ra, dwArg0118, dwArg0138, out s0_30, out s1_31, out a0_21, out a3_175, out a4_147, out s2_176, out s5_159, out s7_177, out s9_178, out s10_153);
	if (a0_21 != 0x00)
	{
		((word32) s0_30 + 232)->u1 = 0x01;
		((word32) s0_30 + 233)->u1 = 0x00;
		((word32) s0_30 + 228)->u1 = 0x00;
		((word32) s0_30 + 229)->u1 = 0x00;
		((word32) s0_30 + 0x00E6)->u1 = 0x00;
		((word32) s0_30 + 0x00E7)->u1 = 0x00;
		Eq_2 a4_63;
		word32 s1_179;
		word32 a0_180;
		word32 a3_181;
		word32 a5_182;
		word32 s2_183;
		struct Eq_59146 * s1_99 = apm_sta_add(add_key_to_mac(ra_29, s1_31, s0_30, 0x01, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, dwArg01A4, out s1_179, out a0_180, out a3_181, out a4_63, out a5_182, out s2_183, out s5_159, out s10_153), a4_63, mstatus, dwLoc08, dwArg28, out a4_147);
		ui32 a5_111 = (word32) s1_99->w0012;
		s1_99->b0018 = 0x00;
		if ((a5_111 & 32) != 0x00)
			s1_99->b0016 = 0x0A;
	}
	0x00 = (uint16) dwArg38;
	s5Out = s5_159;
	s10Out = s10_153;
	return a4_147;
}

// 23012958: Register word32 GenerateApEapolMsg(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      ProcessPWKMsg2
//      SendEAPOLMsgUsingBufDesc
word32 GenerateApEapolMsg(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, ptr32 & s5Out, ptr32 & s10Out)
{
	word32 a5_313;
	word32 a4_312;
	Eq_2 a0_18 = cm_GetApData(a0, out a4_312, out a5_313);
	Eq_2 s0_25 = a1;
	Eq_2 s1_117 = a0_18;
	if ((a1 & 1) == 0x00)
		s0_25 = (word32) a1 - 1 & 0x00FF;
	word32 a4_111 = (word32) *((word32) a0_18 + 0x0C);
	*((word32) a0_18 + 22) = (byte) s0_25;
	if (a4_111 == 0x01)
	{
l230129A2:
		((word32) s1_117 + 24)->u1 = (byte) ((word32) *((word32) s1_117 + 24) + 0x01);
		goto l230129D2;
	}
	word32 a0_107;
	if (s0_25 == 0x01)
		s1_117 = GeneratePWKMsg1(ra, s0_25, a0, a3, a0, fflags, frm, mstatus, dwArg04, dwArg0C, dwArg28, dwArg48, s1, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a0_107, out a4_111, out s5, out s10);
	else
	{
		if (s0_25 != 0x03)
		{
			if (a1 != 0x00)
			{
				Eq_2 a5_45;
				Eq_2 a1_49;
				word32 t3_322;
				word32 s4_321;
				word32 a6_320;
				word32 a4_319;
				word32 a3_318;
				word32 a2_317;
				word32 a0_316;
				word32 s1_315;
				word32 s0_314;
				vPortFree(a0_18, dwArg44, 0x03, mstatus, dwArg0138, dwArg0178, out s0_314, out s1_315, out a0_316, out a1_49, out a2_317, out a3_318, out a4_319, out a5_45, out a6_320, out s4_321, out t3_322);
				word32 s0_323;
				word32 s1_324;
				word32 a0_325;
				word32 a1_326;
				word32 a2_327;
				word32 a3_328;
				word32 a5_329;
				word32 a6_330;
				word32 s4_331;
				word32 t3_332;
				vPortFree(a1_49, dwArg44, a5_45, mstatus, dwArg0138, dwArg0178, out s0_323, out s1_324, out a0_325, out a1_326, out a2_327, out a3_328, out a4_111, out a5_329, out a6_330, out s4_331, out t3_332);
			}
			goto l230129D2;
		}
		s1_117 = GeneratePWKMsg3(ra, s0_25, a0, a3, a0, fflags, frm, mstatus, dwArg04, dwArg0C, dwArg28, dwArg48, s1, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out a0_107, out a4_111, out s5, out s10);
	}
	if (a0_107 == 0x00)
	{
		*((word32) s1_117 + 22) = (byte) ((word32) *((word32) s1_117 + 22) + 0x01);
		goto l230129A2;
	}
l230129D2:
	s5Out = s5;
	s10Out = s10;
	return a4_111;
}

// 230129E0: Register word32 ProcessPWKMsg2(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataAp
word32 ProcessPWKMsg2(Eq_2 ra, Eq_2 s0, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, ptr32 & s5Out, ptr32 & s10Out)
{
	word32 a4_194;
	word32 a5_195;
	cm_GetApData(s0, out a4_194, out a5_195);
	word32 a4_196;
	word32 a5_197;
	cm_GetApInfo(s0, out a4_196, out a5_197);
	KeyMgmtAp_DerivePTK(ra, (word32) s0 + 0x00C4);
	word32 a0_56;
	Eq_2 a3_59;
	word32 a4_60;
	Eq_2 s0_65;
	Eq_2 s1_66;
	ptr32 s10_67;
	struct Eq_59378 * s2_68;
	ptr32 s5_71;
	word32 s7_198;
	word32 s9_199;
	Eq_2 ra_64 = IsEAPOL_MICValid(ra, dwArgF8, dwArg0118, out s0_65, out s1_66, out a0_56, out a3_59, out a4_60, out s2_68, out s5_71, out s7_198, out s9_199, out s10_67);
	if (a0_56 == 0x00)
	{
		0x00 = (uint16) dwArg0128;
		s5Out = s5_71;
		s10Out = s10_67;
		return a4_60;
	}
	else
	{
		s2_68->b0018 = 0x00;
		word32 a5_91 = (word32) *((word32) s1_66 + 100);
		0x00 = (uint16) dwArg0128;
		g_b4200ECB4 = (byte) (a5_91 + 0x02);
		ptr32 s10_122;
		ptr32 s5_125;
		word32 a4_108 = GenerateApEapolMsg(ra_64, s1_66, s0_65, 0x03, a3_59, fflags, frm, mstatus, dwArg04, dwArg0C, dwArg28, dwArg44, dwArg48, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0178, out s5_125, out s10_122);
		s5Out = s5_125;
		s10Out = s10_122;
		return a4_108;
	}
}

// 23012A64: void SendEAPOLMsgUsingBufDesc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158)
// Called from:
//      apm_sta_add_cfm_handler
void SendEAPOLMsgUsingBufDesc(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158)
{
	word32 a4_126;
	word32 a5_127;
	Eq_2 a1_15 = (word32) *((word32) cm_GetApData(a0, out a4_126, out a5_127) + 22);
	if ((a1_15 & 1) != 0x00)
	{
		word32 s5_128;
		word32 s10_129;
		GenerateApEapolMsg(ra, s1, a0, a1_15, a3, fflags, frm, mstatus, dwLoc1C, s0, dwArg08, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0158, out s5_128, out s10_129);
	}
}

// 23012A8E: Register uint32 ProcessKeyMgmtDataAp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0184, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      ProcessEAPoLPkt
uint32 ProcessKeyMgmtDataAp(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0184, ptr32 & s5Out, ptr32 & s10Out)
{
	word32 a5_256;
	uint32 a4_119;
	cm_GetApData(*a0, out a4_119, out a5_256);
	struct Eq_59476 * s2_18 = *((word32) a0 + 8);
	if (((word32) s2_18->b0005 & 0x04) == 0x00)
	{
		word32 a7_263;
		word32 a6_262;
		word32 a5_261;
		word32 a4_260;
		word32 a3_259;
		word32 a2_258;
		word32 a1_257;
		memcpy(fp + ~0x17, &s2_18->b0005 + 4, 0x04, out a1_257, out a2_258, out a3_259, out a4_260, out a5_261, out a6_262, out a7_263);
		uint32 a5_42;
		word32 a1_264;
		word32 a2_265;
		word32 a3_266;
		word32 a4_267;
		word32 a6_268;
		word32 a7_269;
		memcpy(fp + ~0x13, &s2_18->b0005 + 8, 0x04, out a1_264, out a2_265, out a3_266, out a4_267, out a5_42, out a6_268, out a7_269);
		a4_119 = (a5_42 >> 0x08 & 0x0FFFFF00) + ((a5_42 << 0x08 & 0x00FF0000) + ((a5_42 << 0x18) + (a5_42 >> 0x18)));
		if (a4_119 != 0x10000000)
			goto l23012AAA;
		a4_119 = 0x10;
		struct Eq_59549 * s1_78 = *(struct Eq_59549 **) 44;
		if ((dwArgC4 & 0x00100000) == 0x00)
		{
			word32 a5_79 = (word32) s1_78->b0016;
			if (a5_79 == 0x02)
				a4_119 = ProcessPWKMsg2(ra, dwArgC4, fflags, frm, mstatus, dwLoc1C, s0, dwArg08, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0158, out s5, out s10);
			else
			{
				a4_119 = 0x04;
				if (a5_79 != 0x04)
					goto l23012AAA;
				a4_119 = ProcessPWKMsg4(ra, dwArgC4, mstatus, dwArg00, dwArg04, dwArg08, dwArg18, dwArg4C, dwArg98, dwArgE8, dwArgF8, dwArg0118, dwArg0184, out s5, out s10);
			}
l23012AAC:
			s5Out = s5;
			s10Out = s10;
			return a4_119;
		}
	}
l23012AAA:
	goto l23012AAC;
}

// 23012B3E: Register Eq_2 InitStaKeyInfo(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg74, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_46134) s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out)
// Called from:
//      apm_assoc_req_handler
Eq_2 InitStaKeyInfo(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg74, Eq_2 dwArg0128, struct Eq_46134 & s0Out, ptr32 & s1Out, ptr32 & s4Out)
{
	word32 a4_88;
	word32 a5_89;
	Eq_2 a0_23 = cm_GetApData(a0, out a4_88, out a5_89);
	word32 t1_90;
	word32 a0_91;
	word32 a1_92;
	word32 a2_93;
	word32 a3_94;
	word32 a4_95;
	word32 a5_96;
	Eq_2 ra_37 = memset(ra, (word32) a0_23 + 16, 0x00, 72, out t1_90, out a0_91, out a1_92, out a2_93, out a3_94, out a4_95, out a5_96);
	ptr32 s1_54;
	ptr32 s4_56;
	InitKeyMgmtInfo((word32) a0_23 + 16, a1, a2, dwArg74, out s1_54, out s4_56)->b0054 = 0x01;
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_54;
	s4Out = s4_56;
	return ra_37;
}

// 23012B86: Register word32 RemoveAPKeyInfo(Register Eq_2 a0, Stack Eq_2 dwArg0118, Register out ptr32 s2Out)
// Called from:
//      apm_stop_req_handler
word32 RemoveAPKeyInfo(Eq_2 a0, Eq_2 dwArg0118, ptr32 & s2Out)
{
	struct Eq_8261 * a0_5 = (word32) *((word32) a0 + 3);
	if (a0_5 == (struct Eq_8261 *) 0x00FF)
	{
		s2Out = s2;
		return a2;
	}
	else
	{
		word32 a2_9;
		ptr32 s2_16;
		word32 a4_62;
		word32 s3_63;
		word32 s6_64;
		mm_sec_machwkey_del(a0_5, dwArg0118, out a2_9, out a4_62, out s2_16, out s3_63, out s6_64);
		s2Out = s2_16;
		return a2_9;
	}
}

