pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23012B98: Register Eq_2 InitGroupKey(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg01A4, Register out ptr32 a4Out, Register out Eq_59672 s2Out, Register out ptr32 s4Out)
// Called from:
//      apm_start_req_handler
Eq_2 InitGroupKey(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg01A4, ptr32 & a4Out, union Eq_59672 & s2Out, ptr32 & s4Out)
{
	word32 a5_180;
	word32 a4_179;
	struct Eq_50194 * a0_12 = cm_GetApInfo(a0, out a4_179, out a5_180);
	a0_12->dw0114 = 0x00;
	a0_12->dw0118 = 0x00;
	struct Eq_59689 * a5_25;
	Eq_2 s1_30;
	Eq_2 ra_28 = KeyMgmtInit(ra, a0, mstatus, dwArg08, dwArg48, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0148, out s1_30, out a5_25);
	struct Eq_59697 * s0_48 = a5_25->ptr0014;
	if (a5_25 != null)
	{
		word32 a5_189;
		word32 a4_188;
		word32 a3_187;
		word32 a1_186;
		Eq_2 a0_60 = __udivdi3((char *) &a5_25->ptr0014 + 0x1EFFF7B7, (word32) ((char *) &a5_25->ptr0014 + 0x1EFFF7B7 < (char *) (&a5_25->ptr0014) + 520091700) + ((word32) (a5_25 < (struct Eq_59689 *) 0x1EFFF848) + ~0x00), (word32) s0_48->w00A6 << 7, 0x00, out a1_186, out a3_187, out a4_188, out a5_189);
		s0_48->dw0114 = (word32) a0_60 + 1;
		s0_48->dw0118 = (word32) a0_60 + 1;
	}
	word32 a0_81;
	Eq_2 a3_84;
	struct Eq_59705 * s1_91;
	word32 s10_185;
	word32 s5_184;
	word32 s2_183;
	word32 a5_182;
	word32 a4_181;
	Eq_2 ra_89 = add_key_to_mac(ra_28, s1_30, s1_30, 0x00, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, dwArg01A4, out s1_91, out a0_81, out a3_84, out a4_181, out a5_182, out s2_183, out s5_184, out s10_185);
	s1_91->b0003 = (byte) a0_81;
	ptr32 a4_123;
	Eq_59672 s2_129;
	ptr32 s4_131;
	word32 a0_191;
	word32 s1_190;
	word32 a1_192;
	word32 a2_193;
	word32 a3_194;
	word32 a5_195;
	word32 a7_196;
	word32 s3_197;
	word32 s5_198;
	word32 s6_199;
	word32 s7_200;
	word32 s8_201;
	word32 s9_202;
	word32 s10_203;
	word32 s11_204;
	word32 t4_205;
	Eq_2 ra_125 = printf(ra_89, g_a23076448 + 64, a3_84, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_190, out a0_191, out a1_192, out a2_193, out a3_194, out a4_123, out a5_195, out a7_196, out s2_129, out s3_197, out s4_131, out s5_198, out s6_199, out s7_200, out s8_201, out s9_202, out s10_203, out s11_204, out t4_205);
	a4Out = a4_123;
	s2Out = s2_129;
	s4Out = s4_131;
	return ra_125;
}

// 23012C0A: Register Eq_2 GenerateGTK_internal(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Stack word32 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out)
// Called from:
//      ROM_InitGTK
Eq_2 GenerateGTK_internal(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, word32 dwArg18, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & s4Out)
{
	word32 a1_282;
	word32 a2_283;
	word32 a3_284;
	word32 a4_285;
	word32 a5_286;
	word32 a6_287;
	word32 a7_288;
	memcpy(fp + -0x008C, 587687260, 0x14, out a1_282, out a2_283, out a3_284, out a4_285, out a5_286, out a6_287, out a7_288);
	ptr32 s1_152 = a1;
	Eq_2 s0_14 = a0;
	if (a0 != 0x00 && a1 != 0x00)
	{
		word32 a1_289;
		word32 a2_290;
		word32 a3_291;
		word32 a4_292;
		word32 a5_293;
		word32 a6_294;
		word32 a7_295;
		memcpy(fp + -56, a2, 0x06, out a1_289, out a2_290, out a3_291, out a4_292, out a5_293, out a6_294, out a7_295);
		Eq_2 s1_63;
		word32 s0_296;
		word32 a0_297;
		word32 a3_298;
		word32 a4_299;
		word32 s9_300;
		word32 s10_301;
		Eq_2 ra_61 = supplicantGenerateRand(ra, dwLoc80, dwLoc7C, dwLoc34, dwArg78, dwArgC8, dwArgE8, out s0_296, out s1_63, out a0_297, out a3_298, out a4_299, out s9_300, out s10_301);
		word32 a1_302;
		word32 a2_303;
		word32 a3_304;
		word32 a4_305;
		word32 a5_306;
		word32 a6_307;
		word32 a7_308;
		memcpy(fp + -50, s1_63, 32, out a1_302, out a2_303, out a3_304, out a4_305, out a5_306, out a6_307, out a7_308);
		word32 s0_309;
		word32 s1_310;
		word32 a0_311;
		word32 a3_312;
		word32 a4_313;
		word32 s9_314;
		word32 s10_315;
		word32 a1_316;
		word32 a2_317;
		word32 a3_318;
		word32 a4_319;
		word32 a5_320;
		ra = Bl_PRF(supplicantGenerateRand(ra_61, dwLoc80, dwLoc7C, dwLoc34, dwArg78, dwArgC8, dwArgE8, out s0_309, out s1_310, out a0_311, out a3_312, out a4_313, out s9_314, out s10_315), fp + -88, 32, fp + -0x008C, strlen(fp + -0x008C, out a1_316, out a2_317, out a3_318, out a4_319, out a5_320), fp + -56, 38, fp + -0x0078, 32, dwLoc5C, out s0_14, out s1_152, out s4);
		word32 a1_321;
		word32 a2_322;
		word32 a3_323;
		word32 a4_324;
		word32 a5_325;
		word32 a6_326;
		word32 a7_327;
		memcpy(s0_14, fp + -0x0078, 0x10, out a1_321, out a2_322, out a3_323, out a4_324, out a5_325, out a6_326, out a7_327);
		word32 a1_328;
		word32 a2_329;
		word32 a3_330;
		word32 a4_331;
		word32 a5_332;
		word32 a6_333;
		word32 a7_334;
		memcpy((word32) s0_14 + 24, fp + -0x0068, 0x08, out a1_328, out a2_329, out a3_330, out a4_331, out a5_332, out a6_333, out a7_334);
		word32 a1_335;
		word32 a2_336;
		word32 a3_337;
		word32 a4_338;
		word32 a5_339;
		word32 a6_340;
		word32 a7_341;
		memcpy((word32) s0_14 + 16, fp + -96, 0x08, out a1_335, out a2_336, out a3_337, out a4_338, out a5_339, out a6_340, out a7_341);
	}
	s0Out = s0_14;
	s1Out = s1_152;
	s4Out = s4;
	return ra;
}

// 23012CAA: Register (ptr32 Eq_50194) PopulateKeyMsg(Register (ptr32 Eq_50194) a0, Register (ptr32 byte) a1, Register uint32 a2, Register (ptr32 Eq_58719) a3, Register Eq_2 a4, Register out Eq_2 a4Out)
// Called from:
//      GeneratePWKMsg1
//      GeneratePWKMsg3
struct Eq_50194 * PopulateKeyMsg(struct Eq_50194 * a0, byte * a1, uint32 a2, struct Eq_58719 * a3, Eq_2 a4, union Eq_2 & a4Out)
{
	if (a0 == null || a1 == null)
	{
		a4Out = a4;
		return a0;
	}
	int32 a5_10;
	ui32 a5_6 = (word32) *a1;
	if ((a5_6 & 4) != 0x00)
	{
		a0->b0015 = 0x00;
		a5_10 = 32;
	}
	else
	{
		if ((a5_6 & 0x08) == 0x00)
			goto l23012CC8;
		a0->b0015 = 0x00;
		a5_10 = 0x10;
	}
	a0->b0016 = (byte) a5_10;
l23012CC8:
	ui32 a5_29;
	ui32 a2_27;
	ui32 a1_18 = (word32) a0->b0014;
	a0->b0014 = (byte) (a1_18 | -0x0080);
	if (a2 << 0x14 < 0x00)
	{
		a0->b0014 = (byte) (a1_18 | -0x0078);
		if ((a2 & 0x0080) == 0x00)
			goto l23012D0E;
		ui32 a5_33 = (word32) a0->b0013;
		a0->b0014 = (byte) (a1_18 | -56);
		a5_29 = (a5_33 | 1) & 0x00ED | (a2 >> 0x0F) << 0x01;
		a2_27 = a2 >> 0x0F << 4;
	}
	else
	{
		a2_27 = a2 >> 0x0F << 4;
		a5_29 = (word32) a0->b0013 & 0x00EC | 3;
	}
	a0->b0013 = (byte) (a2_27 | a5_29);
l23012D0E:
	Eq_60062 a6_53 = a3->t0000;
	uint32 a2_67 = (a6_53 << 0x18) + (a6_53 >> 0x18) + (a6_53 << 0x08 & 0x00FF0000) + (a6_53 >> 0x08 & 0x0FFFFF00);
	a0->b1017 = (byte) a2_67;
	a0->b1018 = (byte) (a2_67 >> 0x08);
	a0->b1019 = (byte) (a2_67 >> 0x10);
	a0->b101A = (byte) (a2_67 >> 24);
	uint32 a3_75 = a3->dw0004;
	uint32 a5_84 = (a3_75 << 0x18) + (a3_75 >> 0x18) + (a3_75 << 0x08 & 0x00FF0000) + (a3_75 >> 8 & 0x0FFFFF00);
	a0->b101B = (byte) a5_84;
	a0->b101C = (byte) (a5_84 >> 0x08);
	a0->b101D = (byte) (a5_84 >> 0x10);
	a0->b101E = (byte) (a5_84 >> 24);
	Eq_2 a4_99;
	word32 a7_161;
	word32 a6_160;
	word32 a5_159;
	word32 a3_158;
	word32 a2_157;
	word32 a1_156;
	memcpy(&a0->b0016 + 9, a4, 32, out a1_156, out a2_157, out a3_158, out a4_99, out a5_159, out a6_160, out a7_161);
	a4Out = a4_99;
	return &a0->b0016 + 9;
}

