pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23012DB6: Register Eq_2 prepareKDE(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 byte) a2, Register out Eq_2 s0Out, Register out (ptr32 Eq_59044) s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out (ptr32 byte) s3Out)
// Called from:
//      GeneratePWKMsg3
Eq_2 prepareKDE(Eq_2 ra, Eq_2 a0, Eq_2 a1, byte * a2, union Eq_2 & s0Out, struct Eq_59044 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, byte & s3Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a3Out = a3;
		s3Out = s3;
		return ra;
	}
	else
	{
		Eq_2 s0_110 = a1;
		if (a1 != 0x00 && a2 != null)
		{
			s1 = (word32) a0 + 113 + (word32) (*((word32) a0 + 111));
			s1->b0000 = ~0x22;
			s1->b0001 = 22;
			s1->b0002 = (byte) (word32) g_b2308DD94;
			word32 a5_32 = (word32) g_b2308DD96;
			s1->b0003 = (byte) (word32) g_b2308DD95;
			s1->b0004 = (byte) a5_32;
			s1->b0005 = 0x01;
			s1->b0006 = (byte) ((word32) s1->b0006 & ~0x03 | 1);
			word32 a1_232;
			word32 a2_233;
			word32 a4_234;
			word32 a5_235;
			word32 a6_236;
			word32 a7_237;
			memcpy(&s1->b0006 + 2, a1, 0x10, out a1_232, out a2_233, out a3, out a4_234, out a5_235, out a6_236, out a7_237);
			s3 = a2;
			a0 = &s1->b0006 + 18;
			if (((word32) *a2 & 0x04) != 0x00)
			{
				s1->b0001 = (byte) ((word32) s1->b0001 + 0x10);
				word32 a1_238;
				word32 a2_239;
				word32 a3_240;
				word32 a4_241;
				word32 a5_242;
				word32 a6_243;
				word32 a7_244;
				memcpy(&s1->b0006 + 18, (word32) a1 + 24, 0x08, out a1_238, out a2_239, out a3_240, out a4_241, out a5_242, out a6_243, out a7_244);
				word32 a1_245;
				word32 a2_246;
				word32 a4_247;
				word32 a5_248;
				word32 a6_249;
				word32 a7_250;
				memcpy(&s1->b0006 + 26, (word32) a1 + 16, 0x08, out a1_245, out a2_246, out a3, out a4_247, out a5_248, out a6_249, out a7_250);
				a0 = &s1->b0006 + 0x0022;
			}
			uint32 s0_105 = (word32) (word16) (((word32) *((word32) a0 + 112) << 8 | (word32) (*((word32) a0 + 111))) + 0x02 + (word32) s1->b0001);
			((word32) a0 + 111)->u1 = (byte) s0_105;
			*((word32) a0 + 112) = (byte) (s0_105 >> 0x08);
			ui32 s0_108 = 0x00 - s0_105;
			s0_110 = s0_108 & 0x07;
			if ((s0_108 & 0x07) != 0x00)
			{
				a0->u1 = ~0x22;
				word32 t1_251;
				word32 a1_252;
				word32 a2_253;
				word32 a4_254;
				word32 a5_255;
				ra = memset(ra, (word32) a0 + 1, 0x00, (s0_108 & 0x07) + -1, out t1_251, out a0, out a1_252, out a2_253, out a3, out a4_254, out a5_255);
				uint32 s0_133 = (word32) (word16) ((s0_108 & 0x07) + ((word32) (*((word32) a0 + 112)) << 8 | (word32) (*((word32) a0 + 111))));
				((word32) a0 + 111)->u1 = (byte) s0_133;
				*((word32) a0 + 112) = (byte) (s0_133 >> 8);
				s0_110 = s0_133 >> 8;
			}
		}
		s0Out = s0_110;
		s1Out = s1;
		a0Out = a0;
		a3Out = a3;
		s3Out = s3;
		return ra;
	}
}

// 23012EC4: Register Eq_2 Encrypt_keyData(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_59031 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      GeneratePWKMsg3
Eq_2 Encrypt_keyData(Eq_2 ra, Eq_2 s1, word32 a0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_59031 & a0Out, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s5Out, ptr32 & s10Out)
{
	if (a0 == 0x00 || (a1 == 0x00 || a2 == 0x00))
	{
		a0Out.u0 = 0x00;
		a2Out = a2;
		a4Out = a4;
		a5Out = a5;
		s5Out = s5;
		s10Out = s10;
		return ra;
	}
	Eq_2 a5_7 = (word32) *a2;
	if ((a5_7 & 8) == 0x00)
	{
		a0Out = a5_7 >> 0x02 & 0x01;
		a2Out = a2;
		a4Out = a5_7 & 8;
		a5Out = a5_7;
		s5Out = s5;
		s10Out = s10;
		return ra;
	}
	Eq_59031 a0_168;
	Eq_2 a0_27;
	Eq_2 a3_30;
	word32 s8_340;
	word32 s4_339;
	word32 s3_338;
	word32 s2_337;
	word32 a6_336;
	word32 a2_335;
	word32 a1_334;
	word32 s1_333;
	Eq_2 a4_158;
	Eq_2 a5_159;
	pvPortMalloc(ra, s1, 0x0C, a3, a5_7 & 8, a5_7, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_333, out a0_27, out a1_334, out a2_335, out a3_30, out a4_158, out a5_159, out a6_336, out s2_337, out s3_338, out s4_339, out s8_340);
	if (a0_27 != 0x00)
	{
		struct Eq_53953 * a0_44;
		word32 s1_52;
		Eq_2 s3_54;
		word32 s8_347;
		word32 s4_346;
		word32 s2_345;
		word32 a6_344;
		word32 a3_343;
		word32 a2_342;
		word32 a1_341;
		Eq_2 s0_51 = pvPortMalloc(ra, a0_27, 400, a3_30, a4_158, a5_159, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_52, out a0_44, out a1_341, out a2_342, out a3_343, out a4_158, out a5_159, out a6_344, out s2_345, out s3_54, out s4_346, out s8_347);
		a0_44->dw0008 = s1_52;
		if (a0_44 != null)
		{
			word32 a7_354;
			word32 a6_353;
			word32 a5_352;
			word32 a4_351;
			word32 a3_350;
			word32 a2_349;
			word32 a1_348;
			memcpy(fp + -48, s3_54, 0x10, out a1_348, out a2_349, out a3_350, out a4_351, out a5_352, out a6_353, out a7_354);
			struct Eq_60559 * s0_98;
			Eq_2 s2_101;
			Eq_2 s3_102;
			ra = BL_AesWrap(fp + -48, 0x02, ((word32) *((word32) s0_51 + 112) << 8 | (word32) (*((word32) s0_51 + 111))) >> 3, (word32) s0_51 + 113, null, a0_44, out s0_98, out s2_101, out s3_102, out s5, out s10);
			uint32 a2_123 = ((word32) s0_98->b0070 << 8 | (word32) s0_98->b006F) + 0x08 << 16;
			s0_98->b006F = (byte) (a2_123 >> 16);
			s0_98->b0070 = (byte) (a2_123 >> 0x18);
			Eq_2 a5_130;
			Eq_2 a2_133;
			word32 a7_359;
			word32 a6_358;
			word32 a4_357;
			word32 a3_356;
			word32 a1_355;
			memcpy(s3_102, s2_101, a2_123 >> 16, out a1_355, out a2_133, out a3_356, out a4_357, out a5_130, out a6_358, out a7_359);
			Eq_2 a2_143;
			Eq_2 a5_146;
			Eq_2 s1_147;
			word32 a6_365;
			word32 s4_366;
			word32 t3_367;
			word32 a4_364;
			word32 a3_363;
			word32 a1_362;
			word32 a0_361;
			word32 s0_360;
			vPortFree(s3_102, a2_133, a5_130, mstatus, dwArg0128, dwArg0168, out s0_360, out s1_147, out a0_361, out a1_362, out a2_143, out a3_363, out a4_364, out a5_146, out a6_365, out s4_366, out t3_367);
			word32 s0_368;
			word32 s1_369;
			word32 a0_370;
			word32 a1_371;
			word32 a2_372;
			word32 a3_373;
			word32 a6_374;
			word32 s4_375;
			word32 t3_376;
			vPortFree(s1_147, a2_143, a5_146, mstatus, dwArg0128, dwArg0168, out s0_368, out s1_369, out a0_370, out a1_371, out a2_372, out a3_373, out a4_158, out a5_159, out a6_374, out s4_375, out t3_376);
			a0_168.u0 = 0x01;
l23012ECC:
			0x00 = (uint16) dwArg0128;
			a0Out = a0_168;
			a2Out = dwArg0100;
			a4Out = a4_158;
			a5Out = a5_159;
			s5Out = s5;
			s10Out = s10;
			return ra;
		}
	}
	a0_168.u0 = 0x00;
	goto l23012ECC;
}

