pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23012F78: void KeyMgmtAp_DerivePTK(Register Eq_2 ra, Register word32 a7)
// Called from:
//      ProcessPWKMsg2
void KeyMgmtAp_DerivePTK(Eq_2 ra, word32 a7)
{
	KeyMgmtSta_DeriveKeys(ra);
	word32 a1_94;
	word32 a2_95;
	word32 a3_96;
	word32 a4_97;
	word32 a5_98;
	word32 a6_99;
	word32 a7_100;
	memcpy(fp + -24, a7 + 16, 0x08, out a1_94, out a2_95, out a3_96, out a4_97, out a5_98, out a6_99, out a7_100);
	word32 a1_101;
	word32 a2_102;
	word32 a3_103;
	word32 a4_104;
	word32 a5_105;
	word32 a6_106;
	word32 a7_107;
	memcpy(a7 + 16, a7 + 0x18, 0x08, out a1_101, out a2_102, out a3_103, out a4_104, out a5_105, out a6_106, out a7_107);
	word32 a1_108;
	word32 a2_109;
	word32 a3_110;
	word32 a4_111;
	word32 a5_112;
	word32 a6_113;
	word32 a7_114;
	memcpy(a7 + 0x18, fp + -24, 0x08, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out a6_113, out a7_114);
}

// 23012FB8: Register (ptr32 Eq_58729) KeyData_CopyWPAWP2(Register (ptr32 Eq_58729) a0, Register Eq_2 a1, Register out ptr32 a5Out)
// Called from:
//      KeyData_UpdateKeyMaterial
struct Eq_58729 * KeyData_CopyWPAWP2(struct Eq_58729 * a0, Eq_2 a1, ptr32 & a5Out)
{
	if (a1 == 0x00)
	{
		a5Out = a5;
		return null;
	}
	else
	{
		word32 a2_6 = (word32) *((word32) a1 + 1);
		a0->b006F = (byte) (a2_6 + 0x02);
		a0->b0070 = (byte) (a2_6 + 0x02 >> 0x08);
		ptr32 a5_17;
		word32 a1_62;
		word32 a2_63;
		word32 a3_64;
		word32 a4_65;
		word32 a6_66;
		word32 a7_67;
		memcpy(&a0->b0070 + 1, a1, a2_6 + 0x02, out a1_62, out a2_63, out a3_64, out a4_65, out a5_17, out a6_66, out a7_67);
		a5Out = a5_17;
		return (struct Eq_58729 *) 0x01;
	}
}

// 23012FE4: Register (ptr32 Eq_58729) KeyData_UpdateKeyMaterial(Register (ptr32 Eq_58729) a0, Register (ptr32 uint16) a1, Register Eq_2 a2, Register Eq_2 a3, Register out ptr32 a2Out, Register out (ptr32 Eq_58729) a4Out, Register out Eq_58927 a5Out)
// Called from:
//      GeneratePWKMsg3
struct Eq_58729 * KeyData_UpdateKeyMaterial(struct Eq_58729 * a0, uint16 * a1, Eq_2 a2, Eq_2 a3, ptr32 & a2Out, struct Eq_58729 & a4Out, union Eq_58927 & a5Out)
{
	struct Eq_58729 * a4_12;
	Eq_58927 a5_11;
	ui32 a5_7 = (word32) *a1;
	Eq_2 a1_14 = a2;
	if ((a5_7 & 24) == 0x00)
	{
		a5_11 = a5_7 & 32;
		a4_12 = (struct Eq_58729 *) 0x01;
		if ((a5_7 & 32) == 0x00)
		{
l23013006:
			a2Out = dwArg10;
			a4Out = a4_12;
			a5Out = a5_11;
			return a4_12;
		}
		a1_14 = a3;
	}
	a4_12 = (word32) (KeyData_CopyWPAWP2(a0, a1_14, out a5_11) != 0x00);
	goto l23013006;
}

// 2301300E: Register Eq_2 ROM_InitGTK(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Stack word32 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out)
// Called from:
//      KeyMgmtInit
Eq_2 ROM_InitGTK(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, word32 dwArg18, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s4Out)
{
	((word32) a0 + 32)->u0 = 0x00;
	*(union Eq_2 *) 0x10000025 = a0;
	ptr32 s0_19;
	ptr32 s1_20;
	ptr32 s4_32;
	Eq_2 ra_28 = GenerateGTK_internal(ra, a0, a1, a2, dwArg18, dwArg78, dwArgC8, dwArgE8, out s0_19, out s1_20, out s4_32);
	s0Out = s0_19;
	s1Out = s1_20;
	s4Out = s4_32;
	return ra_28;
}

// 2301301C: Register Eq_2 InitKeyMgmtInfo(Register (ptr32 Eq_59612) a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArgA4, Register out Eq_2 s1Out, Register out ptr32 s4Out)
// Called from:
//      InitStaKeyInfo
Eq_2 InitKeyMgmtInfo(struct Eq_59612 * a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArgA4, union Eq_2 & s1Out, ptr32 & s4Out)
{
	a0->b0006 = 0x01;
	word32 a7_106;
	word32 a6_105;
	word32 a5_104;
	word32 a4_103;
	word32 a3_102;
	word32 a2_101;
	word32 a1_100;
	memcpy((char *) a0 + 2, a1, 0x02, out a1_100, out a2_101, out a3_102, out a4_103, out a5_104, out a6_105, out a7_106);
	word32 a4_42;
	word32 a3_47;
	word32 a5_109;
	word32 a6_110;
	word32 a7_111;
	word32 a2_108;
	word32 a1_107;
	memcpy((char *) a0 + 4, a2, 0x01, out a1_107, out a2_108, out a3_47, out a4_42, out a5_109, out a6_110, out a7_111);
	*((word32) dwArgA4 + 5) = (byte) a4_42;
	if (((word32) *a1 & 32) != 0x00)
		*dwArgA4 = (word16) a3_47;
	s1Out = a1;
	s4Out = dwArg04;
	return dwArgA4;
}

// 2301306C: Register Eq_2 cm_GetApInfo(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      add_key_to_mac
//      KeyMgmtInit
//      PrepDefaultEapolMsg
//      GeneratePWKMsg3
//      ProcessPWKMsg2
//      InitGroupKey
//      ap_setpsk
//      InitializeAp
Eq_2 cm_GetApInfo(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 != 0x00)
	{
		a4 = (word32) *a0;
		a5 = 0x02;
		if (a4 == 0x02)
		{
			Eq_2 a0_8 = *((word16) a0.u0 + 76);
			a4Out = a4;
			a5Out = 0x02;
			return a0_8;
		}
		a0.u0 = 0x00;
	}
	a4Out = a4;
	a5Out = a5;
	return a0;
}

// 23013080: Register Eq_2 cm_GetApData(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      PrepDefaultEapolMsg
//      GeneratePWKMsg1
//      GeneratePWKMsg3
//      ProcessPWKMsg4
//      GenerateApEapolMsg
//      ProcessPWKMsg2
//      SendEAPOLMsgUsingBufDesc
//      ProcessKeyMgmtDataAp
//      InitStaKeyInfo
//      cm_AllocResources
//      cm_DeleteConnection
//      InitializeAp
Eq_2 cm_GetApData(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 != 0x00)
	{
		a4 = (word32) *a0;
		a5 = 0x02;
		if (a4 == 0x02)
		{
			a4Out = a4;
			a5Out = 0x02;
			return (word16) a0.u0 + 76;
		}
		a0.u0 = 0x00;
	}
	a4Out = a4;
	a5Out = a5;
	return a0;
}

// 23013096: Register Eq_2 cm_AllocAPResources(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 s2Out)
// Called from:
//      cm_AllocResources
Eq_2 cm_AllocAPResources(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & s2Out)
{
	ptr32 a0_38;
	Eq_2 a4_15;
	Eq_2 a5_16;
	cm_GetApData(a0, out a4_15, out a5_16);
	Eq_2 s2_104 = a0;
	Eq_2 a0_17 = *((word32) a5_16 + 4);
	if (a5_16 == 0x00)
	{
		word32 a0_22;
		Eq_2 a3_25;
		Eq_2 a4_26;
		Eq_2 a5_27;
		word32 a1_121;
		word32 a2_122;
		word32 a6_123;
		word32 s3_124;
		word32 s4_125;
		word32 s8_126;
		pvPortMalloc(ra, a0_17, 0x0C, a3, a4_15, a5_16, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1, out a0_22, out a1_121, out a2_122, out a3_25, out a4_26, out a5_27, out a6_123, out s2_104, out s3_124, out s4_125, out s8_126);
		a0_38 = 0x01;
		if (a0_22 == 0x00)
			goto l230130D0;
		struct Eq_60992 * a0_40;
		union Eq_2 * a5_45;
		word32 a1_127;
		word32 a2_128;
		word32 a3_129;
		word32 a4_130;
		word32 a6_131;
		word32 s3_132;
		word32 s4_133;
		word32 s8_134;
		Eq_2 s0_47 = pvPortMalloc(ra, s1, 288, a3_25, a4_26, a5_27, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1, out a0_40, out a1_127, out a2_128, out a3_129, out a4_130, out a5_45, out a6_131, out s2_104, out s3_132, out s4_133, out s8_134);
		a0_40->t0008 = s0_47;
		*((word32) s0_47 + 4) = s1;
		*a5_45 = (union Eq_2 *) s1;
		InitializeAp(ra, a0);
	}
	a0_38 = 0x00;
l230130D0:
	0x00 = (uint16) dwArg38;
	a0Out = a0_38;
	a2Out = dwArg10;
	s2Out = s2_104;
	return s1;
}

// 230130DC: Register word32 cm_AllocResources(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 s2Out)
// Called from:
//      cm_InitConnection
word32 cm_AllocResources(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a2Out, ptr32 & s2Out)
{
	if ((word32) *a0 != 0x02)
	{
		a0Out = 0x00;
		a2Out = a2;
		s2Out = s2;
		return s1;
	}
	else
	{
		ptr32 a0_11;
		ptr32 a2_12;
		ptr32 s2_15;
		word32 s1_20 = cm_AllocAPResources(ra, a0, a3, mstatus, dwArg30, dwArg34, dwArg38, dwArg7C, dwArg0128, dwArg0168, out a0_11, out a2_12, out s2_15);
		a0Out = a0_11;
		a2Out = a2_12;
		s2Out = s2_15;
		return s1_20;
	}
}

