pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301323E: Register Eq_2 assert_rec(Register ptr32 mstatus, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_8379) a5Out)
// Called from:
//      hal_machw_rx_duration
//      rxl_mpdu_transfer
//      rxl_timer_int_handler
//      rxl_cntrl_evt
//      txl_payload_handle_backup
//      txl_frame_get
//      rxu_cntrl_frame_handle
//      hal_machw_idle_req
//      hal_machw_gen_handler
//      my_pbuf_free_custom
Eq_2 assert_rec(ptr32 mstatus, ptr32 & a2Out, union Eq_2 & a4Out, struct Eq_8379 & a5Out)
{
	if ((word32) g_b4200DCA8 != 0x01)
	{
		a2Out = a2;
		a4Out.u0 = <invalid>;
		a5Out = (struct Eq_8379 *) 0x01;
		return a0;
	}
	else
	{
		__csrrc(mstatus, 0x08);
		struct Eq_8379 * a5_9 = g_ptr4201BC58;
		if (a5_9 < null)
		{
			__csrrs(mstatus, 0x08);
			a2Out = a2;
			a4Out.u0 = <invalid>;
			a5Out = a5_9;
			return a0;
		}
		else
		{
			hal_machw_disable_int(a3);
			word32 a5_30;
			ke_evt_set(a0, a4, mstatus, out a5_30);
			__csrrs(mstatus, 0x08);
			a2Out = dwArg10;
			a4Out.u0 = <invalid>;
			a5Out = a5_9;
			return 0x80000000;
		}
	}
}

// 2301327E: void assert_err()
// Called from:
//      blmac_encr_cntrl_pack.constprop.8
//      hal_machw_rx_duration
//      mm_tbtt_evt
//      mm_sec_machwkey_wr
//      mm_back_to_host_idle
//      mm_bcn_transmit
//      mm_bcn_transmitted
//      mm_timer_schedule
//      rxl_frame_release
//      rxl_pd_append
//      scan_send_cancel_cfm
//      blmac_abs_timer_set
//      txl_cntrl_halt_ac
//      txl_transmit_trigger
//      txl_frame_push
//      txl_frame_push_force
//      txl_frame_send_eapol_frame
//      me_mic_end
//      me_init_bcmc_rate
//      me_tx_cfm_singleton
//      me_check_rc
//      me_beacon_check
//      me_sta_bw_nss_max_upd
//      rc_update_bw_nss_max
//      rc_init
//      sm_send_next_bss_param
//      txu_cntrl_cfm
//      apm_send_next_bss_param
//      co_list_push_back
//      co_list_remove
//      ke_evt_schedule
//      ke_malloc
//      ke_msg_alloc
//      ke_task_local
//      ke_handler_search
//      ke_state_get
//      ke_task_schedule
//      ke_timer_set
//      ke_timer_clear
//      add_key_to_mac
//      ipc_emb_init
//      ipc_emb_msg_evt
//      mdm_txcbwmax_setf
//      phy_hw_set_channel
//      phy_init
//      intc_spurious
//      mac_irq
//      bl_irq_handler
//      blmac_pwr_mgt_setf
//      chan_get_next_chan
//      chan_tbtt_insert
//      chan_upd_ctxt_status
//      chan_conn_less_delay_evt
//      chan_tx_cfm
//      chan_scan_req
//      chan_ctxt_del
//      chan_bcn_detect_start
//      chan_ctxt_link
//      chan_ctxt_unlink
//      blmac_soft_reset_getf
//      hal_machw_init
//      hal_machw_sleep_check
//      mm_cfg_rssi_req_handler
//      mm_set_ps_options_req_handler
//      mm_key_del_req_handler
//      mm_key_add_req_handler
//      mm_set_idle_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
//      scan_start_req_handler
//      mm_scan_channel_end_ind_handler
//      mm_scan_channel_start_ind_handler
//      txl_cfm_evt
//      me_extract_rate_set
//      me_rc_set_rate_req_handler
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      scanu_join_req_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      scanu_start_cfm_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      me_set_active_cfm_handler
//      mm_sta_add_cfm_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      mm_bcn_change_cfm_handler
//      apm_start_req_handler
//      me_set_active_cfm_handler
//      dbg_test_print
void assert_err()
{
	while (true)
		;
}

// 23013280: void assert_warn()
// Called from:
//      me_legacy_rate_bitfield_build
//      rxu_mpdu_upload_and_indicate.constprop.11
//      rxu_mgt_frame_check
//      sm_auth_handler
//      apm_tx_int_ps_get_postpone
//      chan_cde_evt
//      bam_send_air_action_frame
void assert_warn()
{
}

// 23013282: void coex_dump_pta()
// Called from:
//      cmd_coex_dump
void coex_dump_pta()
{
}

// 2301328A: void coex_dump_wifi()
// Called from:
//      cmd_coex_dump
void coex_dump_wifi()
{
}

// 2301329C: void coex_wifi_rf_forece_enable(Register word32 a0)
// Called from:
//      cmd_wifi_coex_rf_force_off
//      cmd_wifi_coex_rf_force_on
void coex_wifi_rf_forece_enable(word32 a0)
{
	rfc_coex_force_to(a0, a1, a5);
}

// 230132A6: void coex_wifi_pti_forece_enable(Register word32 a0)
// Called from:
//      cmd_wifi_coex_pti_force_off
//      cmd_wifi_coex_pti_force_on
void coex_wifi_pti_forece_enable(word32 a0)
{
	int32 a4_12;
	int32 a4_5 = *(int32 *) 0x44B00400;
	if (a0 != 0x00)
	{
		*(int32 *) 0x44B00400 = a4_5 | 0xF0000000;
		a4_12 = *(int32 *) 0x44B00400 | 16;
	}
	else
		a4_12 = a4_5 & ~0x10;
	int32 a4_23;
	*(int32 *) 0x44B00400 = a4_12;
	if (*(int32 *) 0x44B00400 << 0x04 < 0x00)
		a4_23 = *(int32 *) 0x44B00400 & ~0x04000000;
	else
		a4_23 = *(int32 *) 0x44B00400 & ~0x04000000 | 0x04000000;
	*(int32 *) 0x44B00400 = a4_23;
}

// 230132F8: Register word32 coex_wifi_pta_forece_enable(Register Eq_2 a0, Register (ptr32 word32) a3, Register ptr32 mstatus, Register out (ptr32 Eq_61576) s0Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out (ptr32 word32) a3Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_61581) s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_main
//      cmd_wifi_coex_pta_force_off
//      cmd_wifi_coex_pta_force_on
word32 coex_wifi_pta_forece_enable(Eq_2 a0, word32 * a3, ptr32 mstatus, struct Eq_61576 & s0Out, union Eq_2 & a0Out, ptr32 & a2Out, word32 & a3Out, union Eq_2 & s2Out, struct Eq_61581 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a5_7 = g_t4200D904;
	if (a5_7 != a0)
	{
		union Eq_2 * s1_20 = &g_t4200D904;
		s2 = a0;
		word32 s0_101 = 0x4200DCC4;
		if (a5_7 == 0x00)
		{
			word32 * a5_89;
			Eq_2 a0_88 = xTaskGetTickCount(out a5_89);
			s0_101 = *a3;
			Mem95[a5_89 - a3 + a0_88:word32] = Mem17[a5_89 + 0x00:word32];
		}
		else if (a5_7 == 0x01)
		{
			word32 * a5_25;
			Eq_2 a0_24 = xTaskGetTickCount(out a5_25);
			s0_101 = *a3;
			*((word32) a0_24 + (a5_25 - a3)) = *a5_25;
			__csrrc(mstatus, 0x08);
			bl_nap_calculate();
			__csrrs(mstatus, 0x08);
			s3 = (struct Eq_61581 *) 1000;
			if (a0_24 > 1000)
			{
				word32 sp_37;
				word32 a5_39;
				word32 s3_43;
				word32 s4_44;
				word32 a4_46;
				word32 a3_47;
				word32 a2_51;
				word32 mstatus_52;
				word32 a1_119;
				word32 tp_120;
				g_t4200C4E8();
				word32 a0_54;
				word32 a3_57;
				word32 s1_62;
				word32 s2_63;
				word32 s3_64;
				word32 s4_65;
				word32 a4_79;
				g_t4200C4F2();
			}
		}
		*s1_20 = (union Eq_2 *) s2;
		word32 a5_165;
		a0 = xTaskGetTickCount(out a5_165);
		*a0 = s0_101;
	}
	s0Out = s1;
	a0Out = a0;
	a2Out = dwArg48;
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	mstatusOut = mstatus;
	return ra;
}

