pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301339E: void wifi_main(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register (ptr32 Eq_61671) s3, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack (ptr32 Eq_61677) dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack (ptr32 Eq_61688) dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg7C, Stack word32 dwArg88, Stack word32 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArgE8, Stack word32 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void wifi_main(Eq_2 ra, Eq_2 s1, Eq_2 s2, struct Eq_61671 * s3, Eq_2 s6, Eq_2 s7, ptr32 fflags, ptr32 frm, ptr32 mstatus, struct Eq_61677 * dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, struct Eq_61688 * dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg7C, word32 dwArg88, word32 dwArgC8, Eq_2 dwArgD8, word32 dwArgE8, word32 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	struct Eq_61704 * s0_41;
	Eq_2 ra_40 = rfc_init(0x44B00000, s1, 40000000, s2, s3, s6, s7, fflags, frm, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg38, dwArg44, s3, s1, out s0_41);
	s0_41->dw0400 |= 1;
	mpif_clk_init();
	sysctrl_init();
	intc_init();
	struct Eq_61749 * s0_92;
	struct Eq_61750 * s2_129;
	struct Eq_61751 * s3_141;
	Eq_2 a3_148;
	Eq_2 a2_150;
	Eq_2 a0_153;
	word32 ra_211 = bl_init(ipc_emb_init(ra_40), mstatus, s2, dwLoc10, dwLoc0C, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg5C, ra, dwArg7C, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_92, out a0_153, out a2_150, out a3_148, out s2_129, out s3_141);
	s0_92->dw0404 = 0x0024F037;
	s0_92->dw0400 = 0x01;
	s0_92->dw0400 = 0x00;
	s0_92->dw0400 = 0x0069;
	s0_92->dw0400 &= -33;
	*(word32 *) 0x50100023 = 0x44920000;
	struct Eq_61834 * s0_125 = (struct Eq_61834 *) 0x44900000;
	struct Eq_61836 * s5_126 = (struct Eq_61836 *) 0x40007000;
	ui32 s6_128 = 0x005C2000;
	while (true)
	{
		ui32 a5_135;
		Eq_2 a5_131 = s2_129->t0120;
		ui32 a5_134 = s0_125->dw0084;
		if (a5_131 << 0x0C < 0x00)
			a5_135 = a5_134 | 1;
		else
			a5_135 = a5_134 & ~0x01;
		s0_125->dw0084 = a5_135;
		Eq_2 a5_143 = s3_141->tFFFFFC58;
		if (a5_143 == 0x00)
			a0_153 = ipc_emb_wait(a2_150, a3_148, a5_131 << 0x0C, a5_143, mstatus, s2, dwArgF8, out a5_143);
		*((word32) a5_143 + 1) = *a5_143;
		if ((a5_143 & 0x0F) == 0x00)
		{
			Eq_61894 a5_174 = s5_126->t0018;
			ui32 a4_176 = a5_174 >> 24 & 7;
			if (a4_176 != 0x00)
			{
				if (a4_176 != 0x03)
					*(union Eq_2 *) 0x00040017 = *(union Eq_2 *) 0x17;
				if (a4_176 != 0x00 && a4_176 != 0x03)
				{
					*(union Eq_2 *) 64 = *(union Eq_2 *) 0x43;
					*(word32 *) 0x0044 = *(word32 *) 0x0044;
				}
			}
			struct Eq_61905 * a5_193 = a5_174 >> 24 & 0x04;
			if (a5_193 != null)
			{
				(a5_193 | s6_128)->dw0014 = a5_193->dw0014;
				*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C & ~0x01 | 4;
			}
		}
		Eq_2 a0_255;
		s5_126 = ke_evt_schedule(ra_211, a0_153, dwArg88, out s6_128);
		word32 * a3_249;
		if (bl_sleep(dwArg08, out a3_249) != 0x00)
			a0_255.u0 = 0x00;
		else
			a0_255.u0 = 0x01;
		ra_211 = coex_wifi_pta_forece_enable(a0_255, a3_249, mstatus, out s0_125, out a0_153, out a2_150, out a3_148, out s2_129, out s3_141, out mstatus);
	}
}

// 230134CE: void ipc_emb_notify(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0108)
// Called from:
//      mac_irq
//      bl_irq_handler
void ipc_emb_notify(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArg0108)
{
	Eq_2 a4_5 = g_t4200DCC8;
	if (a4_5 != 0x00)
	{
		Eq_2 a5_18 = g_t4200DE84;
		if (a5_18 != 0x00)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			vTaskNotifyGiveFromISR(a0, a1, a2, a4, mstatus, stackArg56);
			if (a5_18 != 0x00)
			{
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg48 = <invalid>;
				Eq_2 stackArg52 = <invalid>;
				Eq_2 stackArg88 = <invalid>;
				Eq_2 stackArg124 = <invalid>;
				word32 a0_89;
				word32 a4_90;
				word32 a5_91;
				vTaskSwitchContext(ra, a3, s2, mstatus, stackArg48, stackArg52, stackArg88, stackArg124, out a0_89, out a4_90, out a5_91);
			}
		}
		else
		{
			word32 s0_92;
			word32 s1_93;
			word32 a0_94;
			word32 a1_95;
			word32 a2_96;
			word32 a3_97;
			word32 a4_98;
			word32 a5_99;
			word32 s2_100;
			word32 s3_101;
			word32 s4_102;
			word32 mstatus_103;
			xTaskGenericNotify(ra, a0, 0x00, 0x02, 0x00, a4_5, mstatus, dwLoc0C, dwArg18, dwArg38, dwArgC4, dwArgE0, dwArgE4, dwArg0108, out s0_92, out s1_93, out a0_94, out a1_95, out a2_96, out a3_97, out a4_98, out a5_99, out s2_100, out s3_101, out s4_102, out mstatus_103);
		}
	}
	else
		assert_err();
}

// 23013528: Register word32 ipc_emb_wait(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg0118, Register out (ptr32 Eq_61866) a5Out)
// Called from:
//      wifi_main
word32 ipc_emb_wait(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg0118, struct Eq_61866 & a5Out)
{
	word32 a2_34;
	word32 a3_35;
	word32 a4_36;
	word32 s2_37;
	word32 s3_38;
	ulTaskNotifyTake((struct Eq_62092 *) 0x01, ~0x00, a2, a3, a4, a5, mstatus, dwArg08, dwArg0118, out a2_34, out a3_35, out a4_36, out s2_37, out s3_38);
	int32 a5_24 = g_dw4201D114;
	g_dw4201D114 = a5_24 + 0x01;
	a5Out = a5_24 + 0x01;
	return 0x01;
}

