pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301415C: Register Eq_2 phy_set_channel(Register Eq_2 ra, Register up32 a0, Register (ptr32 Eq_62676) a1, Register Eq_62646 a3, Register (ptr32 Eq_63365) s3, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack word32 dwArg0158, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out (ptr32 byte) s2Out, Register out (ptr32 Eq_63365) s3Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      chan_tx_cfm
//      chan_ctxt_update
//      mm_monitor_channel_req_handler
//      mm_monitor_enable_req_handler
//      mm_start_req_handler
//      mm_hw_config_handler
Eq_2 phy_set_channel(Eq_2 ra, up32 a0, struct Eq_62676 * a1, Eq_62646 a3, struct Eq_63365 * s3, ptr32 fflags, ptr32 frm, Eq_2 dwArg04, Eq_2 dwArg24, word32 dwArg0158, ptr32 & s0Out, ptr32 & s1Out, byte & s2Out, struct Eq_63365 & s3Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if (((word32) (word16) ((word32) a3 - 0x00FFF96C) <= 72 || a0 != 0x00) && a0 <= 0x01)
	{
		ptr32 fflags_54;
		ptr32 frm_55;
		ptr32 s0_57;
		ptr32 s1_58;
		byte * s2_60;
		struct Eq_63365 * s3_61;
		Eq_2 ra_56 = phy_hw_set_channel(ra, a0, a3, a1, a1, fflags, frm, dwArg04, dwArg24, s3, dwArg0158, out s0_57, out s1_58, out s2_60, out s3_61, out fflags_54, out frm_55);
		g_b4201D142 = (byte) s0_57;
		g_b4201D143 = (byte) s3_61;
		g_w4201D13C = (word16) s2_60;
		g_w4201D13E = (word16) s1_58;
		s0Out = s0_57;
		s1Out = s1_58;
		s2Out = s2_60;
		s3Out = s3_61;
		fflagsOut = fflags_54;
		frmOut = frm_55;
		return ra_56;
	}
	else
	{
		s0Out = s0;
		s1Out = s1;
		s2Out = s2;
		s3Out = s3;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
}

// 230141BE: void phy_get_version(Register ptr32 a0, Register (ptr32 word32) a1)
// Called from:
//      mm_version_req_handler
void phy_get_version(ptr32 a0, word32 * a1)
{
	**(ptr32 **) 0x44C00000 = a0;
	*a1 = 0x00;
}

// 230141CC: Register word32 phy_vht_supported(Register ui32 a4)
// Called from:
//      phy_init
word32 phy_vht_supported(ui32 a4)
{
	word32 a0_10 = 0x01;
	if (a4 << 0x09 >= 0x00)
		a0_10 = 0x00;
	return a0_10;
}

// 230141E4: Register Eq_2 phy_init(Register Eq_2 ra, Register Eq_2 s1, Stack Eq_2 dwArg38, Register out ptr32 s3Out)
// Called from:
//      mm_monitor_enable_req_handler
//      mm_start_req_handler
Eq_2 phy_init(Eq_2 ra, Eq_2 s1, Eq_2 dwArg38, ptr32 & s3Out)
{
	*(word32 *) 0x44C01800 = 0x00;
	mdm_reset();
	*(struct Eq_63388 **) 0x44C01820 = (struct Eq_63388 *) 525;
	if (false)
	{
		*(struct Eq_63388 **) 0x44C01820 = *(int32 *) 0x44C00820 & -113 | 0x0FF0;
		ui32 s1_43 = (s1 >> 0x0C & 0x0F) + ~0x00 & 0x00FF;
		if ((s1_43 << 0x0C & 0x000F8000) == 0x00)
		{
			int32 a5_53 = *(int32 *) 0x44C00820;
			*(struct Eq_63388 **) 0x44C01820 = s1_43 << 0x0C | a5_53 & ~0x07000000;
			int32 a4_60 = *(int32 *) 0x44C00820;
			*(struct Eq_63388 **) 0x44C01820 = (a5_53 & ~0x07000000) >> 19 & 0x0100 | a4_60 & -0x0101;
			ui32 a0_66 = phy_vht_supported(a4_60 & -0x0101);
			int32 a5_69 = *(int32 *) 0x44C00820;
			struct Eq_63388 * a0_73 = a0_66 << 1 | a5_69 & ~0x02;
			*(struct Eq_63388 **) 0x44C01820 = a0_73;
			struct Eq_63388 * a5_82 = ((a5_69 & ~0x02) >> 30 & 0x01) << 16 | *((int32 *) 0x44C00820) & ~0x10000000;
			*(struct Eq_63388 **) 0x44C01820 = a5_82;
			struct Eq_63388 * a5_92 = (a5_82 >> 30 & 0x01) << 20 | *((int32 *) 0x44C00820) & ~0x00100000;
			*(struct Eq_63388 **) 0x44C01820 = a5_92;
			(a5_92 & ~0x003F0000 | 0x002D0000)->dw0024 = a5_92->dw0024;
			*(word32 *) 0x44C0189C = ~0x00;
			*(int32 *) 0x44C01824 = 525;
			uint32 s1_105 = *(uint32 *) 0x44C01000;
			if (false)
			{
				*(int32 *) 0x44C01824 = *(int32 *) 0x44C00824 & -113 | 0x0FF0;
				ui32 s1_128 = (s1_105 >> 4 & 0x0F) + ~0x00 & 0x00FF;
				if ((s1_128 << 20 & 0x0F800000) == 0x00)
				{
					*(int32 *) 0x44C01824 = s1_128 << 20 | *((int32 *) 0x44C00824) & ~0x00700000;
					uint32 a5_150 = mdm_txcbwmax_setf(a0_73 >> 24 & 0x03);
					int32 a4_152 = *(int32 *) 0x44C00824;
					*(int32 *) 0x44C01824 = a5_150 >> 18 & 0x0100 | a4_152 & -0x0101;
					ui32 a0_158 = phy_vht_supported(a4_152 & -0x0101);
					int32 a5_161 = *(int32 *) 0x44C00824;
					*(int32 *) 0x44C01824 = a0_158 << 1 | a5_161 & ~0x02;
					*(int32 *) 0x44C01824 = (a5_161 & ~0x02) >> 31 << 16 | *((int32 *) 0x44C00824) & ~0x10000000;
					*(ui32 *) 0x44C01834 = *(union Eq_63424 *) 0x44C00834 | 1;
					*(ui32 *) 0x44C01818 = *(int32 *) 0x44C00818 & ~0x00040000;
					*(ui32 *) 0x44C01830 = *(int32 *) 0x44C00830 & 0xF00000FF | 0x01FFFB00;
					*(ui32 *) 0x44C01830 = *(int32 *) 0x44C00830 & -0x0100 | 0x0F;
					*(word32 *) 0x44C0183C = 0x04920492;
					*(ui32 *) 0x44C01874 = *(int32 *) 0x44C00874 & ~0x08000000 | 0x08000000;
					struct Eq_63892 ** a4_209 = *(struct Eq_63892 ***) 0x44C0B500 & ~0x03000000 | 0x02000000;
					*(struct Eq_63892 ***) 0x44C0B500 = a4_209;
					struct Eq_63892 * a5_211 = *a4_209;
					if (a4_209 << 0x0A < 0x00)
					{
						a5_211->dw0110 &= ~0x08;
						a5_211->dw0110 &= ~0x04;
						a5_211->dw0110 &= ~0x02;
						a5_211->dw0110 &= ~0x01;
						a5_211->dw0118 = 0x00;
					}
					((union Eq_2 *) 0x05)->u0 = 0x44C0B000;
					*(int32 *) 0x44C0B390 = *(int32 *) 0x44C0B390 & ~0x03 | 1;
					*(word32 *) 0x44C0B3BC = 4000000;
					*(int32 *) 0x44C0B414 |= 0x0100;
					word32 a2_241;
					word32 ** s2_249;
					ptr32 s3_250;
					struct Eq_63925 * s0_247 = agc_config(out a2_241, out s2_249, out s3_250);
					s0_247->dw0390 = s0_247->dw0390 & ~0x01000000 | 0x01000000;
					*(ui32 *) 0x44C01874 = *(int32 *) 0x44C00874 & ~0x20000000 | 0x20000000;
					struct Eq_63950 * a4_273 = (struct Eq_63950 *) 0x54C0A000;
					do
					{
						++a4_273;
						a4_273[0x03FF] = (struct Eq_63950) a2_241;
					} while (a4_273 != (struct Eq_63950 *) 0x54C0A800);
					*(ui32 *) 0x44C01874 = *(int32 *) 0x44C00874 & ~0x20000000;
					int32 a5_290 = *(int32 *) 0x44C0B390;
					*(int32 *) 0x44C0B390 = a5_290 & ~0x01000000;
					(a5_290 & ~0x01000000 & ~0x03FF0000 | 0x00140000)->dw0020 = (a5_290 & ~0x01000000)->dw0020;
					**s2_249 = 0x4201D138;
					*(word32 *) 0x00FF0103 = 0x4201D138;
					*(word32 *) 0x05000107 = 0x4201D138;
					trpc_init();
					pa_init();
					Eq_2 ra_329 = phy_tcal_reset(ra);
					0x00 = (uint16) dwArg38;
					phy_tcal_start();
					s3Out = s3_250;
					return ra_329;
				}
				else
					assert_err();
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

