pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301458C: Register uint32 phy_get_nss(Register uint32 a0)
// Called from:
//      me_config_req_handler
uint32 phy_get_nss(uint32 a0)
{
	return (a0 >> 8 & 0x0F) + ~0x00 & 0x00FF;
}

// 2301459E: Register (ptr32 Eq_8573) phy_get_ntx(Register (ptr32 Eq_8573) a0)
// Called from:
//      txl_frame_init
//      rc_init
//      hal_machw_init
//      txl_buffer_init
struct Eq_8573 * phy_get_ntx(struct Eq_8573 * a0)
{
	return (a0 >> 4 & 0x0F) + ~0x00 & 0x00FF;
}

// 230145B0: void phy_stop()
// Called from:
//      mm_reset_req_handler
void phy_stop()
{
}

// 230145B2: Register uint32 phy_ldpc_tx_supported(Register uint32 a0)
// Called from:
//      rc_init
uint32 phy_ldpc_tx_supported(uint32 a0)
{
	return a0 >> 26 & 0x01;
}

// 230145BE: Register int32 phy_get_mac_freq()
// Called from:
//      hal_machw_init
int32 phy_get_mac_freq()
{
	return 40;
}

// 230145C4: Register (ptr32 byte) phy_get_rf_gain_idx(Register (ptr32 byte) a0, Register (ptr32 Eq_20224) a1, Register Eq_2 a3, Register out ptr32 a3Out, Register out Eq_20257 a4Out)
// Called from:
//      tpc_update_vif_tx_power
byte * phy_get_rf_gain_idx(byte * a0, struct Eq_20224 * a1, Eq_2 a3, ptr32 & a3Out, union Eq_20257 & a4Out)
{
	ptr32 a3_19;
	Eq_20257 a4_20;
	byte * a0_16 = rfc_get_power_level(0x02, (int32) *a0 + 0x0A, a3, out a3_19, out a4_20);
	a1->b0000 = (byte) a0_16;
	a3Out = a3_19;
	a4Out = a4_20;
	return a0_16;
}

// 230145E8: Register (ptr32 byte) phy_get_rf_gain_capab(Register (ptr32 byte) a0, Register (ptr32 byte) a1, Register out ptr32 s8Out)
// Called from:
//      me_build_associate_req
byte * phy_get_rf_gain_capab(byte * a0, byte * a1, ptr32 & s8Out)
{
	*a0 = (byte) trpc_get_rf_max_power();
	*a1 = (byte) trpc_get_rf_min_power();
	s8Out = dwLoc1C;
	return a0;
}

// 23014608: void mpif_clk_init()
// Called from:
//      wifi_main
void mpif_clk_init()
{
}

// 2301460A: void phy_mdm_isr()
void phy_mdm_isr()
{
}

// 2301460C: void phy_rc_isr()
void phy_rc_isr()
{
	int32 a5_5 = *(int32 *) 0x44C0B41C;
	*(int32 *) 0x44C0B420 = a5_5;
	if ((a5_5 & 0x0100) == 0x00)
		return;
	mdm_reset();
}

// 23014624: void pa_init()
// Called from:
//      phy_init
void pa_init()
{
	union Eq_64125 * a5_26 = &g_t420117EC;
	do
	{
		*((char *) a5_26 + 115) = (union Eq_64125 *) 0x00;
		*((char *) a5_26 + 0x0078) = 0x00;
		*((char *) a5_26 + 0x006C) = 0x00;
		*((char *) a5_26 + 0x0068) = (union Eq_64125 *) 0x00;
		*((char *) a5_26 + 0x0087) = (union Eq_64125 *) 0x00;
		*((char *) a5_26 + 0x0080) = 0x00;
		*((char *) a5_26 + 0x0088) = (union Eq_64125 *) 0x00;
		*((char *) a5_26 + 0x0089) = (union Eq_64125 *) 0x00;
		union Eq_64125 * a4_15 = a5_26;
		word32 a3_16;
		for (a3_16 = 0x08; a3_16 != 0x00; a3_16 += ~0x00)
		{
			*((char *) a4_15 + 16) = (union Eq_64125 *) 0x00;
			*((char *) a4_15 + 8) = (union Eq_64125 *) 0x00;
			*((char *) a4_15 + 9) = (union Eq_64125 *) 0x00;
			*((char *) a4_15 + 0x0C) = 0x00;
			a4_15 = (union Eq_64125 *) ((char *) a4_15 + 0x0C);
		}
		a5_26 = (union Eq_64125 *) ((char *) a5_26 + 0x008C);
	} while (a5_26 != &g_w42011A1C);
}

// 23014674: Register Eq_2 pa_input(Register Eq_2 ra, Register (ptr32 Eq_17175) a0, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg38, Register out ptr32 a2Out, Register out ptr32 fa0Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxl_cntrl_evt
Eq_2 pa_input(Eq_2 ra, struct Eq_17175 * a0, ptr32 fflags, ptr32 frm, Eq_2 dwArg38, ptr32 & a2Out, ptr32 & fa0Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if (a0 > (struct Eq_17175 *) 0x03)
	{
		a2Out = 0x03;
		fa0Out = fa0;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
	int32 s1_114;
	word32 s2_115;
	ptr32 s0_113;
	Eq_2 ra_112;
	ptr32 fflags_110;
	Eq_2 a0_132;
	uint32 a1_133;
	ptr32 frm_111;
	struct Eq_64200 * a1_19 = a0->ptr0020;
	int32 s2_22 = (int32) a0->b420118E0;
	a0->ptr006C = &a0->ptr006C + 0x10804603;
	struct Eq_64214 * a4_26 = &a0->ptr006C + 8 + (s2_22 + 0x0C) / 1107368161;
	a4_26->b420117FC = 0x01;
	int32 a4_30 = (int32) a1_19->b0033;
	a4_26->b420117F4 = (byte) a4_30;
	struct Eq_64233 * a4_34 = a4_30 << 20 >> 28;
	a4_26->b420117F5 = (byte) a4_34;
	struct Eq_64242 * a1_36 = a4_34->ptr002C;
	if ((a4_34 & 0x00070000) == 0x00)
	{
		a1_36 = (a4_34 & 0x00070000)->ptr0028;
		word32 a0_40 = (word32) a1_36->b003B;
		if (((a4_34 & 0x00070000) >> 0x0C & 0x0F) <= 0x03)
		{
			word32 a4_332;
			Eq_64250 a1_126;
			word32 a5_333;
			word32 a7_334;
			word32 s3_335;
			word32 s4_336;
			word32 s5_337;
			word32 s6_338;
			word32 s7_339;
			word32 s8_340;
			word32 s9_341;
			ra_112 = __muldf3(ra, __floatsidf((int32) (byte) a0_40, out a1_126), a1_126, g_t23076790, g_t23076794, fflags, frm, out s0_113, out s1_114, out a0_132, out a1_133, out a4_332, out a5_333, out a7_334, out s2_115, out s3_335, out s4_336, out s5_337, out s6_338, out s7_339, out s8_340, out s9_341, out fflags_110, out frm_111);
l230146F8:
			ptr32 fa0_172;
			word32 a2_342;
			word32 a3_343;
			word32 a4_344;
			word32 a5_345;
			__truncdfsf2(ra_112, a0_132, a1_133, fflags_110, frm_111, out a2_342, out a3_343, out a4_344, out a5_345, out fa0_172);
			*((word32) a0_132 + 0x0C) = s2_115 + 0x0C + (s0_113 + 0x008C) + s1_114;
			int32 a5_185 = 0x00;
			if (s2_115 != 0x07)
				a5_185 = (int32) (byte) (s2_115 + 0x01);
			(s0_113 + 0x008C + s1_114)->b0068 = (byte) a5_185;
			0x00 = (uint16) dwArg38;
			a2Out = dwArg10;
			fa0Out = fa0_172;
			fflagsOut = fflags_110;
			frmOut = frm_111;
			return ra_112;
		}
	}
	Eq_64250 a1_53;
	Eq_2 a0_64;
	Eq_64252 a1_65;
	ptr32 fflags_79;
	ptr32 frm_80;
	word32 s9_331;
	word32 s3_330;
	word32 a3_329;
	word32 s9_328;
	word32 s8_327;
	word32 s7_326;
	word32 s6_325;
	word32 s5_324;
	word32 s4_323;
	word32 s3_322;
	word32 s2_321;
	word32 a7_320;
	word32 a5_319;
	word32 a4_318;
	word32 s1_317;
	word32 s0_316;
	ra_112 = __divdf3(__muldf3(ra, __floatsidf(0x00 - (int32) ((word16) (((word32) a1_36->b003C << 8) + (word32) a1_36->b003B)), out a1_53), a1_53, g_t23076798, g_t2307679C, fflags, frm, out s0_316, out s1_317, out a0_64, out a1_65, out a4_318, out a5_319, out a7_320, out s2_321, out s3_322, out s4_323, out s5_324, out s6_325, out s7_326, out s8_327, out s9_328, out fflags_79, out frm_80), a0_64, a1_65, g_t230767A0, g_t230767A4, fflags_79, frm_80, out s0_113, out s1_114, out a0_132, out a1_133, out a3_329, out s2_115, out s3_330, out s9_331, out fflags_110, out frm_111);
	goto l230146F8;
}

// 23014776: Register Eq_2 pa_adapt(Register Eq_2 ra, Register (ptr32 Eq_17160) a0, Register (ptr32 Eq_17114) a2, Register Eq_5614 fa0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArgC8, Register out (ptr32 Eq_17160) s1Out, Register out (ptr32 Eq_17168) a4Out, Register out Eq_17169 a5Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxl_cntrl_evt
Eq_2 pa_adapt(Eq_2 ra, struct Eq_17160 * a0, struct Eq_17114 * a2, Eq_5614 fa0, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArgC8, struct Eq_17160 & s1Out, struct Eq_17168 & a4Out, union Eq_17169 & a5Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if (a0 > (struct Eq_17160 *) 0x03)
	{
		s1Out = s1;
		a4Out = a4;
		a5Out.u0 = 0x03;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
	else
	{
		struct Eq_17168 * a4_277;
		a2->dw0001 = a2->dw0000;
		int32 s0_251 = 1107367916;
		int32 t3_33 = (int32) a0->b420118E0;
		if (t3_33 == 0x00)
			a4_277 = (struct Eq_17168 *) ((char *) a0 + 0x420118D4);
		else
			a4_277 = (struct Eq_17168 *) ((char *) a0 + 0x0094 + (t3_33 + 11) + 1107367916);
		Eq_17169 a5_134 = (word32) a4_277->b0008;
		if (a5_134 != 0x00)
		{
			Eq_64510 s2_48 = (int32) a4_277->b0000;
			struct Eq_64515 * a1_51 = (int32) a0->b420118EB;
			if (a1_51 != null)
			{
				up32 a1_111 = (word32) a0->b420118EC;
				if (a1_111 > 0x04)
				{
					a0->b420118EC = 0x00;
					a0->b420118EB = 0x00;
					a0->dw420118F0 = 0x00;
				}
				else if (s2_48 <= 0)
				{
					Eq_64760 a6_115 = (int32) a0->b420118E8;
					Eq_64765 a3_117 = s2_48 - a6_115;
					if (a3_117 > ~0x09)
						a0->b420118EC = (byte) (a1_111 + 0x01);
					else
					{
						a0->b420118EC = 0x00;
						a0->b420118E8 = (byte) ((word32) a6_115 + (a3_117 >> 2));
					}
				}
			}
			else
			{
				struct Eq_64522 * a5_52 = a1_51->ptr0078;
				if (a1_51 > (struct Eq_64515 *) 0x06)
				{
					a5_52->b0073 = 0x01;
					int32 a6_58;
					int32 a7_59 = 100;
					int32 t1_60 = -100;
					word32 a5_61 = 0x00;
					for (a6_58 = 0x01; a6_58 != 0x07; ++a6_58)
					{
						int32 a3_78 = (int32) ((char *) a0 + 0x008C + ((t3_33 - a6_58 | 0x08) + 0x0C))[0x420117F4];
						a5_61 += a3_78;
						if (t1_60 < a3_78)
							t1_60 = a3_78;
						if (a3_78 < a7_59)
							a7_59 = a3_78;
					}
					a0->b420118E8 = (byte) (a5_61 - t1_60 - a7_59 ^ 0x04);
				}
				else
					a1_51->ptr0079 = a5_52;
			}
			a5_134.u0 = 0x0F;
			if ((&a2->dw0001 & 0x0F) == 0x0F)
			{
				s1 = a0;
				if (s2_48 - (int32) a0->b420118E8 <= ~0x09)
				{
					word32 a5_161;
					if ((word32) (fa0 >= 0.0F) != 0x00)
						a5_161 = (word32) (g_t2307676C < fa0);
					else
						a5_161 = (word32) (fa0 < g_t23076770);
					if (a5_161 != 0x00)
					{
						Eq_2 a3_210;
						Eq_2 a2_209;
						Eq_64250 a1_188;
						Eq_2 a0_187 = __extendsfdf2(ra, fa0, fflags, frm, out a1_188);
						if (s2_48 < -0x0055)
						{
							word32 a1_753;
							__extendsfdf2(ra, a0->t420118F8, fflags, frm, out a1_753);
							a2_209 = g_t23076780;
							a3_210 = g_t23076784;
						}
						else
						{
							word32 a1_752;
							__extendsfdf2(ra, a0->t420118F8, fflags, frm, out a1_752);
							a2_209 = g_t23076788;
							a3_210 = g_t2307678C;
						}
						Eq_64619 a0_233;
						Eq_64620 a1_234;
						Eq_2 s6_257;
						uint32 s7_258;
						word32 s9_762;
						word32 s4_759;
						word32 s8_761;
						word32 s5_760;
						word32 s2_757;
						word32 s3_758;
						word32 a4_754;
						word32 a7_756;
						word32 a5_755;
						ra = __muldf3(ra, a0_187, a1_188, a2_209, a3_210, fflags, frm, out s0_251, out s1, out a0_233, out a1_234, out a4_754, out a5_755, out a7_756, out s2_757, out s3_758, out s4_759, out s5_760, out s6_257, out s7_258, out s8_761, out s9_762, out fflags, out frm);
						uint32 a1_266;
						Eq_2 a0_265 = __adddf3(ra, s6_257, s7_258, a0_233, a1_234, fflags, frm, out a1_266);
						real32 fa0_281;
						word32 a3_764;
						word32 a5_765;
						word32 a2_763;
						__truncdfsf2(ra, a0_265, a1_266, fflags, frm, out a2_763, out a3_764, out a4_277, out a5_765, out fa0_281);
						*((word32) a0_265 + 0x0200) = fa0_281;
					}
				}
				real32 fa5_291 = ((char *) s1 + 0x008C + s0_251)[0x0080];
				if ((word32) (fa5_291 >= 0.0F) != 0x00)
					a5_134 = (word32) (fa5_291 < g_r23076774);
				else
					a5_134 = (word32) (g_r23076778 < fa5_291);
				if (a5_134 == 0x00)
				{
					__csrrc(mstatus, 0x08);
					if ((word32) (((char *) s1 + 0x008C + s0_251)[0x0080] > 0.0F) != 0x00 && hal_get_capcode() != 0x00)
					{
						word32 a5_766;
						a4_277 = hal_set_capcode((word32) hal_get_capcode() - 1, out a5_766);
					}
					a5_134 = (word32) (((char *) s1 + 0x008C + s0_251)[0x0080] < 0.0F);
					if (a5_134 != 0x00)
					{
						a5_134.u0 = 62;
						if (hal_get_capcode() <= 62)
							a4_277 = hal_set_capcode((word32) hal_get_capcode() + 1, out a5_134);
					}
					s1 = (struct Eq_17160 *) ((char *) s1 + 0x008C);
					*((char *) (s1 + s0_251 / 1107368188) + 0x0080) = 0x00;
					__csrrs(mstatus, 0x08);
				}
			}
		}
		0x00 = (uint16) dwArgC8;
		s1Out = s1;
		a4Out = a4_277;
		a5Out = a5_134;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
}

