pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23014A18: Register ui32 hal_get_capcode()
// Called from:
//      pa_adapt
ui32 hal_get_capcode()
{
	return *(union Eq_64837 *) 0x4000F884 >> 22 & 63;
}

// 23014A28: Register ui32 hal_set_capcode(Register ui32 a0, Register out Eq_64723 a5Out)
// Called from:
//      pa_adapt
ui32 hal_set_capcode(ui32 a0, union Eq_64723 & a5Out)
{
	Eq_64837 a4_5 = *(union Eq_64837 *) 0x4000F884;
	Eq_64723 a5_13 = a0 << 0x10 | a0 << 22 | a4_5 & ~0x0FFF0000;
	*(union Eq_64723 *) 0x40010884 = a5_13;
	a5Out = a5_13;
	return a4_5 & ~0x0FFF0000;
}

// 23014A48: Register (ptr32 word16) hal_get_temperature(Register (ptr32 word16) a0)
// Called from:
//      phy_tcal_callback
word16 * hal_get_temperature(word16 * a0)
{
	*a0 = (word16) (word32) g_w4200DCD0;
	return (word16 *) 0x01;
}

// 23014A58: void hal_set_temperature(Register int32 a0)
// Called from:
//      phy_tcal_callback
void hal_set_temperature(int32 a0)
{
	g_w4200ECD0 = (word16) a0;
}

// 23014A62: void trpc_update_power(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_table
void trpc_update_power(ptr32 a0)
{
	byte a5_24[] = g_a4200CEFC;
	word32 a3_23;
	for (a3_23 = 0x00; a3_23 != 0x18; a3_23 += 0x08)
	{
		ptr32 t1_10 = a0 + a3_23;
		int32 a4_11;
		for (a4_11 = 0x00; a4_11 != 0x08; ++a4_11)
			a5_24[a4_11] = (byte) (int32) (t1_10 + a4_11);
		a5_24 = (byte (*)[]) (a5_24 + 8);
	}
}

// 23014A96: void trpc_power_get(Register Eq_2 a0)
// Called from:
//      bl_tpc_power_table_get
void trpc_power_get(Eq_2 a0)
{
	word32 a1_20;
	word32 a2_21;
	word32 a3_22;
	word32 a4_23;
	word32 a5_24;
	word32 a6_25;
	word32 a7_26;
	memcpy(a0, 0x4200CEFC, 0x18, out a1_20, out a2_21, out a3_22, out a4_23, out a5_24, out a6_25, out a7_26);
}

// 23014AA4: void trpc_update_power_11b(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_rate_11b
void trpc_update_power_11b(ptr32 a0)
{
	struct Eq_64913 * a5_14 = null;
	do
	{
		a5_14[0x4200CEFC] = (struct Eq_64913) (byte) (int32) a5_14[a0];
		++a5_14;
	} while (a5_14 != (struct Eq_64913 *) 0x04);
}

// 23014AC8: void trpc_update_power_11g(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_rate_11g
void trpc_update_power_11g(ptr32 a0)
{
	struct Eq_64926 * a5_13 = g_a4200CEFC;
	int32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x08; ++a4_12)
	{
		++a5_13;
		a5_13[7] = (struct Eq_64926) (byte) (int32) (a0 + a4_12);
	}
}

// 23014AEA: void trpc_update_power_11n(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_rate_11n
void trpc_update_power_11n(ptr32 a0)
{
	struct Eq_64943 * a5_13 = g_a4200CEFC;
	int32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x08; ++a4_12)
	{
		++a5_13;
		a5_13[0x0F] = (struct Eq_64943) (byte) (int32) (a0 + a4_12);
	}
}

// 23014B0C: void trpc_init()
// Called from:
//      phy_init
void trpc_init()
{
	g_w4201D148 = 63882;
	g_b4201D144 = (byte) rf_pri_get_txgain_max();
	word32 a0_17 = rf_pri_get_txgain_min();
	g_b4201D146 = 0x1E;
	g_b4201D145 = (byte) a0_17;
	g_t4201D14A.u1 = 0x19;
}

// 23014B48: Register int32 trpc_get_rf_max_power()
// Called from:
//      phy_get_rf_gain_capab
int32 trpc_get_rf_max_power()
{
	return (int32) g_b4201D144;
}

// 23014B52: Register int32 trpc_get_rf_min_power()
// Called from:
//      phy_get_rf_gain_capab
int32 trpc_get_rf_min_power()
{
	return (int32) g_b4201D145;
}

// 23014B5C: Register uint32 trpc_get_power_idx(Register Eq_2 ra, Register uint32 a0, Register (ptr32 Eq_64992) a1, Register int32 a2, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_64999 a5Out)
// Called from:
//      trpc_get_default_power_idx
uint32 trpc_get_power_idx(Eq_2 ra, uint32 a0, struct Eq_64992 * a1, int32 a2, ptr32 fflags, ptr32 frm, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_64999 & a5Out)
{
	ui32 a4_11 = 0x02;
	if (a0 <= 0x02)
		a4_11 = a0 & 0x00FF;
	struct Eq_64992 * a7_13 = (struct Eq_64992 *) 0x03;
	if (a0 != 0x00)
		a7_13 = (struct Eq_64992 *) 0x07;
	int32 a5_21 = (word32) g_b4201D146;
	int32 a0_20 = (int32) g_b4201D144;
	if (a0_20 < (int32) ((byte) a5_21))
		a5_21 = a0_20;
	if (a2 < (int32) ((byte) a5_21))
		a5_21 = a2;
	int32 a5_35 = a5_21 << 24;
	if (a7_13 < a1)
		a1 = a7_13;
	int32 a4_60 = (word32) a1->a4200CEFC[a4_11].b0000;
	if (a5_35 >> 24 < (int32) ((byte) a4_60))
		a4_60 = a5_35 >> 24;
	int32 a5_70 = (word32) g_b4201D145;
	if ((int32) (byte) a5_70 < (int32) ((byte) a4_60))
		a5_70 = a4_60;
	uint32 a1_91;
	word32 a4_209;
	Eq_64250 a1_122;
	ptr32 a1_131;
	ptr32 a3_133;
	word32 a5_210;
	Eq_2 a0_130 = __fixdfsi(ra, __adddf3(ra, __floatsidf((int32) (byte) a5_70 + -510 + a0_20 ^ 0x0200, out a1_91), a1_91, g_t230767A8, g_t230767AC, fflags, frm, out a1_122), a1_122, fflags, frm, out a1_131, out a3_133, out a4_209, out a5_210);
	word32 a5_138 = 0x03;
	if (a0 != 0x00)
		a5_138 = 0x00;
	ui32 a5_148 = a5_138 + (a0_130 & 0x00FF);
	ui32 a0_151 = a5_148 & 0x00FF;
	if ((a5_148 & 0x00FF) > 0x0F)
		a0_151 = 0x0F;
	a1Out = a1_131;
	a3Out = a3_133;
	a4Out = 0x0F;
	a5Out = a5_148 & 0x00FF;
	return a0_151 << 2 & 252;
}

// 23014C3A: Register uint32 trpc_get_default_power_idx(Register Eq_2 ra, Register uint32 a0, Register int32 a1, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      tpc_update_vif_tx_power
//      tpc_get_vif_tx_power_vs_rate
uint32 trpc_get_default_power_idx(Eq_2 ra, uint32 a0, int32 a1, ptr32 fflags, ptr32 frm, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	uint32 a4_18 = a0 & 0x00FF;
	if (a0 > 0x02)
		a4_18 = 0x02;
	int32 a5_10 = 0x03;
	if (a0 != 0x00)
		a5_10 = 0x07;
	if (a5_10 < a1)
		a1 = a5_10;
	int32 a2_28 = (int32) (a4_18 << 0x03)->a4200CEFC[a1];
	struct Eq_64992 * a1_29 = a1 & 0x00FF;
	ptr32 a1_44;
	ptr32 a3_46;
	ptr32 a4_47;
	ptr32 a5_48;
	uint32 a0_43 = trpc_get_power_idx(ra, a4_18, a1_29, a2_28, fflags, frm, out a1_44, out a3_46, out a4_47, out a5_48);
	a1Out = a1_44;
	a3Out = a3_46;
	a4Out = a4_47;
	a5Out = a5_48;
	return a0_43;
}

// 23014C70: void trpc_update_vs_channel(Register int32 a0)
// Called from:
//      phy_hw_set_channel
void trpc_update_vs_channel(int32 a0)
{
	g_w4201D148 = (word16) a0;
	g_b4201D144 = (byte) rf_pri_get_txgain_max();
	g_b4201D145 = (byte) rf_pri_get_txgain_min();
}

