pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23014C9A: void trpc_update_vs_temperature(Register int32 a0)
// Called from:
//      phy_tcal_txpwr
void trpc_update_vs_temperature(int32 a0)
{
	g_t4201D14A = (byte) a0;
	g_b4201D144 = (byte) rf_pri_get_txgain_max();
	g_b4201D145 = (byte) rf_pri_get_txgain_min();
}

// 23014CC4: Register Eq_2 phy_tcal_reset(Register Eq_2 ra)
// Called from:
//      phy_init
Eq_2 phy_tcal_reset(Eq_2 ra)
{
	word32 t1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	Eq_2 ra_19 = memset(ra, 0x42011A1C, 0x00, 56, out t1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42);
	((union Eq_2 *) 0x2D)->u0 = 0x42011A1C;
	((union Eq_2 *) 0x31)->u0 = 0x42011A1C;
	((union Eq_2 *) 0x35)->u0 = 0x42011A1C;
	((union Eq_2 *) 0x39)->u0 = 0x42011A1C;
	g_w42011A1C = 0x19;
	g_b42011A50 = 0x01;
	return ra_19;
}

// 23014CFC: void phy_tcal_start()
// Called from:
//      phy_init
void phy_tcal_start()
{
	g_b42012A50 = 0x01;
}

// 23014D08: void phy_tcal_txpwr(Register (ptr32 word32) a0, Register (ptr32 word32) a1, Register (ptr32 word32) a3)
// Called from:
//      phy_tcal_callback
void phy_tcal_txpwr(word32 * a0, word32 * a1, word32 * a3)
{
	rf_pri_tx_gain_comp(a0, a1, a3);
	int32 a0_23 = (int32) (byte) a0;
	trpc_update_vs_temperature(a0_23);
}

// 23014D24: Register (ptr32 Eq_62695) phy_tcal_handle(Register (ptr32 Eq_62695) s0, Register (ptr32 word32) a1, Register (ptr32 word32) a3, Register ptr32 mstatus, Register out Eq_63229 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      phy_tcal_callback
struct Eq_62695 * phy_tcal_handle(struct Eq_62695 * s0, word32 * a1, word32 * a3, ptr32 mstatus, union Eq_63229 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	ptr32 a5_14;
	int16 wLoc12_95 = SLICE(s0, int16, 16);
	if (hal_get_temperature(fp + ~0x11) != 0x00)
	{
		phy_tcal_txpwr((int32) wLoc12_95, a1, a3);
		int32 a5_26 = (word32) wLoc12_95;
		if ((int32) (word16) a5_26 > 0x007D)
			a5_26 = 0x007D;
		int32 a4_32 = a5_26 << 0x10;
		a4 = a4_32 >> 16;
		if (a4_32 >> 16 < -40)
			a5_26 = -40;
		int32 s2_37 = a5_26 << 0x10;
		int16 wLoc12_96 = (word16) a5_26;
		int32 a5_43 = (int32) (word16) (a5_26 + ~0x18);
		if (a5_43 <= 0x00)
			s0 = a5_43 + ~0x05 >> 0x08;
		else
			s0 = (int32) (word16) (0x00 - (a5_43 + 0x06 >> 8));
		if (s0 != g_ptr42011A48)
		{
			__csrrc(mstatus, 0x08);
			a4 = phy_config_rxgain(s0);
			__csrrs(mstatus, 0x08);
			g_dw42011A38 = s2_37 >> 0x10;
			s0->dw002C = 0x42011A1C;
		}
		a5_14 = (word32) wLoc12_96;
		g_w42011A1C = (word16) a5_14;
	}
	a4Out = a4;
	a5Out = a5_14;
	s4Out = dwArg04;
	return s0;
}

// 23014DD4: Register (ptr32 Eq_62695) phy_tcal_callback(Register (ptr32 Eq_62695) s0, Register int32 a0, Register (ptr32 word32) a1, Register (ptr32 word32) a3, Register ptr32 mstatus, Register out ptr32 a4Out, Register out Eq_65324 a5Out, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_start
struct Eq_62695 * phy_tcal_callback(struct Eq_62695 * s0, int32 a0, word32 * a1, word32 * a3, ptr32 mstatus, ptr32 & a4Out, union Eq_65324 & a5Out, ptr32 & s4Out)
{
	hal_set_temperature(a0);
	Eq_65324 a5_9 = (word32) g_b42011A50;
	if (a5_9 == 0x00)
	{
		a4Out = a4;
		a5Out = a5_9;
		s4Out = s4;
		return s0;
	}
	else
	{
		Eq_65324 a5_19;
		ptr32 s4_21;
		ptr32 a4_27;
		struct Eq_62695 * s0_29 = phy_tcal_handle(s0, a1, a3, mstatus, out a4_27, out a5_19, out s4_21);
		a4Out = a4_27;
		a5Out = a5_19;
		s4Out = s4_21;
		return s0_29;
	}
}

// 23014DF4: Register word32 rf_fsm_ctrl_en_setf(Register ui32 a0, Register (ptr32 Eq_61530) a5, Register out Eq_65350 a5Out)
// Called from:
//      rf_set_channel
//      rfc_init
//      cmd_wifi_coex_rf_force_on
word32 rf_fsm_ctrl_en_setf(ui32 a0, struct Eq_61530 * a5, union Eq_65350 & a5Out)
{
	word32 a4_5 = a5->dw0004;
	(a0 << 1 | a5 & ~0x02)->dw0004 = a4_5;
	a5Out = a5 & ~0x02;
	return a4_5;
}

// 23014E04: Register ui32 rf_fsm_st_dbg_en_setf(Register ui32 a0)
// Called from:
//      rf_set_channel
//      rfc_init
ui32 rf_fsm_st_dbg_en_setf(ui32 a0)
{
	int32 a5_5 = *(int32 *) 0x4000126C;
	*(int32 *) 0x4000126C = a0 << 3 | a5_5 & ~0x08;
	return a5_5 & ~0x08;
}

// 23014E18: void rf_tx_dvga_gain_qdb_gc3_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc3_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 << 24 & 0x7F000000 | *((int32 *) 0x40001630) & ~0x7F000000;
}

// 23014E38: void rf_tx_dvga_gain_qdb_gc2_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc2_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 << 16 & 0x007F0000 | *((int32 *) 0x40001630) & ~0x007F0000;
}

// 23014E58: void rf_tx_dvga_gain_qdb_gc1_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc1_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 << 8 & 0x07FFFF00 | *((int32 *) 0x40001630) & 0xF80000FF;
}

// 23014E7A: void rf_tx_dvga_gain_qdb_gc0_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc0_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 & 0x007F | *((int32 *) 0x40001630) & -0x0080;
}

// 23014E92: void rf_tx_dvga_gain_qdb_gc7_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc7_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 << 24 & 0x7F000000 | *((int32 *) 0x40001634) & ~0x7F000000;
}

// 23014EB2: void rf_tx_dvga_gain_qdb_gc6_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc6_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 << 16 & 0x007F0000 | *((int32 *) 0x40001634) & ~0x007F0000;
}

// 23014ED2: void rf_tx_dvga_gain_qdb_gc5_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc5_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 << 8 & 0x07FFFF00 | *((int32 *) 0x40001634) & 0xF80000FF;
}

// 23014EF4: void rf_tx_dvga_gain_qdb_gc4_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc4_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 & 0x007F | *((int32 *) 0x40001634) & -0x0080;
}

// 23014F0C: void rf_tx_dvga_gain_qdb_gc11_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc11_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 << 24 & 0x7F000000 | *((int32 *) 0x40001638) & ~0x7F000000;
}

// 23014F2C: void rf_tx_dvga_gain_qdb_gc10_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc10_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 << 16 & 0x007F0000 | *((int32 *) 0x40001638) & ~0x007F0000;
}

// 23014F4C: void rf_tx_dvga_gain_qdb_gc9_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc9_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 << 8 & 0x07FFFF00 | *((int32 *) 0x40001638) & 0xF80000FF;
}

// 23014F6E: void rf_tx_dvga_gain_qdb_gc8_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc8_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 & 0x007F | *((int32 *) 0x40001638) & -0x0080;
}

// 23014F86: Register ui32 rf_tx_dvga_gain_qdb_gc15_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
ui32 rf_tx_dvga_gain_qdb_gc15_setf(int32 a0)
{
	int32 a5_5 = *(int32 *) 0x4000163C;
	*(int32 *) 0x4000163C = a0 << 24 & 0x7F000000 | a5_5 & ~0x7F000000;
	return a5_5 & ~0x7F000000;
}

