pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23015814: Register ui32 rfc_get_power_level(Register ui32 a0, Register Eq_2 a1, Register Eq_2 a3, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      phy_get_rf_gain_idx
ui32 rfc_get_power_level(ui32 a0, Eq_2 a1, Eq_2 a3, ptr32 & a3Out, ptr32 & a4Out)
{
	word32 a1_10 = 0x00;
	if (a0 != 0x00)
	{
		a1_10 = 0x01;
		if (a0 != 0x01)
			a1_10 = 0x02;
	}
	ptr32 a3_21;
	ptr32 a4_22;
	ui32 a0_28 = rf_pri_get_txgain_index(a1, a1_10, a3, out a3_21, out a4_22) << 2;
	a3Out = a3_21;
	a4Out = a4_22;
	return a0_28;
}

// 23015836: void rfc_apply_tx_dvga(Register (ptr32 Eq_66826) a0)
// Called from:
//      rf_pri_tx_gain_comp
void rfc_apply_tx_dvga(struct Eq_66826 * a0)
{
	rf_tx_dvga_gain_qdb_gc0_setf((int32) a0->b0000);
	rf_tx_dvga_gain_qdb_gc1_setf((int32) a0->b0001);
	rf_tx_dvga_gain_qdb_gc2_setf((int32) a0->b0002);
	rf_tx_dvga_gain_qdb_gc3_setf((int32) a0->b0003);
	rf_tx_dvga_gain_qdb_gc4_setf((int32) a0->b0004);
	rf_tx_dvga_gain_qdb_gc5_setf((int32) a0->b0005);
	rf_tx_dvga_gain_qdb_gc6_setf((int32) a0->b0006);
	rf_tx_dvga_gain_qdb_gc7_setf((int32) a0->b0007);
	rf_tx_dvga_gain_qdb_gc8_setf((int32) a0->b0008);
	rf_tx_dvga_gain_qdb_gc9_setf((int32) a0->b0009);
	rf_tx_dvga_gain_qdb_gc10_setf((int32) a0->b000A);
	rf_tx_dvga_gain_qdb_gc11_setf((int32) a0->b000B);
	rf_tx_dvga_gain_qdb_gc12_setf((int32) a0->b000C);
	rf_tx_dvga_gain_qdb_gc13_setf((int32) a0->b000D);
	rf_tx_dvga_gain_qdb_gc14_setf((int32) a0->b000E);
	int32 a0_81 = (int32) a0->b000F;
	rf_tx_dvga_gain_qdb_gc15_setf(a0_81);
}

// 230158C4: Register word32 rfc_apply_tx_power_offset(Register int32 a0, Register ptr32 a1, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack (ptr32 Eq_62676) dwArg84, Stack (ptr32 Eq_63365) dwArgA4, Stack word32 dwArg0198, Register out Eq_63498 s2Out, Register out ptr32 s3Out)
// Called from:
//      phy_hw_set_channel
word32 rfc_apply_tx_power_offset(int32 a0, ptr32 a1, Eq_2 dwArg44, Eq_2 dwArg64, struct Eq_62676 * dwArg84, struct Eq_63365 * dwArgA4, word32 dwArg0198, union Eq_63498 & s2Out, ptr32 & s3Out)
{
	rf_pri_update_tx_power_offset(a0, a1);
	word32 a5_390;
	int32 a0_54 = rf_pri_query_txgain_table(0x00, fp + -56, fp + -52, out a5_390);
	int32 a5_57 = *(int32 *) 0x40001640;
	dwArgA4->dw0640 = a5_57 & 0x07 | a5_57 & -8;
	rf_tx_dvga_gain_qdb_gc0_setf(a0_54);
	word32 a5_391;
	int32 a0_76 = rf_pri_query_txgain_table(0x01, fp + -56, fp + -52, out a5_391);
	ui32 a5_79 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_79 << 4 & 112 | a5_79 & -113;
	rf_tx_dvga_gain_qdb_gc1_setf(a0_76);
	word32 a5_392;
	int32 a0_100 = rf_pri_query_txgain_table(0x02, fp + -56, fp + -52, out a5_392);
	ui32 a5_103 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_103 << 8 & 0x0700 | a5_103 & -0x0701;
	rf_tx_dvga_gain_qdb_gc2_setf(a0_100);
	word32 a5_393;
	int32 a0_121 = rf_pri_query_txgain_table(0x03, fp + -56, fp + -52, out a5_393);
	ui32 a5_124 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_124 << 0x0C & 0x07000000 | a5_124 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc3_setf(a0_121);
	word32 a5_394;
	int32 a0_139 = rf_pri_query_txgain_table(0x04, fp + -56, fp + -52, out a5_394);
	ui32 a5_142 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_142 << 16 & 0x00070000 | a5_142 & ~0x00070000;
	rf_tx_dvga_gain_qdb_gc4_setf(a0_139);
	word32 a5_395;
	int32 a0_156 = rf_pri_query_txgain_table(0x05, fp + -56, fp + -52, out a5_395);
	ui32 a5_159 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_159 << 20 & 0x00700000 | a5_159 & ~0x00700000;
	rf_tx_dvga_gain_qdb_gc5_setf(a0_156);
	word32 a5_396;
	int32 a0_174 = rf_pri_query_txgain_table(0x06, fp + -56, fp + -52, out a5_396);
	ui32 a5_177 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_177 << 24 & 0x07000000 | a5_177 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc6_setf(a0_174);
	ui32 a5_194;
	int32 a0_192 = rf_pri_query_txgain_table(0x07, fp + -56, fp + -52, out a5_194);
	dwArgA4->dw0640 = a5_194 << 28 & 0x70000000 | dwArgA4->dw0640 & ~0x70000000;
	rf_tx_dvga_gain_qdb_gc7_setf(a0_192);
	word32 a5_397;
	int32 a0_210 = rf_pri_query_txgain_table(0x08, fp + -56, fp + -52, out a5_397);
	int32 a5_213 = dwArgA4->dw0644;
	dwArgA4->dw0644 = a5_213 & 0x07 | a5_213 & -8;
	rf_tx_dvga_gain_qdb_gc8_setf(a0_210);
	word32 a5_398;
	int32 a0_226 = rf_pri_query_txgain_table(0x09, fp + -56, fp + -52, out a5_398);
	int32 a2_229 = dwArgA4->dw0644;
	*((word32) dwArg44 + 0x0644) = a2_229 << 4 & 112 | a2_229 & -113;
	rf_tx_dvga_gain_qdb_gc9_setf(a0_226);
	word32 a5_399;
	int32 a0_244 = rf_pri_query_txgain_table(0x0A, fp + -56, fp + -52, out a5_399);
	ui32 a2_247 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg44 + 0x0644) = a2_247 << 8 & 0x0700 | a2_247 & -0x0701;
	rf_tx_dvga_gain_qdb_gc10_setf(a0_244);
	word32 a5_400;
	int32 a0_262 = rf_pri_query_txgain_table(11, fp + -56, fp + -52, out a5_400);
	ui32 a2_265 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg44 + 0x0644) = a2_265 << 0x0C & 0x07000000 | a2_265 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc11_setf(a0_262);
	word32 a5_401;
	int32 a0_280 = rf_pri_query_txgain_table(0x0C, fp + -56, fp + -52, out a5_401);
	ui32 a2_283 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg44 + 0x0644) = a2_283 << 16 & 0x00070000 | a2_283 & ~0x00070000;
	rf_tx_dvga_gain_qdb_gc12_setf(a0_280);
	word32 a5_402;
	int32 a0_297 = rf_pri_query_txgain_table(0x0D, fp + -56, fp + -52, out a5_402);
	ui32 a3_300 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg64 + 0x0644) = a3_300 << 20 & 0x00700000 | a3_300 & ~0x00700000;
	rf_tx_dvga_gain_qdb_gc13_setf(a0_297);
	word32 a5_403;
	int32 a0_315 = rf_pri_query_txgain_table(0x0E, fp + -56, fp + -52, out a5_403);
	ui32 a4_318 = *((word32) dwArg64 + 0x0644);
	dwArg84->dw0644 = a4_318 << 24 & 0x07000000 | a4_318 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc14_setf(a0_315);
	word32 a5_404;
	int32 a0_333 = rf_pri_query_txgain_table(0x0F, fp + -56, fp + -52, out a5_404);
	ui32 a5_336 = dwArg84->dw0644;
	dwArgA4->dw0644 = a5_336 << 28 & 0x70000000 | a5_336 & ~0x70000000;
	rf_tx_dvga_gain_qdb_gc15_setf(a0_333);
	0x00 = dwArg0198;
	s2Out = a5_336 & ~0x70000000;
	s3Out = 0x07000000;
	return 0x70000000;
}

// 23015B8E: Register int32 rf_pri_set_gain_table_regs()
// Called from:
//      rf_pri_update_tx_power_offset
//      rf_pri_init
int32 rf_pri_set_gain_table_regs()
{
	*(int32 *) 0x40001118 = ((g_dw42011CCC << 24 | (g_dw42011CD0 << 16 | (g_dw42011CFC << 0x0E | (g_dw42011D00 << 0x0C | (g_dw42011D04 << 8 | (*((int32 *) 0x40001118) & ~0x1F | g_dw42011D08) & -0x0701) & ~0x03000000) & ~0x0C000000) & ~0x001F0000) & ~0x07000000) & ~0x30000000 | g_dw42011CC8 << 28) & 0x3FFFFFFF | g_dw42011CC4 << 30;
	struct Eq_67404 * a3_83 = (g_dw42011C58 << 28 | (g_dw42011C5C << 24 | (g_dw42011C60 << 16 | (g_dw42011C8C << 0x0E | (g_dw42011C90 << 0x0C | (g_dw42011C94 << 8 | (*((struct Eq_67404 **) 0x4000111C) & ~0x1F | g_dw42011C98) & -0x0701) & ~0x03000000) & ~0x0C000000) & ~0x001F0000) & ~0x07000000) & ~0x30000000) & 0x3FFFFFFF | g_dw42011C54 << 30;
	*(struct Eq_67404 **) 0x4000111C = a3_83;
	struct Eq_67463 * a5_87 = a3_83->ptr0070;
	struct Eq_67467 * a2_102 = a5_87->dw00A8 << 0x0E | (a5_87->dw00AC << 0x0C | (a5_87->dw00B0 << 8 | (*((int32 *) 0x40001120) & ~0x1F | g_dw42011C28) & -0x0701) & ~0x03000000) & ~0x0C000000;
	struct Eq_67499 * a5_104 = a2_102->ptr007C;
	ui32 a6_110 = a5_104->dw0078 << 24 | (a2_102 << 16 | a2_102 & ~0x001F0000) & ~0x07000000;
	*(int32 *) 0x40001120 = a3_83 << 30 | (a5_104->dw0074 << 28 | a6_110 & ~0x30000000) & 0x3FFFFFFF;
	ui32 a1_126 = (*(int32 *) 0x40001124 & -32 | 0xFFE10000) & -0x0701 | 0xE1000000;
	struct Eq_67543 * a3_141 = (a3_83 << 46 | ((a1_126 & ~0x03000000) << 0x0E | (a1_126 & ~0x03000000) & ~0x0C000000) & ~0x001F0000) & ~0x07000000 | (a6_110 & ~0x30000000) << 24;
	int32 a3_149 = (a3_141 << 28 | a3_141 & ~0x30000000) & 0x3FFFFFFF | *a3_141->ptr0004 << 30;
	*(int32 *) 0x40001124 = a3_149;
	return a3_149;
}

// 23015D58: Register Eq_2 rf_pri_manu_pu(Register up32 a0, Register (ptr32 Eq_67584) a4, Register out Eq_2 a5Out)
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
Eq_2 rf_pri_manu_pu(up32 a0, struct Eq_67584 * a4, union Eq_2 & a5Out)
{
	Eq_2 a5_11;
	Eq_2 a3_21;
	ui32 a4_14;
	word32 a3_15;
	struct Eq_67590 * a5_5 = a4->ptr0004;
	(a4 & ~0x02)->ptr0004 = a5_5;
	a5_5->dw000C = 0x00;
	if (a0 != 0x05)
	{
		if (a0 > 0x05)
		{
			if (a0 > 0x07)
				goto l23015D76;
			a5_11 = *(union Eq_2 *) 55;
			a4_14 = 0x07;
			a3_21.u0 = 0x00F00000;
l23015DAA:
			(a4_14 | a3_21)->t0030 = a5_11;
			a5Out = a5_11;
			return a3_21;
		}
		if (a0 != 0x04)
		{
l23015D76:
			Eq_2 a3_39 = a5_5->t0030;
			Eq_2 a5_45 = a5_5 & 0x2DF0FEFF | 0x25F06E00;
			*((word32) a5_45 + 48) = a3_39;
			a5Out = a5_45;
			return a3_39;
		}
		a5_11 = *(union Eq_2 *) 0x34;
		a4_14 = 0x04;
		a3_15 = 0x24F87000;
	}
	else
	{
		a5_11 = *(union Eq_2 *) 0x35;
		a4_14 = 0x05;
		a3_15 = 0xC6FF7000;
	}
	a3_21 = a3_15 + -0x0800;
	goto l23015DAA;
}

// 23015DD8: Register int32 rf_pri_save_state_for_cal(Register (ptr32 Eq_67642) a3)
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
int32 rf_pri_save_state_for_cal(struct Eq_67642 * a3)
{
	g_ptr4200ED10 = a3;
	g_ptr4200ED1C = a3;
	g_ptr4200ED18 = a3;
	struct Eq_67649 * a5_14 = a3->ptr0030;
	g_ptr4200ED08 = a3;
	g_dw4200ED00 = a5_14->dw00B8;
	g_dw4200ED24 = a5_14->dw00C0;
	g_dw4200ED28 = a5_14->dw00C4;
	g_dw4200ED0C = a5_14->dw0084;
	g_dw4200ECEC = a5_14->dw008C;
	g_dw4200ECF0 = a5_14->dw0600;
	g_dw4200ECF4 = a5_14->dw060C;
	g_dw4200ECF8 = a5_14->dw0618;
	struct Eq_67695 * a3_41 = a5_14->ptr061C;
	g_ptr4200ECFC = a3_41;
	struct Eq_67701 * a5_44 = a3_41->ptr0048;
	g_ptr4200ED4C = a3_41;
	g_dw4200ED2C = a5_44->dw020C;
	g_dw4200ED30 = a5_44->dw0214;
	g_dw4200ED34 = a5_44->dw0218;
	g_dw4200ED38 = a5_44->dw023C;
	g_dw4200ED3C = a5_44->dw0240;
	g_dw4200ED40 = a5_44->dw0244;
	struct Eq_67737 * a3_65 = a5_44->ptr00F0;
	g_ptr4200ED14 = a3_65;
	g_ptr4200ED04 = a3_65;
	struct Eq_67745 * a5_71 = a3_65->ptr0058;
	g_ptr4200ED48 = a3_65;
	struct Eq_67751 * a3_74 = a5_71->ptr0220;
	g_ptr4200ED20 = a3_74;
	struct Eq_67757 * a5_77 = a3_74->ptr0070;
	g_ptr4200ED44 = a3_74;
	int32 a4_80 = a5_77->dw00A4;
	g_dw4200ED50 = a4_80;
	return a4_80;
}

// 23015F06: Register word32 rf_pri_restore_state_for_cal()
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
word32 rf_pri_restore_state_for_cal()
{
	g_ptr4200DD10->dw0004 = 0x40001000;
	g_ptr4200DD1C->dw000C = 0x40001000;
	g_ptr4200DD18->dw001C = 0x40001000;
	g_ptr4200DD08->dw0030 = 0x40001000;
	*(int32 *) 0x400010B8 = g_dw4200DD00;
	*(int32 *) 0x400010C0 = g_dw4200DD24;
	*(int32 *) 0x400010C4 = g_dw4200DD28;
	*(int32 *) 0x40001084 = g_dw4200DD0C;
	*(int32 *) 0x4000108C = g_dw4200DCEC;
	*(int32 *) 0x40001600 = g_dw4200DCF0;
	*(int32 *) 0x4000160C = g_dw4200DCF4;
	*(ptr32 **) 0x40001618 = g_ptr4200DCF8;
	*(union Eq_67827 *) 0x4000161C = g_t4200DCFC;
	g_ptr4200DD4C->dw0048 = 0x40001000;
	*(int32 *) 0x4000120C = g_dw4200DD2C;
	*(int32 *) 0x40001214 = g_dw4200DD30;
	*(union Eq_67845 *) 0x40001218 = g_t4200DD34;
	*(int32 *) 0x4000123C = g_dw4200DD38;
	*(int32 *) 0x40001240 = g_dw4200DD3C;
	*(int32 *) 0x40001244 = g_dw4200DD40;
	*(int32 *) 0x400010F0 = g_dw4200DD14;
	g_ptr4200DD04->dw0064 = 0x40001000;
	g_ptr4200DD48->dw0058 = 0x40001000;
	*(int32 *) 0x40001220 = g_dw4200DD20;
	g_ptr4200DD44->dw0070 = 0x40001000;
	*(int32 *) 0x400010A4 = g_dw4200DD50;
	return 0x40001000;
}

