pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23016034: void rf_pri_singen_start()
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_txcal
void rf_pri_singen_start()
{
	*(int32 *) 0x4000120C &= 0x7FFFFFFF;
	*(int32 *) 0x4000120C |= 0x80000000;
}

// 23016056: Register ui32 rf_pri_pm_pwr(Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_67906 a5Out)
// Called from:
//      rf_pri_txcal_search_core
//      rf_pri_rccal_iq
ui32 rf_pri_pm_pwr(ptr32 & a2Out, ptr32 & a3Out, union Eq_67906 & a5Out)
{
	*(ptr32 **) 0x40001618 &= ~0x20100000;
	*(ptr32 **) 0x40001618 |= 0x20100000;
	do
	{
		ptr32 * a4_16 = *(ptr32 **) 0x40001618;
	} while (a4_16 << 0x03 >= 0x00);
	int32 a5_25 = *(int32 *) 0x40001624 << 7 >> 16;
	ptr32 a2_21 = *a4_16;
	int32 a0_24 = *(int32 *) 0x40001620 << 7 >> 16;
	*(a4_16 & ~0x20100000) = a2_21;
	a2Out = a2_21;
	a3Out = ~0x20100000;
	a5Out = a5_25 * 0x02;
	return a0_24 * 0x02 + a5_25 * 0x02;
}

// 230160B0: Register word32 rf_pri_start_txdfe(Register out ptr32 a5Out)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_txcal
//      rf_pri_init
word32 rf_pri_start_txdfe(ptr32 & a5Out)
{
	*(int32 *) 0x40001220 &= -0x0181;
	*(int32 *) 0x40001220 = *(int32 *) 0x40001220 & ~0x01FFF800 | 0x01000082;
	*(int32 *) 0x40001220 |= 0x0100;
	a5Out = 0x40001000;
	return 0x01000082;
}

// 230160E6: Register int32 rf_pri_pm_pwr_avg(Register int32 a0, Register int32 a1, Register out ptr32 a3Out, Register out (ptr32 Eq_67983) a5Out)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_roscal_iq.isra.3
//      rf_pri_txcal
int32 rf_pri_pm_pwr_avg(int32 a0, int32 a1, ptr32 & a3Out, struct Eq_67983 & a5Out)
{
	*(ptr32 **) 0x40001618 &= ~0x20100000;
	*(union Eq_67827 *) 0x4000161C = a1 << 16 | (word32) (*((union Eq_67827 *) 0x4000161C));
	*(ptr32 **) 0x40001618 |= 0x20000000;
	do
		;
	while (*(ptr32 **) 0x40001618 << 0x03 >= 0x00);
	int32 a0_27;
	if (a0 != 0x00)
		a0_27 = *(int32 *) 0x40001620;
	else
		a0_27 = *(int32 *) 0x40001624;
	ptr32 * a5_31 = *(ptr32 **) 0x40001618;
	*(ptr32 **) 0x40001618 = a5_31 & ~0x20100000;
	a3Out = 0x40001000;
	a5Out = a5_31 & ~0x20100000;
	return (int32) (word25) a0_27;
}

// 2301614A: Register int32 rf_pri_txcal_config_hw(Register ui32 a2, Register out ptr32 a5Out)
// Called from:
//      rf_pri_txcal
//      rf_pri_init
int32 rf_pri_txcal_config_hw(ui32 a2, ptr32 & a5Out)
{
	uint32 a2_14 = a2 & 63 | *((int32 *) 0x40001180) & -64;
	ui32 a2_22 = (a2_14 >> 6 & 63) << 8 | a2_14 & 0xFC0000FF;
	int32 a2_35 = ((a2_22 & ~0x003F0000) >> 6 & 63) << 24 | (a2_22 & ~0x003F0000) & ~0x3F000000;
	*(int32 *) 0x40001180 = a2_35;
	struct Eq_68064 * a2_42 = a2_35 & 63 | *((int32 *) 0x40001184) & -64;
	struct Eq_68072 * a1_44 = a2_42->ptr0078;
	*(int32 *) 0x40001184 = (a1_44->t0080 >> 6 & 63) << 24 | (((a2_42 >> 6 & 63) << 8 | a2_42 & 0xFC0000FF) & ~0x003F0000 | (a1_44->t0080 & 63) << 16) & ~0x3F000000;
	struct Eq_68109 * t1_61 = g_ptr4200D92C;
	*(int32 *) 0x40001188 = (t1_61->t0090 >> 6 & 63) << 24 | (((t1_61->t0088 >> 6 & 63) << 8 | (t1_61->t0088 & 63 | *((int32 *) 0x40001188) & -64) & 0xFC0000FF) & ~0x003F0000 | (t1_61->t0090 & 63) << 16) & ~0x3F000000;
	struct Eq_68109 * a1_86 = g_ptr4200D92C;
	*(int32 *) 0x4000118C = (a1_86->t00A0 >> 6 & 63) << 24 | (((a1_86->t0098 >> 6 & 63) << 8 | (a1_86->t0098 & 63 | *((int32 *) 0x4000118C) & -64) & 0xFC0000FF) & ~0x003F0000 | (a1_86->t00A0 & 63) << 16) & ~0x3F000000;
	Eq_68207 a3_110 = *(union Eq_68207 *) 0x40001190;
	*(union Eq_68207 *) 0x40001190 = ((a3_110 >> 0x0C & 0x07FF) << 16 | a3_110 & ~0x07FF0000) & -0x0400 | (a3_110 & ~0x07FF0000) & 0x03FF;
	Eq_68227 a3_124 = *(union Eq_68227 *) 0x40001194;
	*(union Eq_68227 *) 0x40001194 = ((a3_124 >> 0x0C & 0x07FF) << 16 | a3_124 & ~0x07FF0000) & -0x0400 | (a3_124 & ~0x07FF0000) & 0x03FF;
	Eq_68247 a3_137 = *(union Eq_68247 *) 0x40001198;
	*(union Eq_68247 *) 0x40001198 = ((a3_137 >> 0x0C & 0x07FF) << 16 | a3_137 & ~0x07FF0000) & -0x0400 | (a3_137 & ~0x07FF0000) & 0x03FF;
	struct Eq_68109 * a0_151 = g_ptr4200D92C;
	*(int32 *) 0x4000119C = ((a0_151->t0080 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x4000119C) & ~0x07FF0000) & -0x0400 | a0_151->dw0084 & 0x03FF;
	struct Eq_68109 * a0_164 = g_ptr4200D92C;
	*(int32 *) 0x400011A0 = ((a0_164->t0088 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011A0) & ~0x07FF0000) & -0x0400 | a0_164->dw008C & 0x03FF;
	struct Eq_68109 * a0_177 = g_ptr4200D92C;
	*(int32 *) 0x400011A4 = ((a0_177->t0090 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011A4) & ~0x07FF0000) & -0x0400 | a0_177->dw0094 & 0x03FF;
	struct Eq_68109 * a0_190 = g_ptr4200D92C;
	*(int32 *) 0x400011A8 = ((a0_190->t0098 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011A8) & ~0x07FF0000) & -0x0400 | a0_190->dw009C & 0x03FF;
	struct Eq_68109 * a3_204 = g_ptr4200D92C;
	int32 a4_213 = ((a3_204->t00A0 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011AC) & ~0x07FF0000) & -0x0400 | a3_204->dw00A4 & 0x03FF;
	*(int32 *) 0x400011AC = a4_213;
	a5Out = 0x40001000;
	return a4_213;
}

// 230163EC: Register Eq_2 rf_pri_fcal_meas(Register Eq_2 ra, Register Eq_68405 s0, Register Eq_68405 a0, Register out Eq_68407 a0Out, Register out Eq_68408 a3Out)
// Called from:
//      rf_pri_fcal
Eq_2 rf_pri_fcal_meas(Eq_2 ra, Eq_68405 s0, Eq_68405 a0, union Eq_68407 & a0Out, union Eq_68408 & a3Out)
{
	int32 a5_9 = *(int32 *) 0x400010A0;
	*(int32 *) 0x400010A0 = a0 | a5_9 & -0x0100;
	struct Eq_68417 * s0_17;
	Eq_2 ra_18;
	g_t4200C506();
	s0_17->dw00AC |= 16;
	do
	{
		Eq_68408 a3_30 = *(union Eq_68408 *) 0x400010AC;
	} while (a3_30 << 11 >= 0x00);
	Eq_68407 a0_35 = *(union Eq_68437 *) 0x400010A8 >> 16;
	*(*(union Eq_68408 *) 0x400010AC & ~0x10) = 0x400010AC;
	a0Out = a0_35;
	a3Out = a3_30;
	return ra_18;
}

// 23016446: Register word32 rf_pri_rccal_config.part.0(Register Eq_68449 a0)
// Called from:
//      rf_pri_rccal_config
//      rf_pri_rccal
word32 rf_pri_rccal_config.part.0(Eq_68449 a0)
{
	*(int32 *) 0x40001080 = a0 << 8 | (a0 << 0x18 | *((int32 *) 0x40001080) & ~0x3F000000) & 0xFC0000FF;
	return 0x40001000;
}

// 2301646E: Register word32 rf_pri_rccal_config(Register ptr32 a0, Register Eq_68449 a1)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_rccal
word32 rf_pri_rccal_config(ptr32 a0, Eq_68449 a1)
{
	if (a0 != 0x00)
		return rf_pri_rccal_config.part.0(a1);
	*(int32 *) 0x40001080 = (a1 << 0x10 | *((int32 *) 0x40001080) & ~0x003F0000) & -64 | a1;
	return 0x40001000;
}

// 23016498: Register Eq_2 rf_pri_txcal_config(Register word32 a0, Register Eq_2 a1, Register out Eq_2 a3Out, Register out ptr32 a4Out)
// Called from:
//      rf_pri_txcal_search_core
//      rf_pri_txcal
Eq_2 rf_pri_txcal_config(word32 a0, Eq_2 a1, union Eq_2 & a3Out, ptr32 & a4Out)
{
	if (a0 == 0x02)
	{
		ui32 a1_39 = a1 << 0x0C | *((int32 *) 0x40001600) & ~0x007FF000;
		*(int32 *) 0x40001600 = a1_39 | 0x00800000;
		a3Out.u0 = 0x40001000;
		a4Out = ~0x007FF000;
		return a1_39 | 0x00800000;
	}
	if (a0 == 0x03)
	{
		if (a1 < 0x00)
			a1 = (word32) a1 + 0x0400;
		ui32 a1_30 = a1 | *((int32 *) 0x40001600) & -0x0400;
		*(int32 *) 0x40001600 = a1_30 | 0x0400;
		a3Out = a3;
		a4Out = 0x40001000;
		return a1_30 | 0x0400;
	}
	ui32 a5_11;
	ui32 a1_13;
	if (a0 == 0x00)
	{
		a3 = *(union Eq_2 *) 115;
		a4 = ~0x3F000000;
		a5_11 = 0x03;
		a1_13 = a1 << 24;
	}
	else
	{
		if (a0 != 0x01)
			goto l230164FA;
		a3 = *(union Eq_2 *) 113;
		a4 = ~0x003F0000;
		a5_11 = 0x01;
		a1_13 = a1 << 16;
	}
	a1 = a1_13 | a5_11;
	*((word32) a1 + 112) = a3;
l230164FA:
	a3Out = a3;
	a4Out = a4;
	return a1;
}

// 23016514: Register word32 rf_pri_txcal_search_core(Register (ptr32 Eq_68550) s0, Register ui32 s1, Register word32 a0, Register Eq_2 a1, Register int32 a2, Register word32 s4, Register word32 s5, Register word32 s6, Register word32 s7, Register word32 s8, Register Eq_2 s9, Register int32 s11, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_68569 s6Out, Register out Eq_68570 s7Out, Register out ptr32 s8Out, Register out Eq_68570 s9Out, Register out Eq_2 s11Out)
// Called from:
//      rf_pri_txcal
word32 rf_pri_txcal_search_core(struct Eq_68550 * s0, ui32 s1, word32 a0, Eq_2 a1, int32 a2, word32 s4, word32 s5, word32 s6, word32 s7, word32 s8, Eq_2 s9, int32 s11, Eq_2 dwArg010C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_68569 & s6Out, union Eq_68570 & s7Out, ptr32 & s8Out, union Eq_68570 & s9Out, union Eq_2 & s11Out)
{
	word32 a3_40;
	ui32 a3_46;
	word32 s10_185;
	ptr32 s2_203;
	ptr32 s3_177;
	g_t4200C506();
	*(ptr32 **) 0x40001618 = a3_46 << 0x0A | *((ptr32 **) 0x40001618) & 0xFFF00000;
	word32 a3_393;
	word32 a5_394;
	word32 a2_164;
	Eq_2 s11_159 = rf_pri_pm_pwr(out a2_164, out a3_393, out a5_394);
	ptr32 s4_179 = 0x01;
	ptr32 s5_180 = 0x02;
	Eq_68569 s6_181 = -0x0200;
	Eq_68570 s7_182 = 511;
	Eq_68570 s8_103 = 0x07FF;
	Eq_68570 s9_108 = 63;
	do
	{
		Eq_68569 s0_101 = s2_203 - s10_185;
		Eq_68570 s1_100 = s2_203 + s10_185;
		if (s4_179 >= s3_177)
		{
			if (s0_101 < 0x00)
				s0_101.u0 = 0x00;
			if (s9_108 < s1_100)
				s1_100.u0 = 63;
		}
		else if (s3_177 == s5_180)
		{
			if (s0_101 < 0x00)
				s0_101.u0 = 0x00;
			if (s8_103 < s1_100)
				s1_100.u0 = 0x07FF;
		}
		else
		{
			if (s0_101 < s6_181)
				s0_101.u0 = -0x0200;
			if (s7_182 < s1_100)
				s1_100.u0 = 511;
		}
		word32 a3_123;
		word32 s2_176;
		Eq_2 s11_186;
		ptr32 s0_189;
		word32 s1_190;
		g_t4200C506();
		word32 a3_396;
		ptr32 a5_201;
		Eq_2 a0_197 = rf_pri_pm_pwr(out a2_164, out a3_396, out a5_201);
		if (a0_197 >= s11_186)
		{
			word32 a3_208;
			ptr32 s1_229;
			g_t4200C506();
			word32 a3_398;
			Eq_2 a0_236 = rf_pri_pm_pwr(out a2_164, out a3_398, out a5_201);
			if (a0_236 < s11_159)
			{
				s11_159 = a0_236;
				s2_203 = s1_229;
			}
		}
		else
		{
			s11_159 = a0_197;
			s2_203 = s0_189;
		}
	} while (s10_185 != 0x00);
	0x00 = (uint16) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = s2_203;
	a5Out = a5_201;
	s4Out = dwArg0168;
	s5Out = s5_180;
	s6Out = s6_181;
	s7Out = s7_182;
	s8Out = dwArg0148;
	s9Out = s9_108;
	s11Out = s11_159;
	return dwLoc08;
}

// 2301661E: Register word32 rf_pri_singen_config.constprop.8(Register int32 a0, Register out Eq_67845 a4Out)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_txcal
word32 rf_pri_singen_config.constprop.8(int32 a0, union Eq_67845 & a4Out)
{
	*(int32 *) 0x4000120C = a0 << 16 | *((int32 *) 0x4000120C) & ~0x03FF0000;
	*(int32 *) 0x40001214 &= 0x003FFFFF;
	Eq_67845 a4_21 = *(union Eq_67845 *) 0x40001218 & 0x003FFFFF | 0xC0000000;
	*(union Eq_67845 *) 0x40001218 = a4_21;
	a4Out = a4_21;
	return 0xC0000000;
}

// 2301665C: Register Eq_2 rf_pri_rccal_iq(Register Eq_2 ra, Register int32 a0, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArgA8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rf_pri_rccal
Eq_2 rf_pri_rccal_iq(Eq_2 ra, int32 a0, ptr32 fflags, ptr32 frm, Eq_2 dwArgA8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	int32 a4_29;
	int32 a4_21 = *(int32 *) 0x4000160C;
	if (a0 != 0x00)
	{
		*(int32 *) 0x4000160C = a4_21 & -0x0401;
		a4_29 = *(int32 *) 0x4000160C | 0x04000000;
	}
	else
	{
		*(int32 *) 0x4000160C = a4_21 | 0x0400;
		a4_29 = *(int32 *) 0x4000160C & ~0x04000000;
	}
	*(int32 *) 0x4000160C = a4_29;
	struct Eq_68737 * s0_38 = *(struct Eq_68737 **) 0x40001048;
	*(struct Eq_68737 **) 0x43001148 = s0_38;
	word32 a4_416;
	rf_pri_singen_config.constprop.8(0x03, out a4_416);
	s0_38->dw0214 = s0_38->dw0214 & -0x0800 | 0x03FF;
	s0_38->dw0218 = s0_38->dw0218 & -0x0800 | 0x03FF;
	rf_pri_singen_start();
	word32 a5_417;
	rf_pri_start_txdfe(out a5_417);
	s0_38->dw0618 = s0_38->dw0618 & 0xFFF00000 | 0x00FFFC00;
	word32 a3_418;
	word32 a5_419;
	rf_pri_pm_pwr_avg(a0, 0x0400, out a3_418, out a5_419);
	Eq_64250 a1_87;
	Eq_2 a0_100;
	uint32 a1_101;
	ptr32 fflags_115;
	ptr32 frm_116;
	ui32 s1_119;
	ptr32 s2_120;
	ui32 s4_122;
	word32 s6_429;
	word32 s7_430;
	word32 s8_431;
	word32 s9_432;
	word32 s0_423;
	word32 a4_424;
	word32 a5_425;
	word32 s3_427;
	word32 s5_428;
	word32 a7_426;
	word32 a3_421;
	word32 a5_422;
	word32 a2_420;
	Eq_2 ra_117 = __muldf3(ra, __floatunsidf(rf_pri_pm_pwr(out a2_420, out a3_421, out a5_422), out a1_87), a1_87, g_t230770E0, g_t230770E4, fflags, frm, out s0_423, out s1_119, out a0_100, out a1_101, out a4_424, out a5_425, out a7_426, out s2_120, out s3_427, out s4_122, out s5_428, out s6_429, out s7_430, out s8_431, out s9_432, out fflags_115, out frm_116);
	struct Eq_68847 * a4_132;
	Eq_2 a0_128 = __fixunsdfsi(ra_117, a0_100, a1_101, fflags_115, frm_116, out a4_132);
	struct Eq_68852 * s0_134 = a4_132->ptr0048;
	(a4_132 & s1_119 | 0x06000200)->ptr0048 = s0_134;
	word32 a4_433;
	rf_pri_singen_config.constprop.8(181, out a4_433);
	rf_pri_singen_start();
	word32 a5_434;
	rf_pri_start_txdfe(out a5_434);
	s0_134->dw0618 = s0_134->dw0618 & s4_122 | 0x0002D400;
	Eq_68449 s1_160 = 0x00;
	ui32 s0_161;
	Eq_68728 s4_162 = 32;
	for (s0_161 = 0x06; s0_161 != 0x00; s0_161 += ~0x00)
	{
		word32 s5_165 = s4_162 + s1_160;
		rf_pri_rccal_config(s2_120, s5_165);
		word32 a2_435;
		word32 a3_436;
		word32 a5_437;
		if (a0_128 < rf_pri_pm_pwr(out a2_435, out a3_436, out a5_437))
			s1_160 = s5_165;
		s4_162 >>= 0x01;
	}
	int32 s4_185;
	for (s4_185 = 63; s4_185 != 0x00; s4_185 += ~0x00)
	{
		ptr32 a0_214;
		rf_pri_rccal_config(s2_120, s1_160);
		ui32 s0_202 = s0_161 << 1;
		ptr32 a3_198;
		word32 a5_439;
		word32 a2_438;
		if (a0_128 < rf_pri_pm_pwr(out a2_438, out a3_198, out a5_439))
		{
			s0_161 = s0_202 + 0x01 & 0x0F;
			s1_160 = (word32) s1_160 + 1;
			if (s0_161 == 0x05)
				goto l23016796;
		}
		else
		{
			s0_161 = s0_202 & 0x0F;
			s1_160 = (word32) s1_160 - 1;
			if ((s0_202 & 0x0F) == 0x0A)
			{
l23016796:
				a0_214 = 0x03;
				goto l230167C0;
			}
		}
	}
	a0_214 = 0x02;
l230167C0:
	0x00 = (uint16) dwArgA8;
	a0Out = a0_214;
	a3Out = a3_198;
	s2Out = s2_120;
	fflagsOut = fflags_115;
	frmOut = frm_116;
	return ra_117;
}

// 230167D4: Register Eq_2 rf_pri_config_channel.constprop.9(Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0128, Register out ptr32 a5Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
Eq_2 rf_pri_config_channel.constprop.9(Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArg0128, ptr32 & a5Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_68109 * a2_7 = g_ptr4200D92C;
	*(int32 *) 0x400010A0 = ((word32) a2_7->w002E >> 8 & 0x1F) << 16 | ((word32) a2_7->w002E & 0x00FF | *((int32 *) 0x400010A0) & -0x0100) & ~0x001F0000;
	*(int32 *) 0x400010BC = ((word32) g_ptr4200D92C->w002E & 0x00FF) >> 4 << 20 | *((int32 *) 0x400010BC) & ~0x00F00000;
	*(int32 *) 0x400010C4 = *(int32 *) 0x400010C4 & 0xC0000000 | g_dw4200CF64;
	*(int32 *) 0x400010C0 &= ~0x01000000;
	word32 s1_230 = 0x4200E000;
	struct Eq_69019 * s0_164 = (struct Eq_69019 *) 0x40001000;
	ui32 s5_236 = 0x10000000;
	word32 s2_233 = ~0x10000000;
	word32 s6_237 = 0x10000000;
	word32 s3_234 = ~0x10000000;
	word32 s7_238 = 0x01100000;
	word32 s4_235 = 0x2308B000;
	while (true)
	{
		int32 a5_76 = s0_164->dw00B8 | s5_236;
		s0_164->dw00B8 = a5_76;
		word32 s1_87;
		struct Eq_69082 * s0_89;
		ui32 s2_90;
		word32 s3_91;
		word32 s4_92;
		word32 s5_93;
		word32 s6_94;
		word32 s7_95;
		g_t4200C506();
		int32 a5_108 = s0_89->dw00B8 & s2_90;
		s0_89->dw00B8 = a5_108;
		word32 s1_112;
		struct Eq_69099 * s0_114;
		word32 s2_115;
		word32 s3_116;
		word32 s4_117;
		word32 s5_118;
		ui32 s6_119;
		word32 s7_120;
		g_t4200C506();
		int32 a5_133 = s0_114->dw00B0 | s6_119;
		s0_114->dw00B0 = a5_133;
		word32 s1_137;
		struct Eq_69116 * s0_139;
		word32 s2_140;
		ui32 s3_141;
		word32 s4_142;
		word32 s5_143;
		word32 s6_144;
		word32 s7_145;
		g_t4200C506();
		int32 a5_158 = s0_139->dw00B0 & s3_141;
		s0_139->dw00B0 = a5_158;
		word32 s4_167;
		ui32 s7_170;
		Eq_2 ra_171;
		Eq_2 a3_173;
		g_t4200C506();
		if ((s0_164->dw00B4 & s7_170) == 0x00)
			break;
		word32 t4_330;
		word32 s11_329;
		word32 s10_328;
		word32 s9_327;
		word32 s8_326;
		word32 a7_325;
		word32 a5_324;
		word32 a4_323;
		word32 a3_322;
		word32 a2_321;
		word32 a1_320;
		word32 a0_319;
		printf(ra_171, s4_167 + -0x04D4, a3_173, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_230, out a0_319, out a1_320, out a2_321, out a3_322, out a4_323, out a5_324, out a7_325, out s2_233, out s3_234, out s4_235, out s5_236, out s6_237, out s7_238, out s8_326, out s9_327, out s10_328, out s11_329, out t4_330);
	}
	0x00 = (uint16) dwArg0128;
	ptr32 a5_199;
	ptr32 s10_208;
	ptr32 s11_209;
	ptr32 s9_217;
	word32 a2_334;
	word32 a1_333;
	word32 a0_332;
	word32 s1_331;
	word32 a3_335;
	word32 a4_336;
	word32 a7_337;
	word32 s2_338;
	word32 s3_339;
	word32 s4_340;
	word32 s5_341;
	word32 s6_342;
	word32 s7_343;
	word32 s8_344;
	word32 t4_345;
	Eq_2 ra_206 = printf(ra_171, &g_t23077024, a3_173, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_331, out a0_332, out a1_333, out a2_334, out a3_335, out a4_336, out a5_199, out a7_337, out s2_338, out s3_339, out s4_340, out s5_341, out s6_342, out s7_343, out s8_344, out s9_217, out s10_208, out s11_209, out t4_345);
	a5Out = a5_199;
	s9Out = s9_217;
	s10Out = s10_208;
	s11Out = s11_209;
	return ra_206;
}

// 23016920: Register word32 rf_pri_roscal_iq.isra.3(Register int32 a0, Register (ptr32 Eq_69184) a5, Stack Eq_2 dwArg0128, Register out Eq_69186 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_69184) a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      rf_pri_roscal
word32 rf_pri_roscal_iq.isra.3(int32 a0, struct Eq_69184 * a5, Eq_2 dwArg0128, union Eq_69186 & a0Out, ptr32 & a3Out, struct Eq_69184 & a5Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	ui32 s0_100;
	Eq_69186 s2_101 = 0x00;
	Eq_69196 s4_27 = 32;
	for (s0_100 = 0x06; s0_100 != 0x00; s0_100 += ~0x00)
	{
		struct Eq_69201 * a5_38;
		word32 s1_32 = a5->dw007C;
		word32 s6_35 = s4_27 + s2_101;
		if (a0 != 0x00)
			a5_38 = s6_35 << 0x08 | a5 & 0xFC0000FF;
		else
			a5_38 = s6_35 | a5 & -64;
		a5_38->dw007C = s1_32;
		word32 a3_243;
		if (rf_pri_pm_pwr_avg(a0, 0x0400, out a3_243, out a5) <= 0x00)
			s2_101 = s6_35;
		s4_27 >>= 0x01;
	}
	int32 s4_106;
	for (s4_106 = 63; s4_106 != 0x00; s4_106 += ~0x00)
	{
		struct Eq_69236 * a5_75;
		word32 s1_71 = a5->dw007C;
		if (a0 != 0x00)
			a5_75 = s2_101 << 0x08 | a5 & 0xFC0000FF;
		else
			a5_75 = a5 & -64 | s2_101;
		a5_75->dw007C = s1_71;
		ui32 s0_93 = s0_100 << 1;
		ptr32 a3_88;
		if (rf_pri_pm_pwr_avg(a0, 0x0400, out a3_88, out a5) > 0x00)
		{
			s0_100 = s0_93 + 0x01 & 0x0F;
			s2_101 = (word32) s2_101 - 1;
			if (s0_100 == 0x05)
				break;
		}
		else
		{
			s0_100 = s0_93 & 0x0F;
			s2_101 = (word32) s2_101 + 1;
			if ((s0_93 & 0x0F) == 0x0A)
				break;
		}
	}
	0x00 = (uint16) dwArg0128;
	a0Out = s2_101;
	a3Out = a3_88;
	a5Out = a5;
	s4Out = dwArg78;
	s5Out = 0xFC0000FF;
	s8Out = s5;
	return dwArgE4;
}

