pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 230169F0: void rf_pri_chipv(Register word32 a0)
// Called from:
//      rf_pri_init
void rf_pri_chipv(word32 a0)
{
	if (a0 != 0x00)
	{
		if (a0 == 0x01)
		{
			*(word32 *) 0x00050005 = 0x4200D924;
			g_w4200D928 = 0x05;
			struct Eq_69417 * a4_16 = (struct Eq_69417 *) 0x1C;
			do
			{
				struct Eq_69417 * a5_21 = (char *) a4_16 - 28;
				do
				{
					word32 a0_26 = a5_21->dw230773EC;
					a5_21->dw42011B74 = a0_26;
					a5_21->dw42011D34 = a0_26;
					a5_21 = (struct Eq_69417 *) ((char *) a5_21 + 4);
				} while (a5_21 != a4_16);
				a4_16 = a5_21 + 1;
			} while (a5_21 != (struct Eq_69417 *) -448);
			struct Eq_69439 * a5_40 = null;
			struct Eq_69322 * a2_43 = (struct Eq_69322 *) 56;
			do
			{
				*a5_40[276842191] = (struct Eq_69439) (a5_40 + 276842177);
				++a5_40;
			} while (a5_40 != (struct Eq_69439 *) 56);
			Eq_69455 a4_57 = 0x42011EF4;
			do
			{
				struct Eq_69338 * a5_61 = a2_43->ptr0000;
				a4_57 = (word32) a4_57 + 16;
				*((word32) a4_57 + 0x0FF0) = a2_43;
				*((word32) a4_57 + 0x0FF4) = a5_61->dw0004;
				*((word32) a4_57 + 0x0FF8) = a5_61->dw0008;
				a2_43 = a5_61->ptr000C;
				*((word32) a4_57 + 0x0FFC) = a2_43;
			} while (a5_61 != (struct Eq_69338 *) 3707275620);
			union Eq_2 * a5_74 = *a4_57;
			*(union Eq_69455 *) 0x0C = a4_57;
			Eq_2 a5_77 = *a5_74;
			*(union Eq_2 *) 0x09 = a5_77;
			*(union Eq_2 *) 0x14 = a5_77;
			*(union Eq_2 *) 0x11 = a5_77;
			*(union Eq_2 *) 0x1C = a5_77;
			*(union Eq_2 *) 0x19 = a5_77;
			*(union Eq_2 *) 0x24 = a5_77;
			*(union Eq_2 *) 33 = a5_77;
			*(union Eq_2 *) 33 = a5_77;
			*(union Eq_2 *) 0x25 = a5_77;
			*(union Eq_2 *) 0x25 = a5_77;
			*(union Eq_2 *) 0x2D = a5_77;
			*(union Eq_2 *) 0x32 = a5_77;
		}
	}
	else
	{
		*(word32 *) 0x00060003 = 0x4200D924;
		g_w4200D928 = 0x06;
		struct Eq_69298 * a4_104 = (struct Eq_69298 *) 0x1C;
		do
		{
			struct Eq_69298 * a5_109 = (char *) a4_104 - 28;
			do
			{
				word32 a0_114 = a5_109[0x08C1DC8B];
				a5_109[0x108046DD] = (struct Eq_69298) a0_114;
				a5_109[0x1080474D] = (struct Eq_69298) a0_114;
				++a5_109;
			} while (a4_104 != a5_109);
			a4_104 += 7;
		} while (a4_104 != (struct Eq_69298 *) 476);
		struct Eq_69320 * a5_128 = null;
		struct Eq_69322 * a2_131 = (struct Eq_69322 *) 56;
		do
		{
			*a5_128[146922621] = (struct Eq_69320) (a5_128 + 276842177);
			++a5_128;
		} while (a5_128 != (struct Eq_69320 *) 56);
		Eq_2 a4_145 = 0x42011EF4;
		do
		{
			struct Eq_69338 * a5_149 = a2_131->ptr0000;
			a4_145 = (word32) a4_145 + 16;
			*((word32) a4_145 + 0x0FF0) = a2_131;
			*((word32) a4_145 + 0x0FF4) = a5_149->dw0004;
			*((word32) a4_145 + 0x0FF8) = a5_149->dw0008;
			a2_131 = a5_149->ptr000C;
			*((word32) a4_145 + 0x0FFC) = a2_131;
		} while (a5_149 != (struct Eq_69338 *) 3707275748);
		union Eq_2 * a5_162 = *a4_145;
		*(union Eq_2 *) 0x0A = a4_145;
		Eq_2 a5_165 = *a5_162;
		*(union Eq_2 *) 0x07 = a5_165;
		*(union Eq_2 *) 0x12 = a5_165;
		*(union Eq_2 *) 0x0F = a5_165;
		*(union Eq_2 *) 0x1A = a5_165;
		*(union Eq_2 *) 0x17 = a5_165;
		*(union Eq_2 *) 0x22 = a5_165;
		*(union Eq_2 *) 0x1F = a5_165;
		((word32) a5_165 + 32)->u0 = 0x00;
		((word32) a5_165 + 36)->u0 = 0x00;
		((word32) a5_165 + 36)->u0 = 0x00;
		((word32) a5_165 + 44)->u0 = 0x00;
		((word32) a5_165 + 48)->u0 = 0x00;
	}
}

// 23016BD8: void rf_pri_update_tx_power_offset(Register int32 a0, Register ptr32 a1)
// Called from:
//      rfc_apply_tx_power_offset
void rf_pri_update_tx_power_offset(int32 a0, ptr32 a1)
{
	int32 s1_17 = (int32) (a1 + a0);
	word32 a6_97;
	word32 a5_96;
	word32 a1_93;
	word32 a2_94;
	word32 a3_95;
	word32 a7_98;
	struct Eq_69530 * a4_24;
	memcpy(0x42011B74, 0x42011D34, 448, out a1_93, out a2_94, out a3_95, out a4_24, out a5_96, out a6_97, out a7_98);
	ui32 s1_40 = (s1_17 ^ 0x04) + ~0x09;
	do
	{
		struct Eq_69548 * a5_45 = a4_24->ptr0014;
		a5_45->ptr1014 = a4_24 + (s1_17 | 0x04) / 24;
		a4_24 = a5_45->dw0018 + s1_40;
		a5_45->ptr1018 = a4_24;
	} while (a5_45 != (struct Eq_69548 *) ~0x42011D17);
	rf_pri_set_gain_table_regs();
}

// 23016C42: Register Eq_62646 rf_pri_get_notch_param(Register Eq_62646 a0, Register (ptr32 byte) a1, Register ptr32 a2)
// Called from:
//      rf_set_channel
Eq_62646 rf_pri_get_notch_param(Eq_62646 a0, byte * a1, ptr32 a2)
{
	uint32 a5_11 = 0x0D;
	if (a0 <= 0x00FFF9A8)
		a5_11 = (word32) a0 - 0x00FFF96C >> 0x05;
	ptr32 * a5_20 = (*(struct Eq_69576 **) 0x00FFF9A8)->ptr0004;
	*a1 = 0xA8;
	*a5_20 = a2;
	return a5_11 << 0x03;
}

// 23016C76: void rf_pri_update_param(Register Eq_62646 a0)
// Called from:
//      rf_set_channel
void rf_pri_update_param(Eq_62646 a0)
{
	uint32 a4_23;
	struct Eq_69594 * a5_24;
	ui32 a5_15;
	g_ptr4200ECE0 = null;
	g_dw4200ECE4 = 0x00;
	g_dw4200ECDC = 0x00;
	g_dw4200ED5C = 0x00;
	if (a0 > 0x00FFF96B && a0 > 0x00FFF970)
	{
		if (a0 > 0x00FFF97A)
		{
			if (a0 > 0x00FFF989)
			{
				if (a0 > 0x00FFF998)
				{
					a4_23 = 0x08;
					a5_24 = (struct Eq_69594 *) 0x07;
					if (a0 > 0x00FFF9A7)
						goto l23016D38;
					a5_15 = 0x04;
				}
				else
					a5_15 = 0x03;
			}
			else
				a5_15 = 0x02;
		}
		else
			a5_15 = 0x01;
	}
	else
		a5_15 = 0x00;
	struct Eq_69647 * a2_29 = a5_15 << 0x02;
	Eq_62646 a7_33 = a2_29->t2307700C;
	Eq_69662 a6_35 = 0x00;
	if (a7_33 != a0)
		a6_35 = a0 - a7_33;
	Eq_69646 t1_47 = a2_29->t23076FDC;
	ptr32 a1_60 = &a2_29->t23076FDC - a7_33;
	ui32 a2_53 = a2_29->dw23076FF4;
	a4_23 = (Mem10[a2_29 + 587689948:word32] - t1_47 + a6_35 >>u a1_60) + t1_47;
	a5_24 = ((word32) a6_35 + ((a5_15 + 0x01 << 2) - a2_53) >> a1_60) + a2_53;
l23016D38:
	a5_24->dw001F = 0x4200D004;
	(55 - a4_23)->dw0014 = 0x4200D004;
	struct Eq_69636 * a7_101 = &g_t4200D004;
	int32 a6_240 = 0x00;
	struct Eq_69640 * a3_100 = (struct Eq_69640 *) 0x0A;
	int32 a5_80 = 0x14 - a5_24;
	do
	{
		struct Eq_69640 * a1_132 = (word32) a7_101[4] + a6_240 - a5_80;
		a6_240 = 0x00;
		if (a3_100 < a1_132)
			a6_240 = a1_132 - a3_100;
		if (a3_100 < a1_132)
			a1_132 = a3_100;
		a7_101[3] = (struct Eq_69636) a1_132;
		a3_100 = (struct Eq_69640 *) ((char *) a3_100 - 5);
		a7_101 = (struct Eq_69636 *) ((char *) a7_101 - 4);
	} while (a3_100 != (struct Eq_69640 *) ~0x09);
	struct Eq_69640 * a3_110 = (struct Eq_69640 *) 56;
	ui32 a7_111 = 0x00;
	word32 a5_114 = 0x00 - (a4_23 ^ 0x04);
	struct Eq_69710 * a5_116 = (struct Eq_69710 *) 0x14;
	int32 a4_117 = 0x14 - a4_23;
	do
	{
		word32 a2_120 = a5_116->dw0014;
		a5_116 = a5_116 - a7_111 + a4_117;
		if (a5_116 > (struct Eq_69710 *) 95)
			a5_116 += (a5_114 + 5) / 28;
		a5_116->dw0018 = a2_120;
		word32 a2_133 = a1_132->dw0018;
		a7_111 = 0x00;
		if (a1_132 < a3_110)
			a7_111 = a3_110 - a1_132;
		if (a1_132 < a3_110)
			a1_132 = a3_110;
		a1_132->dw0018 = a2_133;
		a3_110 = (struct Eq_69640 *) ((char *) a3_110 + 5);
	} while (a3_110 != (struct Eq_69640 *) 91);
	word32 a3_177;
	ui32 a5_178;
	g_dw4200D014 = 0x0F;
	g_dw4200D018 = 0x0033;
	if (a0 <= 16775557)
	{
		a3_177 = *(word32 *) 0x00FFF9F1;
		a5_178 = (word32) g_w4200D926;
	}
	else
	{
		a3_177 = *(word32 *) 0x00FFF9F1;
		a5_178 = (word32) g_w4200D928;
	}
	word32 * a5_194;
	(a5_178 | 0x00FFF980)->dw006C = a3_177;
	if (a0 == 0x00FFF98A)
	{
		a5_194 = g_ptr42011B1C;
		goto l23016ED2;
	}
	if (a0 <= 0x00FFF98A)
	{
		if (a0 == 0x00FFF976)
		{
			a5_194 = g_ptr42011B0C;
			goto l23016ED2;
		}
		if (a0 <= 0x00FFF976)
		{
			if (a0 != 0x00FFF96C)
			{
				if (a0 != 0x00FFF971)
					goto l23016E34;
				a5_194 = g_ptr42011B08;
			}
			else
				a5_194 = g_a42011B04[0];
l23016ED2:
			*a5_194 = 0x4200DD54;
			return;
		}
		if (a0 == 0x00FFF980)
		{
			a5_194 = g_ptr42011B14;
			goto l23016ED2;
		}
		if (a0 == 16775557)
		{
			a5_194 = g_ptr42011B18;
			goto l23016ED2;
		}
		if (a0 == 0x00FFF97B)
		{
			a5_194 = g_ptr42011B10;
			goto l23016ED2;
		}
	}
	else
	{
		if (a0 == 0x00FFF99E)
		{
			a5_194 = g_ptr42011B2C;
			goto l23016ED2;
		}
		if (a0 <= 0x00FFF99E)
		{
			if (a0 == 0x00FFF994)
			{
				a5_194 = g_ptr42011B24;
				goto l23016ED2;
			}
			if (a0 == 0x00FFF999)
			{
				a5_194 = g_ptr42011B28;
				goto l23016ED2;
			}
			if (a0 == 0x00FFF98F)
			{
				a5_194 = g_ptr42011B20;
				goto l23016ED2;
			}
		}
		else
		{
			if (a0 == 0x00FFF9A8)
			{
				a5_194 = g_ptr42011B34;
				goto l23016ED2;
			}
			if (a0 == 0x00FFF9B4)
			{
				a5_194 = g_ptr42011B38;
				goto l23016ED2;
			}
			if (a0 == 0x00FFF9A3)
			{
				a5_194 = g_ptr42011B30;
				goto l23016ED2;
			}
		}
	}
l23016E34:
	g_dw4200DD54 = 0x00;
}

// 23016F3A: void rf_pri_xtalfreq(Register (ptr32 Eq_65592) a0)
// Called from:
//      rfc_init
void rf_pri_xtalfreq(struct Eq_65592 * a0)
{
	struct Eq_69839 * a4_456;
	if (a0 != null)
	{
		struct Eq_69842 * a4_603;
		if (a0 == (struct Eq_65592 *) 0x01)
		{
			*(word32 *) 0x1ED20D21 = 0x4200CF40;
			*(word32 *) 517942775 = 0x4200CF40;
			*(word32 *) 0x1EEC4ECD = 0x4200CF40;
			*(word32 *) 519663523 = 0x4200CF40;
			*(word32 *) 0x1F069079 = 0x4200CF40;
			*(word32 *) 0x1F13B14F = 0x4200CF40;
			*(word32 *) 522244645 = 0x4200CF40;
			*(word32 *) 0x1F2DF2FB = 0x4200CF40;
			*(word32 *) 523965393 = 0x4200CF40;
			*(word32 *) 524825767 = 0x4200CF40;
			*(word32 *) 0x1F55557D = 0x4200CF40;
			*(word32 *) 526546515 = 0x4200CF40;
			*(word32 *) 0x1F6F9729 = 0x4200CF40;
			*(word32 *) 0x1F7CB7FF = 0x4200CF40;
			*(word32 *) 0x1F89D8D6 = 0x4200CF40;
			*(word32 *) 529988012 = 0x4200CF40;
			*(word32 *) 530848386 = 0x4200CF40;
			*(word32 *) 0x1FB13B58 = 0x4200CF40;
			*(word32 *) 532569134 = 0x4200CF40;
			*(word32 *) 533429508 = 0x4200CF40;
			*(word32 *) 534289882 = 0x4200CF40;
			*(word32 *) 2806228732 = 0x4200CF14;
			*(word32 *) ~0x582E5871 = 0x4200CF14;
			*(word32 *) 0xA860A821 = 0x4200CF14;
			*(word32 *) 2834213043 = 0x4200CF14;
			*(word32 *) 0xA97CA945 = 0x4200CF14;
			*(word32 *) 2852825559 = 0x4200CF14;
			*(word32 *) 0xAA99AA6A = 0x4200CF14;
			*(word32 *) ~0x54D85503 = 0x4200CF14;
			*(word32 *) 2880809870 = 0x4200CF14;
			*(word32 *) 0xAC43AC20 = 0x4200CF14;
			g_w4200CF3C = 64651;
			*(word32 *) 2800854705 = 0x4200D918;
			g_w4200D91C = ~0x030D;
			g_w4200E91E = 0x056B;
			*(word32 *) 6000004 = 0x4200CF94;
			*(word32 *) 1000012 = 0x4200CF94;
			*(word32 *) ~0x003D08EB = 0x4200CF94;
			*(word32 *) ~0x00895423 = 0x4200CF94;
			*(word32 *) 7000044 = 0x4200CF94;
			*(word32 *) 2000052 = 0x4200CF94;
			*(word32 *) ~0x002DC683 = 0x4200CF94;
			*(word32 *) ~0x007A11BB = 0x4200CF94;
			*(word32 *) 8000084 = 0x4200CF94;
			*(word32 *) 3000092 = 0x4200CF94;
			a0->dw0000 = 0x4200CF94;
			a0->dw0008 = 0x4200CF94;
			a0->dw0010 = 0x4200CF94;
			a0->dw0018 = 0x4200CF94;
			g_dw4200CFB4 = 0x00;
			a0->dw0028 = 0x4200CF94;
			a0->dw0030 = 0x4200CF94;
			a0->dw0038 = 0x4200CF94;
			a0->dw0040 = 0x4200CF94;
			g_dw4200CFDC = 0x00;
			a0->dw0050 = 0x4200CF94;
			a0->dw0058 = 0x4200CF94;
			a0->dw0060 = 0x4200CF94;
			g_dw4200CFFC = 0x00;
			g_dw4200CFB8 = 0x00;
			g_dw4200CFE0 = 0x00;
			a4_603 = (struct Eq_69842 *) 4292967296;
		}
		else
		{
			if (a0 != (struct Eq_65592 *) 0x02)
			{
				if (a0 != (struct Eq_65592 *) 0x03)
				{
					if (a0 == (struct Eq_65592 *) 0x04)
					{
						*(word32 *) 0x14088889 = 0x4200CF40;
						*(word32 *) 0x14111115 = 0x4200CF40;
						*(word32 *) 337222050 = 0x4200CF40;
						*(word32 *) 0x1422222E = 0x4200CF40;
						*(word32 *) 338340539 = 0x4200CF40;
						*(word32 *) 338899783 = 0x4200CF40;
						*(word32 *) 0x143BBBD4 = 0x4200CF40;
						*(word32 *) 0x14444460 = 0x4200CF40;
						*(word32 *) 0x144CCCED = 0x4200CF40;
						*(word32 *) 341136761 = 0x4200CF40;
						*(word32 *) 341696006 = 0x4200CF40;
						*(word32 *) 342255250 = 0x4200CF40;
						*(word32 *) 0x146EEF1F = 0x4200CF40;
						*(word32 *) 343373739 = 0x4200CF40;
						*(word32 *) 0x14800038 = 0x4200CF40;
						*(word32 *) 344492229 = 0x4200CF40;
						*(word32 *) 0x14911151 = 0x4200CF40;
						*(word32 *) 0x149999DE = 0x4200CF40;
						*(word32 *) 346169962 = 0x4200CF40;
						*(word32 *) 0x14AAAAF7 = 0x4200CF40;
						*(word32 *) 0x14B33383 = 0x4200CF40;
						*(word32 *) ~0x58CD5914 = 0x4200CF14;
						*(word32 *) ~0x583F5882 = 0x4200CF14;
						*(word32 *) 0xA84FA810 = 0x4200CF14;
						*(word32 *) 0xA8DDA8A2 = 0x4200CF14;
						*(word32 *) 2842405172 = 0x4200CF14;
						*(word32 *) ~0x56065639 = 0x4200CF14;
						*(word32 *) 0xAA87AA58 = 0x4200CF14;
						*(word32 *) ~0x54E95514 = 0x4200CF14;
						*(word32 *) ~0x545B5482 = 0x4200CF14;
						*(word32 *) 2889001999 = 0x4200CF14;
						g_w4200CF3C = 64633;
						*(word32 *) 0xA6E0A6A0 = 0x4200D918;
						g_w4200D91C = ~0x031F;
						g_w4200E91E = ~0x07AA;
						((union Eq_2 *) 33)->u0 = 0x4200CF94;
						((union Eq_2 *) 0x29)->u0 = 0x4200CF94;
						((union Eq_2 *) 0x31)->u0 = 0x4200CF94;
						((union Eq_2 *) 0x39)->u0 = 0x4200CF94;
						((union Eq_2 *) 0x61)->u0 = 0x4200CF94;
						*(word32 *) 0x69 = 0x4200CF94;
						*(word32 *) 3000044 = 0x4200CF94;
						*(word32 *) 8000036 = 0x4200CF94;
						*(word32 *) ~0x001E844B = 0x4200CF94;
						*(word32 *) 8000100 = 0x4200CF94;
						g_dw4200CF94 = 0x00;
						g_dw4200CF9C = 0x00;
						g_dw4200CFA4 = 0x00;
						g_dw4200CFAC = 0x00;
						g_dw4200CFD4 = 0x00;
						g_dw4200CFDC = 0x00;
						g_dw4200CFE4 = 0x00;
						g_dw4200CFEC = 0x00;
						g_dw4200CF98 = 0x00;
						g_dw4200CFA0 = 0x00;
						g_dw4200CFA8 = 0x00;
						g_dw4200CFB0 = 0x00;
						*(word32 *) ~0x006ACF83 = 0x4200CF94;
						g_dw4200CFD8 = 0x00;
						g_dw4200CFE0 = 0x00;
						g_dw4200CFE8 = 0x00;
						g_dw4200CFF0 = 0x00;
						*(word32 *) ~0x003D0893 = 0x4200CF94;
						return;
					}
					if (a0 != (struct Eq_65592 *) 0x05)
						return;
					*(word32 *) 0x0F690690 = 0x4200CF40;
					*(word32 *) 0x0F6F96FD = 0x4200CF40;
					*(word32 *) 0x0F76276A = 0x4200CF40;
					*(word32 *) 0x0F7CB7D7 = 0x4200CF40;
					*(word32 *) 0x0F834845 = 0x4200CF40;
					*(word32 *) 260692146 = 0x4200CF40;
					*(word32 *) 0x0F90691F = 0x4200CF40;
					*(word32 *) 261552524 = 0x4200CF40;
					*(word32 *) 0x0F9D89F9 = 0x4200CF40;
					*(word32 *) 262412902 = 0x4200CF40;
					*(word32 *) 0x0FAAAAD3 = 0x4200CF40;
					*(word32 *) 0x0FB13B40 = 0x4200CF40;
					*(word32 *) 0x0FB7CBAD = 0x4200CF40;
					*(word32 *) 264133658 = 0x4200CF40;
					*(word32 *) 0x0FC4EC87 = 0x4200CF40;
					*(word32 *) 264994036 = 0x4200CF40;
					*(word32 *) 265424225 = 0x4200CF40;
					*(word32 *) 265854414 = 0x4200CF40;
					*(word32 *) 266284603 = 0x4200CF40;
					*(word32 *) 266714792 = 0x4200CF40;
					*(word32 *) 0x0FEC4F15 = 0x4200CF40;
					*(word32 *) 2805245677 = 0x4200CF14;
					*(word32 *) ~0x583D5880 = 0x4200CF14;
					*(word32 *) 0xA850A811 = 0x4200CF14;
					*(word32 *) 0xA8DEA8A3 = 0x4200CF14;
					*(word32 *) 2842536245 = 0x4200CF14;
					*(word32 *) 2851842504 = 0x4200CF14;
					*(word32 *) 0xAA89AA5A = 0x4200CF14;
					*(word32 *) 2870455020 = 0x4200CF14;
					*(word32 *) ~0x545A5481 = 0x4200CF14;
					*(word32 *) 0xAC34AC10 = 0x4200CF14;
					g_w4200CF3C = 64635;
					*(word32 *) 0xA6E2A6A2 = 0x4200D918;
					g_w4200D91C = ~0x031D;
					g_w4200E91E = ~0x052A;
					((union Eq_2 *) 0x29)->u0 = 0x4200CF94;
					((union Eq_2 *) 0x31)->u0 = 0x4200CF94;
					((union Eq_2 *) 0x39)->u0 = 0x4200CF94;
					((union Eq_2 *) 0x41)->u0 = 0x4200CF94;
					*(word32 *) 7000044 = 0x4200CF94;
					*(word32 *) 2000052 = 0x4200CF94;
					*(word32 *) ~0x002DC683 = 0x4200CF94;
					g_dw4200CF94 = 0x00;
					g_dw4200CF9C = 0x00;
					g_dw4200CFA4 = 0x00;
					g_dw4200CFAC = 0x00;
					g_dw4200CFB4 = 0x00;
					g_dw4200CFDC = 0x00;
					g_dw4200CFE4 = 0x00;
					g_dw4200CFEC = 0x00;
					g_dw4200CFF4 = 0x00;
					g_dw4200CFFC = 0x00;
					g_dw4200CF98 = 0x00;
					g_dw4200CFA0 = 0x00;
					g_dw4200CFA8 = 0x00;
					g_dw4200CFB0 = 0x00;
					g_dw4200CFB8 = 0x00;
					*(word32 *) ~0x007A11BB = 0x4200CF94;
					g_dw4200CFE0 = 0x00;
					g_dw4200CFE8 = 0x00;
					g_dw4200CFF0 = 0x00;
l2301713C:
					g_dw4200CFF8 = 0x00;
l2301735E:
					g_dw4200D000 = 0x00;
					return;
				}
				*(word32 *) 0x14DE38E4 = 0x4200CF40;
				*(word32 *) 0x14E71C76 = 0x4200CF40;
				*(word32 *) 0x14F00008 = 0x4200CF40;
				*(word32 *) 351855514 = 0x4200CF40;
				*(word32 *) 0x1501C72C = 0x4200CF40;
				*(word32 *) 0x150AAABF = 0x4200CF40;
				*(word32 *) 353603153 = 0x4200CF40;
				*(word32 *) 0x151C71E3 = 0x4200CF40;
				*(word32 *) 0x15255575 = 0x4200CF40;
				*(word32 *) 355350792 = 0x4200CF40;
				*(word32 *) 355933338 = 0x4200CF40;
				*(word32 *) 0x1540002C = 0x4200CF40;
				*(word32 *) 357098430 = 0x4200CF40;
				*(word32 *) 0x1551C750 = 0x4200CF40;
				*(word32 *) 358263523 = 0x4200CF40;
				*(word32 *) 358846069 = 0x4200CF40;
				*(word32 *) 0x156C7207 = 0x4200CF40;
				*(word32 *) 360011161 = 0x4200CF40;
				*(word32 *) 360593708 = 0x4200CF40;
				*(word32 *) 361176254 = 0x4200CF40;
				*(word32 *) 0x15900050 = 0x4200CF40;
				*(word32 *) 2805573362 = 0x4200CF14;
				*(word32 *) ~0x5838587B = 0x4200CF14;
				*(word32 *) 2824185878 = 0x4200CF14;
				*(word32 *) 0xA8E4A8A8 = 0x4200CF14;
				*(word32 *) ~0x568D56C4 = 0x4200CF14;
				*(word32 *) 0xAA00A9CD = 0x4200CF14;
				*(word32 *) ~0x557155A0 = 0x4200CF14;
				*(word32 *) 2870782705 = 0x4200CF14;
				*(word32 *) ~0x5454547B = 0x4200CF14;
				*(word32 *) 0xAC39AC16 = 0x4200CF14;
				g_w4200CF3C = 64640;
				*(word32 *) ~0x59185958 = 0x4200D918;
				g_w4200D91C = 64743;
				g_w4200E91E = 0xF800;
				((union Eq_2 *) 0x01)->u0 = 0x4200CF94;
				((union Eq_2 *) 0x09)->u0 = 0x4200CF94;
				((union Eq_2 *) 0x11)->u0 = 0x4200CF94;
				((union Eq_2 *) 0x19)->u0 = 0x4200CF94;
				((union Eq_2 *) 0x41)->u0 = 0x4200CF94;
				*(word32 *) 0x49 = 0x4200CF94;
				((union Eq_2 *) 0x51)->u0 = 0x4200CF94;
				*(word32 *) 0x59 = 0x4200CF94;
				*(word32 *) 7200004 = 0x4200CF94;
				*(word32 *) 2200012 = 0x4200CF94;
				*(word32 *) ~0x002AB96B = 0x4200CF94;
				*(word32 *) ~0x007704A3 = 0x4200CF94;
				*(word32 *) 5600068 = 0x4200CF94;
				*(word32 *) 600076 = 0x4200CF94;
				*(word32 *) ~0x0043232B = 0x4200CF94;
				g_dw4200CFB4 = 0x00;
				g_dw4200CFBC = 0x00;
				g_dw4200CFC4 = 0x00;
				g_dw4200CFCC = 0x00;
				g_dw4200CFF4 = 0x00;
				g_dw4200CFFC = 0x00;
				g_dw4200CFB8 = 0x00;
				g_dw4200CFC0 = 0x00;
				g_dw4200CFC8 = 0x00;
				g_dw4200CFD0 = 0x00;
				a4_456 = (struct Eq_69839 *) 0xFF709140;
l2301713A:
				a4_456->dw005C = 0x4200CF94;
				goto l2301713C;
			}
			*(word32 *) 0x190AAAAB = 0x4200CF40;
			*(word32 *) 0x19155559 = 0x4200CF40;
			*(word32 *) 0x19200008 = 0x4200CF40;
			*(word32 *) 422226615 = 0x4200CF40;
			*(word32 *) 422925669 = 0x4200CF40;
			*(word32 *) 0x19400014 = 0x4200CF40;
			*(word32 *) 424323779 = 0x4200CF40;
			*(word32 *) 0x19555571 = 0x4200CF40;
			*(word32 *) 0x19600020 = 0x4200CF40;
			*(word32 *) 426420943 = 0x4200CF40;
			*(word32 *) 427119997 = 0x4200CF40;
			*(word32 *) 0x1980002C = 0x4200CF40;
			*(word32 *) 0x198AAADB = 0x4200CF40;
			*(word32 *) 0x19955589 = 0x4200CF40;
			*(word32 *) 429916216 = 0x4200CF40;
			*(word32 *) 0x19AAAAE7 = 0x4200CF40;
			*(word32 *) 0x19B55595 = 0x4200CF40;
			*(word32 *) 0x19C00044 = 0x4200CF40;
			*(word32 *) 432712435 = 0x4200CF40;
			*(word32 *) 433411489 = 0x4200CF40;
			*(word32 *) 0x19E00050 = 0x4200CF40;
			*(word32 *) ~0x58BE5905 = 0x4200CF14;
			*(word32 *) 0xA7D0A78C = 0x4200CF14;
			*(word32 *) 2824775711 = 0x4200CF14;
			*(word32 *) 0xA8ECA8B1 = 0x4200CF14;
			*(word32 *) 2843388227 = 0x4200CF14;
			*(word32 *) 0xAA09A9D5 = 0x4200CF14;
			*(word32 *) 2862066280 = 0x4200CF14;
			*(word32 *) ~0x54DA5505 = 0x4200CF14;
			*(word32 *) ~0x544C5473 = 0x4200CF14;
			*(word32 *) 2890050590 = 0x4200CF14;
			g_w4200CF3C = 64649;
			*(word32 *) ~0x59105950 = 0x4200D918;
			g_w4200D91C = ~0x030F;
			g_w4200E91E = 1707;
			((union Eq_2 *) 0x11)->u0 = 0x4200CF94;
			((union Eq_2 *) 0x19)->u0 = 0x4200CF94;
			((union Eq_2 *) 33)->u0 = 0x4200CF94;
			((union Eq_2 *) 0x29)->u0 = 0x4200CF94;
			((union Eq_2 *) 0x31)->u0 = 0x4200CF94;
			*(word32 *) 0x49 = 0x4200CF94;
			((union Eq_2 *) 0x51)->u0 = 0x4200CF94;
			*(word32 *) 0x59 = 0x4200CF94;
			((union Eq_2 *) 0x61)->u0 = 0x4200CF94;
			*(word32 *) 10000020 = 0x4200CF94;
			*(word32 *) 5000028 = 0x4200CF94;
			*(word32 *) ~0x004C4B13 = 0x4200CF94;
			*(word32 *) 4284967348 = 0x4200CF94;
			*(word32 *) 7000076 = 0x4200CF94;
			*(word32 *) 2000084 = 0x4200CF94;
			*(word32 *) ~0x002DC663 = 0x4200CF94;
			g_dw4200CF94 = 0x00;
			g_dw4200CF9C = 0x00;
			g_dw4200CFCC = 0x00;
			g_dw4200CFD4 = 0x00;
			g_dw4200CFFC = 0x00;
			g_dw4200CF98 = 0x00;
			g_dw4200CFA0 = 0x00;
			g_dw4200CFB8 = 0x00;
			g_dw4200CFD0 = 0x00;
			g_dw4200CFD8 = 0x00;
			a4_603 = (struct Eq_69842 *) ~0x007A11FF;
		}
		a4_603->dw0064 = 0x4200CF94;
		goto l2301735E;
	}
	else
	{
		*(word32 *) 560172601 = 0x4200CF40;
		*(word32 *) 0x2171C720 = 0x4200CF40;
		*(word32 *) 0x21800008 = 0x4200CF40;
		*(word32 *) 562968816 = 0x4200CF40;
		*(word32 *) 0x219C71D7 = 0x4200CF40;
		*(word32 *) 0x21AAAABF = 0x4200CF40;
		*(word32 *) 565765030 = 0x4200CF40;
		*(word32 *) 566697102 = 0x4200CF40;
		*(word32 *) 0x21D55575 = 0x4200CF40;
		*(word32 *) 568561245 = 0x4200CF40;
		*(word32 *) 569493316 = 0x4200CF40;
		*(word32 *) 0x2200002C = 0x4200CF40;
		*(word32 *) 571357460 = 0x4200CF40;
		*(word32 *) 0x221C71FB = 0x4200CF40;
		*(word32 *) 0x222AAAE3 = 0x4200CF40;
		*(word32 *) 574153674 = 0x4200CF40;
		*(word32 *) 575085746 = 0x4200CF40;
		*(word32 *) 0x22555599 = 0x4200CF40;
		*(word32 *) 576949889 = 0x4200CF40;
		*(word32 *) 577881960 = 0x4200CF40;
		*(word32 *) 0x22800050 = 0x4200CF40;
		*(word32 *) 2805573362 = 0x4200CF14;
		*(word32 *) ~0x5838587B = 0x4200CF14;
		*(word32 *) 2824185878 = 0x4200CF14;
		*(word32 *) 0xA8E4A8A8 = 0x4200CF14;
		*(word32 *) ~0x568D56C4 = 0x4200CF14;
		*(word32 *) 0xAA00A9CD = 0x4200CF14;
		*(word32 *) ~0x557155A0 = 0x4200CF14;
		*(word32 *) 2870782705 = 0x4200CF14;
		*(word32 *) ~0x5454547B = 0x4200CF14;
		*(word32 *) 0xAC39AC16 = 0x4200CF14;
		g_w4200CF3C = 64640;
		*(word32 *) ~0x59185958 = 0x4200D918;
		g_w4200D91C = 64743;
		g_w4200E91E = 0x0500;
		((union Eq_2 *) 0x09)->u0 = 0x4200CF94;
		((union Eq_2 *) 0x11)->u0 = 0x4200CF94;
		((union Eq_2 *) 0x19)->u0 = 0x4200CF94;
		((union Eq_2 *) 33)->u0 = 0x4200CF94;
		((union Eq_2 *) 0x31)->u0 = 0x4200CF94;
		((union Eq_2 *) 0x39)->u0 = 0x4200CF94;
		((union Eq_2 *) 0x41)->u0 = 0x4200CF94;
		*(word32 *) 0x49 = 0x4200CF94;
		*(word32 *) 0x59 = 0x4200CF94;
		((union Eq_2 *) 0x61)->u0 = 0x4200CF94;
		*(word32 *) 7000012 = 0x4200CF94;
		*(word32 *) 2000020 = 0x4200CF94;
		*(word32 *) 4291967324 = 0x4200CF94;
		*(word32 *) ~0x007A11DB = 0x4200CF94;
		*(word32 *) 6000052 = 0x4200CF94;
		*(word32 *) 1000060 = 0x4200CF94;
		*(word32 *) ~0x003D08BB = 0x4200CF94;
		*(word32 *) ~0x008953F3 = 0x4200CF94;
		g_dw4200CF94 = 0x00;
		g_dw4200CFBC = 0x00;
		g_dw4200CFE4 = 0x00;
		g_dw4200CFFC = 0x00;
		g_dw4200CF98 = 0x00;
		g_dw4200CFC0 = 0x00;
		g_dw4200CFE8 = 0x00;
		a4_456 = (struct Eq_69839 *) 5000000;
		goto l2301713A;
	}
}

