pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 230189EA: Register word32 rf_pri_full_cal(Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rf_pri_init
word32 rf_pri_full_cal(Eq_2 s6, ptr32 fflags, ptr32 frm, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	*(int32 *) 0x40001220 &= -97;
	*(int32 *) 0x40001220 |= 33;
	*(int32 *) 0x40001220 |= 64;
	struct Eq_72951 * a5_27;
	Eq_2 s6_39;
	Eq_2 s3_61;
	Eq_2 s6_64;
	struct Eq_71271 * a5_104;
	Eq_2 s2_113;
	Eq_2 s6_117;
	Eq_2 s9_120;
	word32 a5_195;
	struct Eq_73687 * a5_134 = rf_pri_txcal(rf_pri_rccal(rf_pri_roscal(rf_pri_lo_acal(rf_pri_fcal(rf_pri_start_txdfe(out a5_195), s6, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out a5_27, out s6_39), a5_27, s6_39, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s3_61, out s6_64), s3_61, s6_64, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, dwArg0118), fflags, frm, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg88, dwArg9C, out a5_104, out s2_113, out s6_117, out s9_120), a5_104, s2_113, s6_117, s9_120, dwLoc08, dwArg00, dwArg04, dwArg1C, dwArg4C, dwArg9C, dwArgB8);
	struct Eq_73715 * s0_155 = a5_134->ptr000C;
	(a5_134 | 6)->ptr000C = s0_155;
	s0_155->dw0220 &= -98;
	s0_155->dw0220 &= 0xFE00067D;
	s1Out = s1_139;
	s2Out = s2_142;
	fflagsOut = fflags_107;
	frmOut = frm_108;
	return ra_137;
}

// 23018A5C: Register (ptr32 Eq_73745) rf_pri_restore_cal_reg(Register ui32 a3, Register out ptr32 s1Out, Register out ptr32 s2Out)
// Called from:
//      rf_pri_init
struct Eq_73745 * rf_pri_restore_cal_reg(ui32 a3, ptr32 & s1Out, ptr32 & s2Out)
{
	uint32 a3_24 = a3 & 63 | *((int32 *) 0x40001168) & -64;
	ui32 a3_32 = (a3_24 >> 6 & 63) << 8 | a3_24 & 0xFC0000FF;
	ui32 a2_41 = (a3_32 & ~0x003F0000)->dw0050;
	int32 a3_45 = ((a3_32 & ~0x003F0000) >> 6 & 63) << 24 | (a3_32 & ~0x003F0000) & ~0x3F000000;
	*(int32 *) 0x40001168 = a3_45;
	uint32 a3_52 = a3_45 & 63 | *((int32 *) 0x4000116C) & -64;
	uint32 a3_63 = ((a3_52 >> 6 & 63) << 8 | a3_52 & 0xFC0000FF) & ~0x003F0000 | (a2_41 & 63) << 16;
	*(int32 *) 0x4000116C = (a3_63 >> 6 & 63) << 24 | a3_63 & ~0x3F000000;
	int32 a4_71 = *(int32 *) 0x40001080;
	ui32 a4_77 = (a4_71 & 63) << 24 | a4_71 & ~0x3F000000;
	uint32 a4_84 = a4_77 & 0xFC0000FF & ~0x003F0000;
	*(int32 *) 0x40001080 = (((a4_77 & 0xFC0000FF) >> 6 & 63) << 16 | a4_84) & -64 | a4_84 >> 18 & 63;
	word32 a5_151;
	struct Eq_71890 * a4_100 = rf_pri_txcal_config_hw(a4_71 & ~0x3F000000, out a5_151);
	struct Eq_68109 * a3_105 = g_ptr4200D92C;
	struct Eq_73745 * s0_106 = a4_100->ptr0070;
	((a3_105->t0080 >> 6 & 63) << 16 | ((a3_105->t0080 & 63) << 24 | a4_100 & ~0x3F000000) & ~0x003F0000)->ptr0070 = s0_106;
	struct Eq_68109 * a3_121 = g_ptr4200D92C;
	s0_106->dw0600 = (a3_121->t0080 & 0x007FF000 | s0_106->dw0600 & ~0x007FF000) & -0x0400 | a3_121->dw0084 & 0x03FF;
	s1Out = 0x4200E000;
	s2Out = ~0x003F0000;
	return s0_106;
}

// 23018BC0: Register word32 rf_pri_init(Register up32 s1, Register Eq_65633 a0, Register word32 a1, Register word32 s2, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rfc_init
word32 rf_pri_init(up32 s1, Eq_65633 a0, word32 a1, word32 s2, Eq_2 s6, ptr32 fflags, ptr32 frm, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0118, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	rf_pri_chipv(a1);
	null[(word32) (a0 < 1) / 4] = 0x4200DCE8;
	struct Eq_73932 * a5_33 = *(int32 *) 0x4000F814 & 0xFF0000FF | 0x0300;
	*(struct Eq_73932 **) 0x40010814 = a5_33;
	struct Eq_73941 * a5_40 = a5_33 & ~0x0F000000 | 0x08000000;
	a5_40->ptr0030 = a5_33->ptr0030;
	struct Eq_73989 ** a1_42 = a5_40->ptr0030;
	(a5_40 | 0x01000001)->ptr0030 = a1_42;
	Eq_64837 a5_47 = *(union Eq_64837 *) 0x4000F884;
	*(union Eq_64723 *) 0x40010884 = a5_47 | 4;
	Eq_65633 s0_207 = a0;
	struct Eq_73969 * a5_48 = a5_47 | 4;
	if ((a5_47 | 4) == 0x00)
	{
		word32 s10_279;
		word32 s11_280;
		word32 s5_281;
		word32 s7_282;
		word32 s9_283;
		word32 t0_284;
		word32 t2_285;
		g_t4200C510();
	}
	struct Eq_73974 * a1_84 = a1_42 << 8;
	struct Eq_73977 * a3_77 = a5_48->ptr0064;
	ui32 a5_88 = (a5_48 & 0xF80000FF | a1_84) & -0x00F8 | *((char *) (*a1_42) + 4) << 4;
	(a5_88 | 0x04000002)->ptr0064 = a3_77;
	struct Eq_74030 ** a2_93 = *(a5_88 | 0x04000002);
	a3_77->dw0128 = (a3_77->dw0128 & ~0x007F0000 | a1_84 << 0x10) & ~0x0F000000 | (a1_84->ptr0008)->dw000C << 0x0C | 0x00400000;
	struct Eq_74030 * a6_110 = *a2_93;
	a3_77->dw012C = ((a3_77->dw012C & -0x0800 | a6_110->dw0010 << 4 | a6_110->dw0014) & ~0x007F0000 | 0x0400 | a6_110->dw0018 << 0x10) & ~0x0F000000 | a6_110->dw001C << 0x0C | 0x00400000;
	a3_77->dw0090 |= 0x10000000;
	struct Eq_74080 * a5_134 = a3_77->ptr00B8;
	a3_77->ptr00B8 = a5_134->dw0020 << 4 | a5_134 & -0x0011;
	ui32 a4_145 = (a5_134 & -0x0011) << 1;
	a3_77->dw0138 = a3_77->dw0138 & ~0x03 | a4_145 | a4_145;
	a3_77->dw0138 = a3_77->dw0138 & ~0x00030008 | 0x0300;
	a3_77->dw0130 &= ~0x10000001;
	struct Eq_74127 * a5_161 = *(struct Eq_74127 **) 0x4000E400;
	*(struct Eq_74127 **) 0x4000E400 = a5_161->dw002C << 1 | a5_161 & -3;
	struct Eq_74140 * a5_168 = *(struct Eq_74140 **) 0x4000E418;
	*(struct Eq_74140 **) 0x4000E418 = a5_168->dw0030 << 24 | a5_168 & ~0x03000000;
	struct Eq_74153 * a5_181 = a3_77->ptr008C & ~0x03 | 2;
	a3_77->ptr008C = a5_181;
	(a5_181 & ~0x000F0000 | 0x000C0000)->dw0030 = a5_181->dw0030;
	ui32 a3_191 = rf_pri_set_gain_table_regs();
	*(int32 *) 0x4000E404 |= 0x10000000;
	*(int32 *) 0x4000E41C |= 0x00FF;
	if (s0_207 != 0x00)
	{
		0x00 = dwArg38;
		ptr32 fflags_227;
		ptr32 frm_228;
		ptr32 s1_230;
		ptr32 s2_233;
		word32 ra_229 = rf_pri_full_cal(s6, fflags, frm, dwArg00, dwArg04, dwArg08, dwArg1C, dwArg28, dwArg30, dwArg34, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg78, dwArg7C, dwArg88, dwArg9C, dwArgB8, dwArgE8, dwArg0118, out s1_230, out s2_233, out fflags_227, out frm_228);
		s0Out = s0;
		s1Out = s1_230;
		s2Out = s2_233;
		fflagsOut = fflags_227;
		frmOut = frm_228;
		return ra_229;
	}
	else
	{
		0x00 = dwArg38;
		ptr32 s1_262;
		ptr32 s2_263;
		s0Out = rf_pri_restore_cal_reg(a3_191, out s1_262, out s2_263);
		s1Out = s1_262;
		s2Out = s2_263;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
}

// 23018DC4: void rf_pri_update_power_offset(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_table
void rf_pri_update_power_offset(ptr32 a0)
{
	struct Eq_74221 * a5_10 = null;
	do
	{
		word32 * a2_13 = a5_10[a0 / 4];
		a5_10[276842191] = (struct Eq_74221) a2_13;
		a5_10[276842177] = (struct Eq_74221) a2_13;
		++a5_10;
	} while (a5_10 != (struct Eq_74221 *) 56);
}

// 23018DF8: Register Eq_2 phyif_utils_decode(Register Eq_2 ra, Register (ptr32 Eq_31359) a0, Register (ptr32 byte) a1, Register ptr32 fflags, Register ptr32 frm, Register out (ptr32 byte) a1Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxu_mgt_frame_check
Eq_2 phyif_utils_decode(Eq_2 ra, struct Eq_31359 * a0, byte * a1, ptr32 fflags, ptr32 frm, byte & a1Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 a0_59;
	ui32 a4_9 = (word32) a0->w0006;
	byte * s0_12 = a1;
	ui32 a5_14 = (word32) a0->b0013;
	if ((a4_9 & 0x07) <= 0x01)
	{
		a0 = (struct Eq_31359 *) *(a4_9 & 0x07);
		if (((a4_9 & 0x07) >> 0x0C & 0x0F) <= 0x03)
		{
			Eq_64250 a1_23;
			Eq_2 a0_31;
			Eq_64250 a1_32;
			word32 s9_177;
			word32 s8_176;
			word32 s7_175;
			word32 s4_174;
			word32 s3_173;
			word32 a7_172;
			word32 a5_171;
			word32 a4_170;
			word32 s1_169;
			ra = __muldf3(ra, __floatsidf(0x00 - (int32) ((byte) a5_14), out a1_23), a1_23, g_t23076790, g_t23076794, fflags, frm, out s0_12, out s1_169, out a0_31, out a1_32, out a4_170, out a5_171, out a7_172, out s2, out s3_173, out s4_174, out s5, out s6, out s7_175, out s8_176, out s9_177, out fflags, out frm);
			word32 a5_180;
			word32 a4_179;
			word32 a3_178;
			a0_59 = __fixdfsi(ra, a0_31, a1_32, fflags, frm, out a1, out a3_178, out a4_179, out a5_180);
l23018E24:
			*s0_12 = (byte) (int32) (real32) a0_59;
			a1Out = a1;
			s2Out = s2;
			s5Out = s5;
			s6Out = s6;
			fflagsOut = fflags;
			frmOut = frm;
			return ra;
		}
	}
	a0_59 = (int32) (word16) ((word32) a0->b0014 << 8 | a5_14) ^ 122;
	goto l23018E24;
}

