pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23018E6A: void sysctrl_init()
// Called from:
//      wifi_main
void sysctrl_init()
{
	*(word32 *) 0x80000074 = 0x44900000;
	*(int32 *) 0x449000E0 |= 0x0001FF00;
}

// 23018E8A: void intc_spurious()
void intc_spurious()
{
	assert_err();
}

// 23018EA2: void intc_enable_irq(Register int32 a0)
// Called from:
//      intc_init
void intc_enable_irq(int32 a0)
{
	*(0x01 << a0) = (a0 >> 5) + 0x11244004 << 2;
}

// 23018EB8: void intc_init()
// Called from:
//      wifi_main
void intc_init()
{
	intc_enable_irq(63);
	intc_enable_irq(62);
	intc_enable_irq(61);
	intc_enable_irq(0x18);
	intc_enable_irq(0x19);
	intc_enable_irq(0x1A);
	intc_enable_irq(0x1B);
	intc_enable_irq(0x1C);
	intc_enable_irq(0x1D);
	intc_enable_irq(0x1E);
	intc_enable_irq(0x1F);
	intc_enable_irq(32);
	intc_enable_irq(33);
	intc_enable_irq(35);
	intc_enable_irq(55);
	intc_enable_irq(53);
	intc_enable_irq(50);
	intc_enable_irq(52);
	intc_enable_irq(54);
	intc_enable_irq(0x0A);
	intc_enable_irq(11);
}

// 23018F54: void mac_irq(Register word32 ra, Register (ptr32 code) s0, Register (ptr32 (ptr32 Eq_74432)) a4, Register ptr32 mstatus, Stack word32 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0108)
void mac_irq(word32 ra, <anonymous> * s0, struct Eq_74432 ** a4, ptr32 mstatus, word32 dwArg10, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArg0108)
{
	struct Eq_74432 * a5_5 = *a4;
	if (a4 == null && a5_5->dw0004 == 0x00)
		return;
	word32 a5_16 = *(word32 *) 0x44910040;
	if (s0 != null)
	{
		word32 a3_58;
		Eq_2 ra_30;
		word32 a1_31;
		Eq_2 a0_32;
		word32 s1_59;
		word32 s2_60;
		word32 s3_61;
		word32 s4_62;
		word32 s8_63;
		word32 t3_64;
		word32 tp_65;
		s0();
		ipc_emb_notify(ra_30, a0_32, mstatus, dwArg18, dwArg38, dwArgC4, dwArgE0, dwArgE4, dwArg0108);
	}
	else
		assert_err();
}

// 23018FA4: void bl_irq_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0108)
// Called from:
//      bl_output
void bl_irq_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArg0108)
{
	word32 a5_38;
	ke_evt_set(0x40000000, ipc_host_disable_irq_e2a(), mstatus, out a5_38);
	ipc_emb_notify(ra, 0x40000000, mstatus, dwArg18, dwArg38, dwArgC4, dwArgE0, dwArgE4, dwArg0108);
}

// 23018FBC: Register (ptr32 Eq_74483) blmac_pwr_mgt_setf(Register (ptr32 Eq_74483) a0, Register out ptr32 a5Out)
// Called from:
//      chan_goto_idle_cb
//      chan_tx_cfm
//      chan_ctxt_op_evt
struct Eq_74483 * blmac_pwr_mgt_setf(struct Eq_74483 * a0, ptr32 & a5Out)
{
	if ((a0 << 0x02 & -5) == 0x00)
	{
		ptr32 a5_17 = a0->ptr004C;
		struct Eq_74483 * a0_19 = a0 & ~0x04 | a0 << 0x02;
		a0_19->ptr004C = a5_17;
		a5Out = a5_17;
		return a0_19;
	}
	else
		assert_err();
}

// 23018FFA: Register Eq_2 chan_get_next_chan(Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      chan_cde_evt
//      chan_ctxt_op_evt
//      chan_bcn_to_evt
Eq_2 chan_get_next_chan(Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 a5_15 = 0x44B00000;
	Eq_2 s2_16 = *(union Eq_2 *) 0x44B00120;
	Eq_2 a3_159 = 1107415512;
	if (s0 != 0x00)
	{
		if (s1 != 0x00)
		{
			a4 = (word32) *((word32) s1 + 0x0A);
			a5_15.u0 = 0x02;
			if (a4 == 0x02)
				goto l2301910E;
		}
		a3_159 = *((word32) a5_15 + 0x0044);
		a4 = (word32) s2_16 + 0x01000400 - a5_15;
		if (a4 >= 0x00)
			goto l2301910E;
		a4 = (word32) *((word32) s0 + 22);
		a5_15.u0 = 0x04;
		if (a4 == 0x04)
			goto l2301910E;
	}
	if (s1 != 0x00)
	{
		s1 = *((word16) a5_15.u0 + 4);
		if (a5_15 - a4 < 0x00)
		{
			struct Eq_74563 * a5_40 = (word32) *((word32) s1 + 8);
			a3_159.u0 = 0x05D8;
			a5_15 = a5_40 + 0x05D8;
			if (s0 == 0x00)
				assert_err();
			s1 = a5_40->t05DC;
			a4 = s2_16 + 0x01000400 - (a5_40 + 0x05D8);
			if (a4 >= 0x00)
			{
l230190F4:
				if (s0 == 0x00)
					assert_err();
				goto l2301910E;
			}
			a4 = (word32) *((word32) s0 + 18);
			Eq_2 a2_59 = (word32) *((word32) s0 + 20);
			a3_159.u0 = 0x00;
			if (a2_59 < a4)
			{
				a4 -= a2_59;
				a3_159 = (word32) (word16) a4;
			}
			word32 a5_68 = a5_40 + 0x05D8 - s2_16 >>u 0x0A << 16;
			a5_15 = a5_68 >> 16;
			if (a3_159 >= a5_68 >> 16)
				goto l2301910E;
		}
	}
	a5_15.u0 = 0x4201D14C;
	a4.u0 = 0x00;
	if ((word32) g_b4201D162 != 0x00)
	{
		a4 = (word32) g_w4201D15E;
		s0.u0 = 0x4201D14C;
	}
	if ((word32) g_b4201D17E != 0x00)
	{
		Eq_2 a3_82 = (word32) g_w4201D17A;
		if (a3_82 >= a4)
		{
			a4 = a3_82;
			s0.u0 = 1107415400;
		}
	}
	a3_159 = (word32) g_b4201D19A;
	if (a3_159 != 0x00)
	{
		a5_15 = (word32) g_w4201D196;
		if (a5_15 < a4)
			goto l230190F4;
		s0.u0 = 0x4201D184;
l2301910E:
		0x00 = (uint16) dwArg38;
		a0Out = s0;
		a3Out = a3_159;
		a4Out = a4;
		a5Out = a5_15;
		s2Out = s2_16;
		return s1;
	}
	goto l230190F4;
}

// 23019126: Register Eq_2 chan_conn_less_delay_prog(Register ptr32 mstatus, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_74642 a4Out)
// Called from:
//      chan_ctxt_op_evt
//      chan_scan_req
//      chan_roc_req
Eq_2 chan_conn_less_delay_prog(ptr32 mstatus, ptr32 & a0Out, ptr32 & a1Out, union Eq_74642 & a4Out)
{
	ui32 a4_6 = (word32) g_b4201D248;
	g_b4201D248 = (byte) (a4_6 | 16);
	Eq_2 a1_12 = *(union Eq_2 *) 0x44B00120;
	ptr32 a0_17;
	ptr32 a1_18;
	Eq_74642 a4_29;
	word32 s1_33;
	word32 a2_34;
	word32 a5_35;
	word32 s2_36;
	word32 s3_37;
	word32 s4_38;
	word32 s8_39;
	Eq_2 s0_22 = mm_timer_set(0x4201D230, (word32) a1_12 + 0x07000530, a4_6 | 16, mstatus, out s1_33, out a0_17, out a1_18, out a2_34, out a4_29, out a5_35, out s2_36, out s3_37, out s4_38, out s8_39);
	a0Out = a0_17;
	a1Out = a1_18;
	a4Out = a4_29;
	return s0_22;
}

// 23019156: Register Eq_2 chan_upd_nb_rem_slots.isra.3(Register (ptr32 uint16) a0, Register Eq_2 a1, Register out Eq_74684 a4Out, Register out Eq_2 a5Out)
// Called from:
//      chan_tbtt_schedule
//      chan_ctxt_op_evt
//      chan_bcn_to_evt
Eq_2 chan_upd_nb_rem_slots.isra.3(uint16 * a0, Eq_2 a1, union Eq_74684 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4201D244;
	uint32 a1_11 = a1 - a5_5 >> 0x0A << 16;
	Eq_74684 a4_7 = (word32) *a0;
	Eq_74684 a1_12 = a1_11 >> 16;
	if (a4_7 < a1_11 >> 16)
		a1_12 = a4_7;
	Eq_2 a1_16 = a4_7 - a1_12;
	*a0 = (word16) a1_16;
	a4Out = a4_7;
	a5Out = a5_5;
	return a1_16;
}

// 2301917A: Register Eq_74711 chan_tbtt_detect_conflict.isra.8(Register Eq_74711 a0, Register Eq_74711 a1, Register out Eq_74711 a1Out, Register out Eq_74711 a3Out, Register out Eq_74715 a4Out, Register out Eq_74716 a5Out)
// Called from:
//      chan_tbtt_insert
Eq_74711 chan_tbtt_detect_conflict.isra.8(Eq_74711 a0, Eq_74711 a1, union Eq_74711 & a1Out, union Eq_74711 & a3Out, union Eq_74715 & a4Out, union Eq_74716 & a5Out)
{
	Eq_74711 a0_11;
	Eq_74715 a4_5 = a0 - a1;
	if (a4_5 >= 0x00)
	{
		a5 = (word32) a1.u0 + 0x02FFF800 - a0;
		a0_11.u0 = 0x01;
		if (a5 >= 0x00)
		{
l230191AA:
			a1Out = a1;
			a3Out = a0;
			a4Out = a4_5;
			a5Out = a5;
			return a0_11;
		}
	}
	a1 -= a0;
	a0_11.u0 = 0x00;
	if (a1 >= 0x00)
		a0_11 = ~((word32) a4_5.u0 + 0x02FFF800) >> 31;
	goto l230191AA;
}

// 230191AC: Register ui32 chan_tbtt_insert(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out)
// Called from:
//      chan_tbtt_schedule
ui32 chan_tbtt_insert(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 dwArg0138, Eq_2 dwArg0198, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s9Out, union Eq_2 & s10Out)
{
	Eq_2 a5_126 = 0x4201D000;
	Eq_2 s2_40 = g_t4201D1E8;
	Eq_2 s6_182 = 0x00;
	Eq_2 s0_140 = 0x00;
	Eq_2 s1_136 = 0x00;
	a0_132 = a0;
	while (true)
	{
		word32 s2_142;
		Eq_2 a0_132;
		if (s2_40 == 0x00)
			break;
		if (s2_40 == a0)
			assert_err();
		a5_126 = (word32) *((word32) s2_40 + 0x0A);
		Eq_74711 s4_49 = *((word32) a0 + 4);
		Eq_74711 s5_50 = *((word32) s2_40 + 4);
		if (a5_126 != 0x02)
		{
			a0_132 = chan_tbtt_detect_conflict.isra.8(s4_49, s5_50, out a1, out a3, out a4, out a5_126);
			if (a0_132 != 0x00)
			{
				a4 = (word32) *((word32) a0 + 9);
				a5_126 = (word32) *((word32) s2_40 + 9);
				if (a5_126 >= a4)
					goto l23019264;
				if (s0_140 == 0x00)
					s0_140 = s2_40;
				s1_136 = (word16) s1_136.u0 + 1 & 0x00FF;
				goto l23019248;
			}
			if (s4_49 < s5_50)
				break;
			goto l23019252;
		}
		if (s4_49 < s5_50)
		{
l23019264:
			s0_140 = a0;
			s1_136.u0 = 0x01;
			s2_142 = 0x00;
			goto l230191E8;
		}
		a0_132 = chan_tbtt_detect_conflict.isra.8(s4_49, s5_50, out a1, out a3, out a4, out a5_126);
		if (a0_132 != 0x00)
			goto l23019264;
l23019252:
		s6_182 = s2_40;
l23019248:
		s2_40 = *s2_40;
	}
	s2_142 = 0x01;
l230191E8:
	while (true)
	{
		ui32 s1_95 = (word32) s1_136 - 1;
		if ((s1_95 & 0x00FF) == 0x00FF)
			break;
		if (s0_140 == 0x00)
			assert_err();
		if (s0_140 != a0)
		{
			Eq_2 a5_106 = (word32) *((word32) s0_140 + 0x0A);
			if (a5_106 == 0x01)
			{
				word32 a2_472;
				mm_timer_clear(0x4201D200, a4, out a2_472, out a5_106);
				*((word32) s0_140 + 0x0A) = 0x00;
			}
			co_list_extract(0x4201D1E8, s0_140, a4, a5_106, out a5_126);
		}
		s1_136 = co_list_push_back(s0_140, a5_126);
		a1 = s0_140;
		a0_132.u0 = 0x4201D1F0;
		s0_140 = *s0_140;
	}
	if (s2_142 == 0x00)
	{
		0x00 = (uint16) dwArg0198;
		a0Out = a0_132;
		a1Out = a1;
		a4Out = a4;
		a5Out = a5_126;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s7Out.u0 = <invalid>;
		s9Out.u0 = <invalid>;
		s10Out.u0 = <invalid>;
		return s1_95 & 0x00FF;
	}
	else
	{
		0x00 = (uint16) dwArg0198;
		Eq_2 a0_204;
		Eq_2 a4_206;
		Eq_2 a5_207;
		Eq_2 a1_208;
		ui32 s1_209 = co_list_insert_after(0x4201D1E8, s6_182, dwArg0138, a3, a5_126, out a0_204, out a1_208, out a4_206, out a5_207);
		a0Out = a0_204;
		a1Out = a1_208;
		a4Out = a4_206;
		a5Out = a5_207;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s7Out.u0 = <invalid>;
		s9Out.u0 = <invalid>;
		s10Out.u0 = <invalid>;
		return s1_209;
	}
}

