pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23019304: Register Eq_2 chan_upd_ctxt_status(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_74897 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_switch_start
//      chan_cde_evt
//      chan_goto_idle_cb
//      chan_tx_cfm
Eq_2 chan_upd_ctxt_status(Eq_2 a0, Eq_2 a1, ptr32 mstatus, ptr32 & s1Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_74897 & s3Out, ptr32 & s4Out)
{
	Eq_2 a5_27;
	ui32 a5_13;
	Eq_2 a3_5 = *(union Eq_2 *) 0x44B00120;
	Eq_2 a4_17 = 0x02;
	if (a1 != 0x02)
	{
		a2 = 0x04;
		a5_27.u0 = 0x00;
		if (a1 != 0x04)
			goto l23019324;
		a2 = (word32) *((word32) a0 + 23);
		if (a2 > 0x02)
		{
			a5_13 = (word32) *((word32) a0 + 18) << 0x0A;
			goto l23019322;
		}
		a2 = 1107415512;
		a4_17.u0 = 0x01;
		if ((word32) g_b4201D24A > 0x01)
		{
			a4_17 = (word32) *((word32) a0 + 18);
			Eq_2 a6_19 = (word32) *((word32) a0 + 20);
			if (a6_19 < a4_17)
			{
				a4_17 = (word32) (word16) (a4_17 - a6_19);
				if (a1 < a4_17)
				{
					((word32) a3_5 + 0x006C)->u0 = 1107415512;
					a5_13 = a4_17 << 0x0A;
					goto l23019322;
				}
			}
		}
		a1.u0 = 0x05;
		goto l23019324;
	}
	else
	{
		a4_17 = (word32) *((word32) a0 + 23);
		a5_27.u0 = 0x00;
		if (a1 < a4_17)
			goto l23019324;
		a5_13 = 0x00FFFFA0;
l23019322:
		a5_27 = (word32) a3_5 + a5_13;
l23019324:
		*((word32) a0 + 22) = (byte) a1;
		if (a5_27 != 0x00)
		{
			g_t4201D228 = a0;
			Eq_2 a1_51;
			ptr32 a2_52;
			ptr32 a5_53;
			ptr32 s1_56;
			ptr32 s2_57;
			Eq_74897 s3_58;
			ptr32 s4_59;
			Eq_2 a4_62;
			word32 s8_139;
			word32 a0_138;
			Eq_2 s0_55 = mm_timer_set(0x4201D220, a5_27, 0x4201D000, mstatus, out s1_56, out a0_138, out a1_51, out a2_52, out a4_62, out a5_53, out s2_57, out s3_58, out s4_59, out s8_139);
			s1Out = s1_56;
			a1Out = a1_51;
			a2Out = a2_52;
			a3Out.u0 = <invalid>;
			a4Out = a4_62;
			a5Out = a5_53;
			s2Out = s2_57;
			s3Out = s3_58;
			s4Out = s4_59;
			return s0_55;
		}
		else if (a1 == 0x03)
		{
			s1Out = s1;
			a1Out = a1;
			a2Out = a2;
			a3Out.u0 = <invalid>;
			a4Out = a4_17;
			a5Out = 0x03;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			return s0;
		}
		else
		{
			ptr32 a2_71;
			ptr32 a5_72;
			Eq_2 a1_70 = mm_timer_clear(0x4201D220, a4_17, out a2_71, out a5_72);
			s1Out = s1;
			a1Out = a1_70;
			a2Out = a2_71;
			a3Out.u0 = <invalid>;
			a4Out = a4_17;
			a5Out = a5_72;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			return s0;
		}
	}
}

// 230193A2: Register Eq_2 chan_switch_start(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out Eq_75015 s1Out, Register out (ptr32 Eq_75016) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_75019 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_conn_less_delay_evt
//      chan_tbtt_schedule
//      chan_cde_evt
//      chan_ctxt_op_evt
//      chan_roc_req
//      chan_bcn_to_evt
//      chan_ctxt_link
//      chan_ctxt_unlink
Eq_2 chan_switch_start(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, union Eq_75015 & s1Out, struct Eq_75016 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_75019 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a5_107;
	Eq_2 a5_6 = *((word32) a3 + 32);
	if (a3 == a0)
	{
		a4 = (word32) *((word32) a5_6 + 114);
		a5_107.u0 = 0x01;
		if (a4 > 0x01)
		{
			a4 = (word32) *((word32) a3 + 23);
			a5_107.u0 = 0x02;
			if (a4 <= 0x02)
			{
				struct Eq_75016 * a1_77;
				ptr32 a2_78;
				Eq_2 a3_79;
				Eq_75019 a4_80;
				Eq_2 a5_81;
				Eq_75015 s1_84;
				ptr32 s2_85;
				ptr32 s3_86;
				ptr32 s4_87;
				s0Out = chan_upd_ctxt_status(a0, 0x04, mstatus, out s1_84, out a1_77, out a2_78, out a3_79, out a4_80, out a5_81, out s2_85, out s3_86, out s4_87);
				s1Out = s1_84;
				a1Out = a1_77;
				a2Out = a2_78;
				a3Out = a3_79;
				a4Out = a4_80;
				a5Out = a5_81;
				s2Out = s2_85;
				s3Out = s3_86;
				s4Out = s4_87;
				return ra;
			}
		}
	}
	else
	{
		a5_107 = *((word32) a3 + 36);
		if (a3 == 0x00)
		{
			*((word32) a0 + 36) = a5_107;
			Eq_2 a4_19;
			word32 s3_161;
			word32 s2_160;
			word32 a5_159;
			word32 a3_158;
			word32 a2_157;
			word32 a1_156;
			word32 s1_155;
			word32 s4_162;
			chan_upd_ctxt_status(a0, 0x02, mstatus, out s1_155, out a1_156, out a2_157, out a3_158, out a4_19, out a5_159, out s2_160, out s3_161, out s4_162);
			Eq_2 a0_33;
			word32 s0_163;
			word32 s1_164;
			word32 a1_165;
			word32 a2_166;
			word32 a3_167;
			word32 a4_168;
			word32 a5_169;
			word32 a6_170;
			word32 s2_171;
			word32 s3_172;
			word32 s4_173;
			word32 s8_174;
			Eq_2 ra_40 = ke_msg_alloc(ra, 96, 0x00, 0x04, a4_19, mstatus, dwArg08, out s0_163, out s1_164, out a0_33, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out a6_170, out s2_171, out s3_172, out s4_173, out s8_174);
			g_t230199EC = a0_33;
			ptr32 a2_57;
			Eq_2 a3_58;
			Eq_75019 a4_59;
			Eq_2 a5_60;
			Eq_75015 s1_63;
			ptr32 s2_64;
			ptr32 s3_65;
			ptr32 s4_66;
			struct Eq_75016 * a1_70;
			word32 a0_175;
			word32 s8_176;
			s0Out = ke_msg_send(a0_33, mstatus, out s1_63, out a0_175, out a1_70, out a2_57, out a3_58, out a4_59, out a5_60, out s2_64, out s3_65, out s4_66, out s8_176);
			s1Out = s1_63;
			a1Out = a1_70;
			a2Out = a2_57;
			a3Out = a3_58;
			a4Out = a4_59;
			a5Out = a5_60;
			s2Out = s2_64;
			s3Out = s3_65;
			s4Out = s4_66;
			return ra_40;
		}
	}
	s0Out = s0;
	s1Out = s1;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_107;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return ra;
}

