pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 230193FE: void chan_conn_less_delay_evt(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void chan_conn_less_delay_evt(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_22;
	ui32 a5_24;
	ui32 a5_10 = (word32) g_b4201D248;
	if ((a5_10 & 1) != 0x00)
	{
		if ((a5_10 & 0x04) != 0x00)
			assert_err();
		a5_24 = (word32) g_b4201D248 & ~0x01 | 4;
		g_b4201D248 = (byte) a5_24;
		a0_22.u0 = 1107415484;
	}
	else
	{
		if ((a5_10 & 2) == 0x00)
			return;
		if ((a5_10 & 0x08) != 0x00)
			assert_err();
		a5_24 = (word32) g_b4201D248 & ~0x02 | 8;
		g_b4201D248 = (byte) a5_24;
		a0_22.u0 = 0x4201D1A0;
	}
	if (a5_24 != 0x00)
		return;
	word32 s3_150;
	word32 s4_151;
	word32 a5_148;
	word32 s2_149;
	word32 a3_146;
	word32 a4_147;
	word32 a1_144;
	word32 a2_145;
	word32 s0_142;
	word32 s1_143;
	chan_switch_start(ra, a0_22, a3, mstatus, dwArg08, out s0_142, out s1_143, out a1_144, out a2_145, out a3_146, out a4_147, out a5_148, out s2_149, out s3_150, out s4_151);
}

word32 g_dw2301945A = 2619155;
// 2301949C: Register Eq_2 chan_tbtt_switch_evt(Register Eq_2 ra, Register (ptr32 Eq_75239) a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out ptr32 s0Out, Register out (ptr32 Eq_75239) s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_75246 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_tbtt_schedule
Eq_2 chan_tbtt_switch_evt(Eq_2 ra, struct Eq_75239 * a0, ptr32 mstatus, Eq_2 dwArg08, ptr32 & s0Out, struct Eq_75239 & s1Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_75246 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 s0_147 = 0x4201D000;
	Eq_2 s3_16 = *(union Eq_2 *) 0x44B00120;
	ptr32 a4_140 = (word32) g_b4201D24A;
	if (a4_140 > 0x01)
	{
		s0_147 = 1107415512;
		if (((word32) g_b4201D248 & 0x0C) == 0x00)
		{
			struct Eq_75270 * a4_24 = (word32) a0->b0008;
			a3.u0 = 0x05D8;
			a4_140 = (char *) a4_24 + 0x05D8;
			s2 = a4_24->t4201AA28;
			s0_147 = a4_24->ptr4201AA0C;
			if (a4_24 == &g_t4201A9E8 || (char *) a4_24 + 1107405288 == s2)
			{
				a0->b0009 = 0x00;
				struct Eq_75295 * s0_35 = a0->ptr0020;
				word32 a5_183;
				word32 a4_182;
				a1 = chan_upd_nb_rem_slots.isra.3(&a0->b000A + 8, s3_16, out a4_182, out a5_183);
				ptr32 a5_43 = (word32) *((word32) s2 + 20);
				s1 = a0;
				a3.u0 = 0x0A;
				a4_140 = a5_43;
				if (a5_43 > 0x0A)
					a4_140 = 0x0A;
				((word32) s2 + 20)->u0 = (word16) (a5_43 - a4_140);
				s0_35->t006C = s3_16;
				a0->b000A = 0x02;
				s0_147 = *(ptr32 *) 0x26;
				if (false)
				{
					ptr32 a1_84;
					ptr32 a2_85;
					Eq_75246 a3_86;
					ptr32 a4_87;
					ptr32 s0_90;
					struct Eq_75239 * s1_91;
					Eq_2 s2_92;
					Eq_2 s3_93;
					ptr32 s4_94;
					word32 a5_184;
					Eq_2 ra_89 = chan_switch_start(ra, s2, 0x0A, mstatus, dwArg08, out s0_90, out s1_91, out a1_84, out a2_85, out a3_86, out a4_87, out a5_184, out s2_92, out s3_93, out s4_94);
					s0Out = s0_90;
					s1Out = s1_91;
					a1Out = a1_84;
					a2Out = a2_85;
					a3Out = a3_86;
					a4Out = a4_87;
					s2Out = s2_92;
					s3Out = s3_93;
					s4Out = s4_94;
					return ra_89;
				}
			}
		}
	}
	s0Out = s0_147;
	s1Out = s1;
	a1Out = a1;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4_140;
	s2Out = s2;
	s3Out = s3_16;
	s4Out = dwArg04;
	return ra;
}

word32 g_dw230194C8 = 2343634692;
// 23019542: Register Eq_2 chan_tbtt_schedule(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_75376 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out)
// Called from:
//      chan_tbtt_switch_update
//      chan_bcn_to_evt
//      chan_ctxt_unlink
Eq_2 chan_tbtt_schedule(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_75376 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s9Out, union Eq_2 & s10Out)
{
	Eq_2 s1_100;
	s1_100 = s1;
	if (a0 != 0x00)
	{
		s3 = 0x4201D000;
		word32 s10_34;
		word32 s2_36;
		word32 s7_41;
		word32 s9_42;
		word32 s3_353;
		word32 s4_354;
		word32 s5_355;
		word32 s6_356;
		Eq_2 a5_30;
		s1_100 = (word32) chan_tbtt_insert(a0, a3, a4, dwArg0118, dwArg0178, out a0, out a1, out a4, out a5_30, out s2_36, out s3_353, out s4_354, out s5_355, out s6_356, out s7_41, out s9_42, out s10_34) + 1040;
		int32 s4_105 = 0x05D8;
		s2 = s2_36 + -224;
		Eq_75421 s5_106 = 432;
		up32 s6_107 = 0x04;
		while (a5_30 != 0x00)
		{
			int32 a5_67;
			word32 a5_357;
			struct Eq_75442 * a5_64 = (word32) s1_100 + ((word32) (*((word32) co_list_pop_front(a4, a5_30, out a5_357) + 8)) + s4_105);
			Eq_2 a4_65 = (word32) a5_64->b0056;
			if (a4_65 == 0x00)
				a5_67 = (word32) s2.u0 + ((word32) s5_106 + (word32) a5_64->b0060) + 4;
			else
				a5_67 = (word32) a5_64->w033E << 0x0A;
			Eq_2 a0_76 = *((word32) a4_65 + 4);
			(word32) a4_65 + a5_67 + 4 = (ui32) a0_76;
			up32 a5_80 = (word32) *((word32) a0_76 + 9);
			if (s6_107 >= a5_80)
				((word32) a0_76 + 9)->u1 = (byte) (a5_80 + 0x01);
			word32 s10_101;
			word32 s7_108;
			word32 s9_109;
			s1_100 = chan_tbtt_insert(a0_76, a3, a4_65, dwArg0118, dwArg0178, out a0, out a1, out a4, out a5_30, out s2, out s3, out s4_105, out s5_106, out s6_107, out s7_108, out s9_109, out s10_101);
		}
	}
	word32 s0_116 = *((word32) a0 + 16);
	if (a0 != 0x00 && (word32) (*((word32) a0 + 0x0A)) == 0x00)
	{
		Eq_2 a4_119 = *(union Eq_2 *) 0x44B00120;
		struct Eq_75239 * a0_120 = *(struct Eq_75239 **) 0x44B00004;
		if (0x44B00000 - a4_119 >= ~0x07CF)
		{
			a0_120->dw0030 = s0_116;
			a0_120->b000A = 0x01;
			0x00 = (uint16) dwArgA8;
			Eq_2 a1_147;
			ptr32 a2_148;
			Eq_2 s1_152;
			Eq_75376 s2_153;
			ptr32 s3_154;
			ptr32 s4_155;
			Eq_2 a4_158;
			word32 a0_358;
			word32 a5_359;
			word32 s8_360;
			s0Out = mm_timer_set(0x4201D200, a1, a4_119, mstatus, out s1_152, out a0_358, out a1_147, out a2_148, out a4_158, out a5_359, out s2_153, out s3_154, out s4_155, out s8_360);
			s1Out = s1_152;
			a1Out = a1_147;
			a2Out = a2_148;
			a3Out = a3;
			a4Out = a4_158;
			s2Out = s2_153;
			s3Out = s3_154;
			s4Out = s4_155;
			s5Out.u0 = <invalid>;
			s6Out.u0 = <invalid>;
			s7Out.u0 = <invalid>;
			s9Out.u0 = <invalid>;
			s10Out.u0 = <invalid>;
			return ra;
		}
		else
		{
			0x00 = (uint16) dwArgA8;
			ptr32 a2_171;
			Eq_2 a4_172;
			Eq_2 s0_175;
			ptr32 s3_176;
			ptr32 s4_177;
			Eq_2 a1_181;
			Eq_2 a3_182;
			Eq_2 s1_183;
			Eq_75376 s2_184;
			Eq_2 ra_185 = chan_tbtt_switch_evt(ra, a0_120, mstatus, dwArg08, out s0_175, out s1_183, out a1_181, out a2_171, out a3_182, out a4_172, out s2_184, out s3_176, out s4_177);
			s0Out = s0_175;
			s1Out = s1_183;
			a1Out = a1_181;
			a2Out = a2_171;
			a3Out = a3_182;
			a4Out = a4_172;
			s2Out = s2_184;
			s3Out = s3_176;
			s4Out = s4_177;
			s5Out.u0 = <invalid>;
			s6Out.u0 = <invalid>;
			s7Out.u0 = <invalid>;
			s9Out.u0 = <invalid>;
			s10Out.u0 = <invalid>;
			return ra_185;
		}
	}
	else
	{
		0x00 = (uint16) dwArgA8;
		s0Out = s1;
		s1Out = s1_100;
		a1Out = a1;
		a2Out = dwArg48;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s7Out.u0 = <invalid>;
		s9Out.u0 = <invalid>;
		s10Out.u0 = <invalid>;
		return ra;
	}
}

// 2301963A: Register Eq_2 chan_cde_evt(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Register out (ptr32 Eq_75581) s0Out, Register out (ptr32 Eq_75581) s1Out, Register out (ptr32 Eq_75583) a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_75586) s2Out, Register out Eq_2 s3Out)
// Called from:
//      chan_tx_cfm
//      chan_ctxt_op_evt
//      chan_ctxt_link
//      chan_ctxt_unlink
Eq_2 chan_cde_evt(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, struct Eq_75581 & s0Out, struct Eq_75581 & s1Out, struct Eq_75583 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_75586 & s2Out, union Eq_2 & s3Out)
{
	struct Eq_75581 * s1_260;
	struct Eq_75586 * s2_17 = &g_t4201D000;
	Eq_2 s3_18 = *(union Eq_2 *) 0x44B00120;
	Eq_2 a4_20 = (word32) g_b4201D24A;
	s1_260 = s1;
	if (a4_20 > 0x01)
	{
		s2_17 = &g_t4201D1D8;
		s1_260 = s1;
		if (((word32) g_b4201D248 & 44) == 0x00)
		{
			struct Eq_75611 * a2_34;
			struct Eq_75612 * s2_39;
			word32 s3_40;
			word32 a5_561;
			word32 a4_560;
			word32 s8_563;
			word32 s4_562;
			word32 a0_558;
			word32 a1_559;
			Eq_2 s1_216;
			Eq_2 s0_312 = mm_timer_set(0x4201D210, (word32) s3_18 + g_dw4201D240, a4_20, mstatus, out s1_216, out a0_558, out a1_559, out a2_34, out a4_560, out a5_561, out s2_39, out s3_40, out s4_562, out s8_563);
			Eq_2 a5_47 = g_t4201AFC8;
			s2_39->dw006C = s3_40;
			s3_18.u0 = 0x00;
			while (a5_47 != 0x00)
			{
				struct Eq_75645 * a5_57 = a2_34->ptr0040;
				if (a2_34 != null)
				{
					s0_312 = (word32) s0_312 + 1 & 0x00FF;
					if (((word32) g_a4201A3A5[(word32) a5_57->b0057] & 0x03) != 0x00 || (word32) a5_57->b0058 == 0x00)
						s3_18 = (word16) s3_18.u0 + 1 & 0x00FF;
					a2_34->w0010 = 0x00;
					a2_34->w0014 = 0x00;
				}
				a5_47 = a5_57->t0000;
			}
			if (s0_312 != s2_39->t0068 >> 0x0CFFF800)
				assert_warn();
			ui32 s0_105;
			if (s3_18 != 0x00 && s0_312 != s3_18)
			{
				a1 = (struct Eq_75583 *) 0x0A;
				s0_105 = (word32) (word16) (s0_312 - s3_18 + 40) ^ s3_18;
			}
			else
			{
				s0_105 = 0x00;
				a1 = (struct Eq_75583 *) 50;
			}
			Eq_2 a4_116 = g_t4201AFC8;
			Eq_2 s0_125 = s0_105 + 50;
			while (a4_116 != 0x00)
			{
				struct Eq_75709 * a4_129 = g_ptr4201A3A0;
				if (true)
				{
					ui32 a5_140;
					ui32 a2_136 = (word32) g_a4201A3A5[(word32) a4_129->b0057];
					word32 a5_131 = (word32) g_w4201A370;
					ui32 a2_137 = a2_136 & 0x03;
					if ((a2_136 & 0x03) == 0x00)
					{
						a2_137 = (word32) a4_129->b0058;
						if (a2_137 == 0x00)
							goto l23019794;
						a5_140 = a1 + a5_131 / 25;
					}
					else
					{
l23019794:
						a5_140 = (word32) s0_125 + a5_131;
					}
					uint32 a5_146 = a5_140 << 16;
					g_w4201A370 = (word16) (a5_146 >> 16);
					g_w4201A372 = (word16) (a5_146 >> 16);
					if ((word32) a4_129->b0056 != 0x00)
						a2_137 = (word32) a4_129->w033E << 0x0A;
					uint32 a5_172 = s2_39->t0068 >> a2_137;
					if (a5_172 == 0x00)
						a5_172 = 0x01;
					g_w4201A374 = (word16) ((a5_172 & 0x00FF) + 0x0A + (word32) g_w4201A374);
				}
				a4_116 = a4_129->t0000;
			}
			Eq_2 a0_193 = s2_39->t0020;
			if (a0_193 != 0x00)
			{
				word32 s4_569;
				word32 s2_568;
				word32 a5_567;
				word32 a2_565;
				word32 a3_566;
				s0_125 = chan_upd_ctxt_status(a0_193, 0x01, mstatus, out s1_216, out a1, out a2_565, out a3_566, out a4_116, out a5_567, out s2_568, out s3_18, out s4_569);
			}
			word32 a5_564;
			Eq_2 a0_253;
			s1_260 = chan_get_next_chan(s0_125, s1_216, a4_116, dwArg18, out a0_253, out a3, out a4_20, out a5_564, out s2_17);
			if (s1_260 == null)
			{
				word32 a2_570;
				word32 a5_571;
				word32 s4_572;
				struct Eq_75583 * a1_295;
				Eq_2 a3_297;
				Eq_2 a4_298;
				struct Eq_75581 * s0_301;
				struct Eq_75581 * s1_302;
				struct Eq_75586 * s2_303;
				Eq_2 s3_304;
				Eq_2 ra_300 = chan_switch_start(ra, a0_253, a3, mstatus, dwArg08, out s0_301, out s1_302, out a1_295, out a2_570, out a3_297, out a4_298, out a5_571, out s2_303, out s3_304, out s4_572);
				s0Out = s0_301;
				s1Out = s1_302;
				a1Out = a1_295;
				a3Out = a3_297;
				a4Out = a4_298;
				s2Out = s2_303;
				s3Out = s3_304;
				return ra_300;
			}
			s2_17->t0024 = a0_253;
		}
	}
	s0Out = s1;
	s1Out = s1_260;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4_20;
	s2Out = s2_17;
	s3Out = s3_18;
	return ra;
}

word32 g_dw23019676 = 3577185450;
// 230197F8: void chan_pre_switch_channel(Register Eq_2 ra, Register (ptr32 Eq_75859) s1, Register Eq_2 a4, Register Eq_2 s2, Register (ptr32 Eq_63365) s3, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0138, Stack word32 dwArg0178)
// Called from:
//      chan_goto_idle_cb
//      chan_tx_cfm
void chan_pre_switch_channel(Eq_2 ra, struct Eq_75859 * s1, Eq_2 a4, Eq_2 s2, struct Eq_63365 * s3, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0138, word32 dwArg0178)
{
	word32 a2_878;
	word32 a5_879;
	mm_timer_clear(0x4201D220, a4, out a2_878, out a5_879);
	struct Eq_75885 * s0_28 = &g_t4201D1D8;
	if (((word32) g_b4201D248 & 32) != 0x00)
	{
		struct Eq_75894 * a5_30 = (word32) g_b4201D24A;
		a4.u0 = 0x01;
		if (a5_30 > (struct Eq_75894 *) 0x01)
		{
			s0_28 = a5_30->ptr0024;
			if (a5_30 != null)
			{
				a5_30->b0016 = 0x01;
				s0_28->dw0024 = 0x00;
			}
		}
		s0_28->b0070 = (byte) ((word32) s0_28->b0070 & -33);
	}
	struct Eq_75924 * a5_48;
	ui32 a5_42 = (word32) s0_28->b0070;
	Eq_2 s0_45 = *((word16) a4.u0 + 36);
	if ((a5_42 & 8) == 0x00)
	{
		if ((a5_42 & 0x04) == 0x00)
		{
			if (a4 == 0x00)
			{
				up32 a4_50 = (word32) *((word32) s0_45 + 114);
				a5_48 = (struct Eq_75924 *) 0x01;
				if (a4_50 > 0x01)
				{
					word32 s0_908;
					word32 s2_912;
					word32 a1_909;
					word32 a3_910;
					word32 a4_911;
					ra = chan_cde_evt(ra, mstatus, s2, dwLoc08, out s0_908, out s1, out a1_909, out a3_910, out a4_911, out s2_912, out s3);
				}
				else if (a4_50 == 0x01)
				{
					s0_45 = *(union Eq_2 *) 0x09;
l2301986C:
					a5_48->t0024 = s0_45;
					goto l2301988C;
				}
			}
l2301988C:
			if (s1 == null)
				return;
			struct Eq_75954 * a4_223;
			ptr32 fflags_143;
			ptr32 frm_144;
			Eq_2 s0_146;
			Eq_2 s1_147;
			struct Eq_75959 * s2_149;
			word32 s3_880;
			Eq_2 ra_145 = phy_set_channel(ra, (word32) s1->b0004, (word32) s1->b0005, (word32) s1->w0008, s3, fflags, frm, s4, dwArg04, dwArg0138, out s0_146, out s1_147, out s2_149, out s3_880, out fflags_143, out frm_144);
			word32 a4_881;
			word32 a5_882;
			tpc_update_tx_power(ra_145, fflags_143, frm_144, out a4_881, out a5_882);
			s2_149->dw00DC = 0x10;
			*((word32) s1_147 + 32) = s0_146;
			((word32) s0_146 + 36)->u0 = 0x00;
			struct Eq_76000 * s2_194;
			word32 a4_886;
			word32 a5_887;
			word32 s3_888;
			word32 s4_889;
			word32 a3_885;
			word32 a1_883;
			word32 a2_884;
			Eq_2 s1_193;
			Eq_2 s0_192 = chan_upd_ctxt_status(s1_147, 0x04, mstatus, out s1_193, out a1_883, out a2_884, out a3_885, out a4_886, out a5_887, out s2_194, out s3_888, out s4_889);
			word32 a5_199 = (word32) *((word32) s1_193 + 23);
			if (a5_199 != 0x03)
			{
				a4_223 = (struct Eq_75954 *) 0x04;
				if (a5_199 == 0x04)
					goto l230198FA;
				if ((word32) g_b42018EB0 == 0x00 || (g_dw42018EB4 & 0x08) != 0x00)
				{
					Eq_2 s2_232 = g_t4201AFC8;
					Eq_2 s3_234 = *((word32) s0_192 + 32);
					word32 a5_893;
					blmac_pwr_mgt_setf(null, out a5_893);
					while (s2_232 != 0x00)
					{
						if (s3_234 == *((word32) s2_232 + 64) && ((word32) (*((word32) s2_232 + 86)) == 0x00 && (word32) (*((word32) s2_232 + 88)) != 0x00))
						{
							word32 s7_901;
							word32 s5_899;
							word32 s6_900;
							word32 a0_894;
							word32 a3_895;
							word32 a4_896;
							word32 a5_897;
							word32 s4_898;
							ra_145 = txl_frame_send_null_frame(ra_145, (word32) *((word32) s2_232 + 96), null, fflags_143, frm_144, mstatus, dwArg28, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178, out s0_192, out s1_193, out a0_894, out a3_895, out a4_896, out a5_897, out s2_232, out s3_234, out s4_898, out s5_899, out s6_900, out s7_901);
						}
						s2_232 = *s2_232;
					}
				}
				a4_223 = (word32) *((word32) s1_193 + 23);
				if (a4_223 > (struct Eq_75954 *) 0x02)
				{
l230198FA:
					__csrrc(mstatus, 0x08);
					(a4_223 | 2)->dw0004 = a4_223->dw0004;
					__csrrs(mstatus, 0x08);
					((word32) s0_192 + 115)->u1 = (byte) (*(uint32 *) 0x44B0004C >> 2 & 0x01);
					word32 a5_890;
					blmac_pwr_mgt_setf(null, out a5_890);
					goto l23019990;
				}
				Eq_2 s2_291 = g_t4201AFC8;
				int32 s3_293 = 1107403616;
				Eq_76090 s4_294 = 36;
				Eq_2 s5_295 = 0x01;
				while (s2_291 != 0x00)
				{
					if (s1_193 == *((word32) s2_291 + 64))
					{
						((word32) s4_294 + (word32) (*((word32) s2_291 + 87)) + s3_293)->b0023 = (byte) s5_295;
						ra_145 = vif_mgmt_send_postponed_frame(ra_145, s2_291, s5_295, mstatus, dwArg48, dwArg58, dwArg8C, dwArgF8, out s1_193, out s2_291, out s3_293, out s4_294, out s5_295);
					}
					s2_291 = *s2_291;
				}
			}
			else
			{
				s2_194->dw0220 = 0x00;
				word32 s8_907;
				word32 a0_902;
				word32 a3_903;
				word32 s2_904;
				word32 s3_905;
				word32 s4_906;
				ke_msg_send_basic(ra_145, 97, 0x02, 0x03, mstatus, s2, out s0_192, out s1_193, out a0_902, out a3_903, out s2_904, out s3_905, out s4_906, out s8_907);
			}
			a4_223 = (word32) *((word32) s1_193 + 23);
			if (a4_223 <= (struct Eq_75954 *) 0x02)
			{
l23019990:
				word32 a4_891;
				word32 s2_892;
				mm_active(mstatus, out a4_891, out s2_892);
				return;
			}
			goto l230198FA;
		}
		a5_48 = &g_t4201D1BC;
	}
	else
		a5_48 = &g_t4201D1A0;
	if (a4 != 0x00)
		((word16) a4.u0 + 22)->u1 = 0x01;
	goto l2301986C;
}

// 230199EC: void chan_goto_idle_cb(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Stack word32 dwArg0138, Stack word32 dwArg0168, Stack word32 dwArg0178)
void chan_goto_idle_cb(Eq_2 ra, Eq_2 a4, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0128, word32 dwArg0138, word32 dwArg0168, word32 dwArg0178)
{
	word32 s2_484;
	word32 s4_485;
	struct Eq_75859 * s1_102;
	struct Eq_63365 * s3_104;
	Eq_2 a4_152;
	Eq_2 ra_116 = mm_force_idle_req(ra, a4, mstatus, dwLoc18, dwLoc10, dwLoc0C, dwArg18, dwArg3C, dwArgD8, dwArgE8, out s1_102, out a4_152, out s2_484, out s3_104, out s4_485);
	Eq_2 s2_103 = s1_102->t01F8;
	if (s2_103 != 0x00)
	{
		s1_102 = &s1_102->b0071 + 359;
		if (((word32) s1_102->b0248 & 32) == 0x00)
		{
			a4_152 = (word32) g_b42018EB0;
			if (a4_152 == 0x00 || (g_dw42018EB4 & 0x08) != 0x00)
			{
				Eq_2 s0_128 = g_t4201AFC8;
				s3_104 = null;
				Eq_2 a5_234;
				Eq_2 a0_192 = blmac_pwr_mgt_setf((struct Eq_74483 *) 0x01, out a5_234);
				Eq_2 s4_105 = 0x00FF;
				word32 s5_106 = 0x06;
				word32 s6_107 = 0x2301A000;
				while (s0_128 != 0x00)
				{
					Eq_2 s0_101 = *((word32) a5_234 + 64);
					if (s2_103 == a5_234)
					{
						a5_234 = (word32) *((word32) s0_101 + 86);
						if (a5_234 == 0x00)
						{
							a5_234 = (word32) *((word32) s0_101 + 88);
							if (a5_234 != 0x00)
							{
								a5_234 = (word32) *((word32) s0_101 + 96);
								if (a5_234 != s4_105)
								{
									*((word32) s2_103 + 22) = (byte) s5_106;
									word32 s7_119;
									word32 a3_497;
									ra_116 = txl_frame_send_null_frame(ra_116, (word32) *((word32) s0_101 + 96), s6_107 + -1330, fflags, frm, mstatus, dwArg18, dwArg48, dwArg7C, dwArg98, dwArgB8, dwArgD8, dwArg0168, out s0_101, out s1_102, out a0_192, out a3_497, out a4_152, out a5_234, out s2_103, out s3_104, out s4_105, out s5_106, out s6_107, out s7_119);
									if (a0_192 == 0x00)
										s3_104 = (struct Eq_63365 *) ((char *) s3_104 + 1);
									*((word32) s2_103 + 22) = (byte) s7_119;
								}
							}
						}
					}
					s0_128 = *s0_101;
				}
				s1_102->b0071 = (byte) s3_104;
				if (s3_104 != null)
				{
					word32 s1_486;
					word32 a1_487;
					word32 a2_488;
					word32 a3_489;
					word32 s3_493;
					word32 a5_491;
					word32 s2_492;
					word32 a4_490;
					word32 s4_494;
					chan_upd_ctxt_status(a0_192, 0x03, mstatus, out s1_486, out a1_487, out a2_488, out a3_489, out a4_490, out a5_491, out s2_492, out s3_493, out s4_494);
					0x00 = dwArg0128;
					word32 a4_495;
					word32 s2_496;
					mm_active(mstatus, out a4_495, out s2_496);
					return;
				}
			}
		}
	}
	0x00 = dwArg0128;
	chan_pre_switch_channel(ra_116, s1_102, a4_152, s2_103, s3_104, dwArg78, fflags, frm, mstatus, dwArg04, dwArg28, dwArg48, s5, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0138, dwArg0178);
}

// 23019ACE: void chan_tx_cfm(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0138, Stack word32 dwArg0178)
void chan_tx_cfm(Eq_2 ra, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0138, word32 dwArg0178)
{
	if ((word32) g_b4201D249 != 0x00)
	{
		ui32 a5_19 = (word32) g_b4201D249 + ~0x00 & 0x00FF;
		g_b4201D249 = (byte) a5_19;
		if (a5_19 != 0x00)
			return;
		Eq_2 a4_30;
		struct Eq_75859 * s1_36;
		Eq_2 s2_39;
		struct Eq_63365 * s3_40;
		Eq_2 s4_41;
		Eq_2 ra_34 = mm_force_idle_req(ra, a4, mstatus, dwArg08, dwArg10, dwArg14, dwArg38, dwArg5C, dwArgF8, dwArg0108, out s1_36, out a4_30, out s2_39, out s3_40, out s4_41);
		chan_pre_switch_channel(ra_34, s1_36, a4_30, s2_39, s3_40, s4_41, fflags, frm, mstatus, dwArg04, dwArg28, dwArg48, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0138, dwArg0178);
	}
	else
		assert_err();
}

