pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 23019B24: Register Eq_2 chan_ctxt_op_evt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_76494) s0Out, Register out (ptr32 Eq_76495) s2Out)
// Called from:
//      chan_roc_req
Eq_2 chan_ctxt_op_evt(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArgE8, Eq_2 dwArgF8, struct Eq_76494 & s0Out, struct Eq_76495 & s2Out)
{
	struct Eq_76495 * s2_15 = (word32) *((word32) a0 + 22);
	if (s2_15 >= (struct Eq_76495 *) 0x02)
	{
		if (s2_15 > (struct Eq_76495 *) 0x03)
		{
			if (s2_15 == (struct Eq_76495 *) 0x04)
			{
				Eq_2 a0_179;
				struct Eq_76517 * a4_24 = (word32) *((word32) a0 + 23);
				Eq_2 s1_202 = a0;
				struct Eq_76523 * s0_27 = &g_t4201D1D8;
				if (a4_24 <= (struct Eq_76517 *) 0x02)
				{
					((word32) a0 + 22)->u1 = 0x01;
					up32 a4_185 = (word32) g_b4201D24A;
					if (a4_185 != 0x01 && a4_185 > 0x01)
					{
						Eq_2 s2_187 = *(union Eq_2 *) 0x44B00120;
						Eq_2 a4_191;
						word32 a5_437;
						chan_upd_nb_rem_slots.isra.3((word32) a0 + 18, s2_187, out a4_191, out a5_437);
						g_t4201D244 = s2_187;
						Eq_2 a0_194;
						word32 s2_440;
						word32 a4_438;
						word32 a5_439;
						chan_get_next_chan(1107415512, a0, a4_191, dwArg18, out a0_194, out a3, out a4_438, out a5_439, out s2_440);
						s1_202 = a0_194;
					}
					a0_179 = s1_202;
				}
				else
				{
					__csrrc(mstatus, 0x08);
					(a4_24 & ~0x02)->dw0004 = a4_24->dw0004;
					__csrrs(mstatus, 0x08);
					word32 a5_422;
					a0_179 = blmac_pwr_mgt_setf((word32) g_b4201D24B, out a5_422);
					g_t4201D1F8.u0 = 0x00;
					struct Eq_76495 * a5_38 = (word32) *((word32) a0 + 23);
					if (a5_38 == (struct Eq_76495 *) 0x03)
					{
						g_b4201D248 = (byte) ((word32) g_b4201D248 & ~0x08);
						word32 s8_434;
						word32 s2_431;
						word32 s3_432;
						word32 s4_433;
						ra = ke_msg_send_basic(ra, 98, 0x02, a4_24 & ~0x02, mstatus, s2, out s0_27, out s1_202, out a0_179, out a3, out s2_431, out s3_432, out s4_433, out s8_434);
					}
					else if (a5_38 == s2_15)
					{
						if ((word32) *((word32) a0 + 0x0E) == 0x00)
							g_b4201D248 = (byte) ((word32) g_b4201D248 & -65);
						g_b4201D248 = (byte) ((word32) g_b4201D248 & ~0x04);
					}
					*((word32) s1_202 + 23) = ~0x00;
					ui32 a5_77 = (word32) s0_27->b0070;
					if ((a5_77 & 3) != 0x00)
					{
						word32 a1_435;
						word32 a4_436;
						s0_27 = chan_conn_less_delay_prog(mstatus, out a0_179, out a1_435, out a4_436);
					}
					else
						s0_27->b0070 = (byte) (a5_77 & ~0x10);
					Eq_2 a4_98 = (word32) s0_27->b0072;
					if (a4_98 != 0x01)
					{
						if (a4_98 <= 0x01)
						{
							word32 s1_441;
							word32 s2_443;
							word32 s3_444;
							word32 s4_445;
							word32 a4_442;
							Eq_2 ra_115 = mm_force_idle_req(ra, a4_98, mstatus, dwLoc08, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgE8, dwArgF8, out s1_441, out a4_442, out s2_443, out s3_444, out s4_445);
							struct Eq_76495 * s2_147;
							s0Out = mm_back_to_host_idle(mstatus, dwArg28, out s2_147);
							s2Out = s2_147;
							return ra_115;
						}
						else
						{
							struct Eq_76494 * s0_164;
							struct Eq_76495 * s2_165;
							word32 a1_447;
							word32 a4_449;
							word32 s3_450;
							word32 a3_448;
							word32 s1_446;
							Eq_2 ra_174 = chan_cde_evt(ra, mstatus, dwArg08, dwArg18, out s0_164, out s1_446, out a1_447, out a3_448, out a4_449, out s2_165, out s3_450);
							s0Out = s0_164;
							s2Out = s2_165;
							return ra_174;
						}
					}
				}
				struct Eq_76494 * s0_235;
				struct Eq_76495 * s2_237;
				word32 s3_429;
				word32 s4_430;
				word32 a5_428;
				word32 a4_427;
				word32 a3_426;
				word32 s1_423;
				word32 a1_424;
				word32 a2_425;
				Eq_2 ra_234 = chan_switch_start(ra, a0_179, a3, mstatus, dwArg08, out s0_235, out s1_423, out a1_424, out a2_425, out a3_426, out a4_427, out a5_428, out s2_237, out s3_429, out s4_430);
				s0Out = s0_235;
				s2Out = s2_237;
				return ra_234;
			}
		}
		else
			g_b4201D248 = (byte) ((word32) g_b4201D248 | 32);
	}
	s0Out = s0;
	s2Out = s2_15;
	return ra;
}

word32 g_dw23019B70 = 2225750529;
// 23019C76: Register Eq_2 chan_init(Register Eq_2 ra, Stack word32 dwArg0128, Register out ptr32 s0Out)
// Called from:
//      mm_init
Eq_2 chan_init(Eq_2 ra, word32 dwArg0128, ptr32 & s0Out)
{
	Eq_2 s1_29 = 0x4201D14C;
	word32 a4_164;
	word32 a5_165;
	word32 a2_162;
	word32 a3_163;
	word32 a1_161;
	word32 a0_160;
	word32 t1_159;
	Eq_2 ra_36 = memset(ra, 1107415512, 0x00, 116, out t1_159, out a0_160, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165);
	int32 s2_39;
	for (s2_39 = 0x00; s2_39 != 0x05; ++s2_39)
	{
		Eq_2 a5_56;
		word32 a4_171;
		word32 a3_170;
		word32 a1_168;
		word32 a2_169;
		word32 t1_166;
		word32 a0_167;
		ra_36 = memset(ra_36, s1_29, 0x00, 0x1C, out t1_166, out a0_167, out a1_168, out a2_169, out a3_170, out a4_171, out a5_56);
		*((word32) s1_29 + 0x0E) = 0xFF;
		((word32) s1_29 + 23)->u1 = ~0x00;
		if (s2_39 <= 0x02)
			s1_29 = co_list_push_back(s1_29, a5_56);
		else if (s2_39 == 0x03)
		{
			g_w4201D1AA = 0x00;
			g_b4201D1A5 = 0x00;
		}
		s1_29 = (word32) s1_29 + 28;
	}
	g_dw230194C8 = 1107415512;
	g_dw23019676 = 1107415512;
	g_dw23019B70 = 1107415512;
	g_dw4201D218 = 0x00;
	g_dw2301945A = 1107415512;
	0x00 = dwArg0128;
	s0Out = s4;
	return ra_36;
}

// 23019D36: Register (ptr32 Eq_76523) chan_scan_req(Register word32 a0, Register ptr32 a1, Register int32 a2, Register uint32 a3, Register word32 a4, Register ptr32 mstatus, Stack word32 dwArg0128, Register out ptr32 a1Out)
// Called from:
//      scan_set_channel_request
struct Eq_76523 * chan_scan_req(word32 a0, ptr32 a1, int32 a2, uint32 a3, word32 a4, ptr32 mstatus, word32 dwArg0128, ptr32 & a1Out)
{
	if ((word32) g_b4201D1B7 == 0x00FF)
	{
		g_b4201D1B9 = (byte) a4;
		g_w4201D1AE = 0xFF;
		g_w4201D1B6 = 0x0301;
		ui32 a5_42 = (word32) g_b4201D248;
		g_w4201D1B2 = (word16) (a3 >> 0x0A);
		g_b4201D1A4 = (byte) a0;
		g_w4201D1A8 = (word16) a1;
		g_w4201D1A6 = (word16) a1;
		g_b4201D1AC = (byte) a2;
		g_b4201D248 = (byte) (a5_42 | 2);
		if ((a5_42 & 0x10) != 0x00)
		{
			0x00 = dwArg0128;
			a1Out = a1;
			return dwArgE4;
		}
		else
		{
			0x00 = dwArg0128;
			ptr32 a1_64;
			word32 a0_108;
			word32 a4_109;
			struct Eq_76523 * s0_69 = chan_conn_less_delay_prog(mstatus, out a0_108, out a1_64, out a4_109);
			a1Out = a1_64;
			return s0_69;
		}
	}
	else
		assert_err();
}

// 23019DE2: Register Eq_2 chan_roc_req(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_76884) a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out Eq_76895 a4Out)
// Called from:
//      mm_remain_on_channel_req_handler
Eq_2 chan_roc_req(Eq_2 ra, Eq_2 s0, struct Eq_76884 * a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg3C, Eq_2 dwArgD8, Eq_2 dwArgE8, union Eq_76895 & a4Out)
{
	up32 s1_13 = (word32) a0->b0000;
	if (s1_13 != 0x00)
	{
		if (s1_13 != 0x01)
		{
l23019DF8:
			goto l23019E92;
		}
		a4 = (word32) g_b4201D1D3;
		struct Eq_76916 * s2_109 = &g_t4201D14C;
		if (a4 != 0x00FF)
		{
			up32 a5_92 = (word32) g_b4201D1D2;
			struct Eq_77049 * s0_120 = &g_t4201D1D8;
			if (a5_92 <= 0x03)
			{
				if (a5_92 < 0x02)
				{
					if (a5_92 == s1_13)
						g_b4201D248 = (byte) ((word32) g_b4201D248 & ~0x01);
				}
				else
				{
					ui32 a5_133 = (word32) g_b4201D248;
					g_t4201D1FC.u0 = 0x00;
					g_b4201D248 = (byte) (a5_133 & ~0x04);
				}
			}
			else if (a5_92 == 0x04)
			{
				word32 a5_313;
				word32 a2_312;
				mm_timer_clear(0x4201D220, 0x04, out a2_312, out a5_313);
				ra = chan_ctxt_op_evt(ra, 1107415484, a3, 0x4201D14C, mstatus, s2, s0, dwLoc08, dwArg08, dwArg18, dwArg3C, dwArgD8, dwArgE8, out s0_120, out s2_109);
			}
			s2_109->b0087 = ~0x00;
			ui32 a5_144 = (word32) s0_120->b0070;
			a4.u0 = 0x10;
			if ((a5_144 & 18) == 0x10)
			{
				s0_120->b0070 = (byte) (a5_144 & ~0x10);
				word32 a5_311;
				word32 a2_310;
				mm_timer_clear(0x4201D230, 0x10, out a2_310, out a5_311);
				s0_120->b0070 = (byte) ((word32) s0_120->b0070 & ~0x10);
			}
		}
	}
	else
	{
		Eq_2 a3_16 = (word32) g_b4201D1D3;
		a4.u0 = 0x00FF;
		if (a3_16 != 0x00FF)
			goto l23019DF8;
		g_b4201D1D3 = 0x04;
		g_b4201D1C0 = (byte) (word32) a0->b0002;
		g_b4201D1C1 = (byte) (word32) a0->b0003;
		g_w4201D1C2 = (word16) (word32) a0->w0004;
		g_w4201D1C4 = (word16) (word32) a0->w0006;
		word32 a4_28 = (word32) a0->w0008;
		g_w4201D1CA = (word16) a1;
		g_w4201D1C6 = (word16) a4_28;
		g_b4201D1D2 = 0x01;
		struct Eq_76966 * a0_34 = *((word32) a3_16 + 0x0C);
		Mem38[1107415502:word16] = SLICE(a3_16 + 1000 >>u 0x0A, word16, 0);
		g_b4201D1D5 = (byte) (word32) a0_34->b0001;
		g_b4201D1C8 = (byte) (int32) a0_34->b0010;
		a4 = (word32) g_b4201D248;
		if (a1 == 0x00)
		{
			g_b4201D248 = (byte) (a4 | 4);
			a4 |= 4;
			if (g_t4201D1FC == 0x00)
			{
				word32 s4_307;
				word32 s3_306;
				word32 s2_305;
				word32 a5_304;
				word32 a3_303;
				word32 a2_302;
				word32 a1_301;
				word32 s1_300;
				word32 s0_299;
				ra = chan_switch_start(ra, 1107415484, a3_16, mstatus, dwLoc08, out s0_299, out s1_300, out a1_301, out a2_302, out a3_303, out a4, out a5_304, out s2_305, out s3_306, out s4_307);
				goto l23019E92;
			}
		}
		else
		{
			g_b4201D248 = (byte) (a4 | 1);
			if ((a4 & 16) == 0x00)
			{
				word32 a1_309;
				word32 a0_308;
				chan_conn_less_delay_prog(mstatus, out a0_308, out a1_309, out a4);
l23019E92:
				0x00 = dwArg38;
				a4Out = a4;
				return ra;
			}
		}
	}
	goto l23019E92;
}

// 23019F56: Register word32 chan_ctxt_add(Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_2 a4, Stack Eq_2 dwArgA8, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_25458) s3Out, Register out ptr32 s5Out, Register out Eq_25460 s6Out)
// Called from:
//      vif_mgmt_switch_channel
//      me_add_chan_ctx
//      sm_add_chan_ctx
//      apm_start_cac_req_handler
word32 chan_ctxt_add(Eq_2 a0, byte * a1, Eq_2 a4, Eq_2 dwArgA8, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a4Out, ptr32 & s2Out, struct Eq_25458 & s3Out, ptr32 & s5Out, union Eq_25460 & s6Out)
{
	struct Eq_25458 * s3_152 = &g_t4201D14C;
	ptr32 s2_151;
	for (s2_151 = 0x00; s2_151 != 0x03; ++s2_151)
	{
		Eq_2 a0_140;
		Eq_2 a5_32 = (word32) s3_152->b0017;
		if (a5_32 != 0x00FF)
		{
			word32 a2_163;
			word32 a1_162;
			word32 a3_164;
			a0_140 = memcmp(a0, (char *) s3_152 + 4, 0x08, out a1_162, out a2_163, out a3_164, out a4, out a5_32);
			if (a0_140 == 0x00)
			{
				*a1 = (byte) s2_151;
				goto l23019F9A;
			}
		}
		++s3_152;
	}
	word32 a5_165;
	Eq_2 a0_57 = co_list_pop_front(a4, a5_32, out a5_165);
	a4 = a0_57;
	a0_140.u0 = 0x01;
	if (a0_57 != 0x00)
	{
		ui32 a5_69 = (a0_57 - 0x4201D14C >> 2) + 3067833783 & 0x00FF;
		*((word32) a0_57 + 23) = (byte) a5_69;
		*a1 = (byte) a5_69;
		((word32) a0_57 + 4)->u1 = (byte) (word32) *a0;
		*((word32) a0_57 + 5) = (byte) (word32) *((word32) a0 + 1);
		*((word32) a0_57 + 8) = (word16) (word32) *((word32) a0 + 4);
		*((word32) a0_57 + 0x0A) = (word16) (word32) *((word32) a0 + 6);
		*((word32) a0_57 + 6) = (word16) (word32) *((word32) a0 + 2);
		((word32) a0_57 + 0x0C)->u1 = (byte) (int32) *((word32) a0 + 8);
		a0_140.u0 = 0x00;
	}
l23019F9A:
	0x00 = (uint16) dwArgA8;
	s1Out = a0;
	a0Out = a0_140;
	a4Out = a4;
	s2Out = s2_151;
	s3Out = s3_152;
	s5Out = 0x03;
	s6Out.u0 = 0x00FF;
	return s1;
}

// 2301A01A: Register Eq_2 chan_ctxt_del(Register Eq_2 ra, Register (ptr32 Eq_77248) a0, Stack Eq_2 dwArg38, Register out (ptr32 Eq_77250) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      chan_ctxt_unlink
Eq_2 chan_ctxt_del(Eq_2 ra, struct Eq_77248 * a0, Eq_2 dwArg38, struct Eq_77250 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	if ((word32) a0->b4201D17F != 0x00FF)
	{
		Eq_2 a5_31 = (word32) a0->b4201D180;
		if (a5_31 == 0x00)
		{
			struct Eq_77250 * a1_48;
			ptr32 a3_50;
			ptr32 a4_51;
			word32 t1_77;
			word32 a0_78;
			word32 a2_79;
			word32 a5_80;
			Eq_2 ra_53 = memset(ra, co_list_push_back((char *) a0 + 1107415400, a5_31), 0x00, 0x1C, out t1_77, out a0_78, out a1_48, out a2_79, out a3_50, out a4_51, out a5_80);
			a0->w4201D176 = 0xFF;
			a0->b4201D17F = ~0x00;
			0x00 = (uint16) dwArg38;
			a1Out = a1_48;
			a3Out = a3_50;
			a4Out = a4_51;
			return ra_53;
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 2301A0C2: Register Eq_2 chan_ctxt_update(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack word32 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0148, Register out (ptr32 Eq_77334) a4Out, Register out ptr32 s3Out)
// Called from:
//      mm_hw_config_handler
Eq_2 chan_ctxt_update(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, word32 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0148, struct Eq_77334 & a4Out, ptr32 & s3Out)
{
	struct Eq_77336 * a4_11 = (word32) *a0;
	ptr32 a3_13 = (word32) *((word32) a0 + 1);
	a4_11->b4201D16C = (byte) a3_13;
	a4_11->b4201D16D = (byte) (word32) *((word32) a0 + 2);
	a4_11->w4201D170 = (word16) (word32) *((word32) a0 + 6);
	a4_11->w4201D172 = (word16) (word32) *((word32) a0 + 8);
	a4_11->w4201D16E = (word16) (word32) *((word32) a0 + 4);
	a4_11->b4201D174 = (byte) (int32) *((word32) a0 + 0x0A);
	if (g_t4201D1F8 != (char *) a4_11 + 1107415400)
	{
		a4Out = (struct Eq_77334 *) &g_t4201D000;
		s3Out = s3;
		return ra;
	}
	else
	{
		__csrrc(mstatus, 0x08);
		Eq_2 a4_39;
		Eq_2 s3_45;
		Eq_2 s4_46;
		Eq_2 s8_47;
		struct Eq_77404 * s0_63;
		ptr32 fflags_76;
		ptr32 frm_77;
		struct Eq_63365 * s3_81;
		Eq_2 ra_62 = rxl_cntrl_evt(ra, rxl_timer_int_handler(a0, a1, mstatus, out a4_39, out s3_45, out s4_46, out s8_47), a1, a3_13, a4_39, s3_45, s4_46, s5, s6, s7, s8_47, s10, s11, fflags, frm, mstatus, s0, dwLoc08, dwArg14, dwArg18, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg64, dwArg68, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out s0_63, out s3_81, out fflags_76, out frm_77);
		__csrrs(mstatus, 0x08);
		ptr32 fflags_103;
		ptr32 frm_104;
		ptr32 s3_110;
		word32 s0_215;
		word32 s1_216;
		word32 s2_217;
		Eq_2 ra_105 = phy_set_channel(ra_62, (word32) s0_63->b0001, (word32) s0_63->b0002, (word32) s0_63->w0006, s3_81, fflags_76, frm_77, s0, dwArg14, dwArg0148, out s0_215, out s1_216, out s2_217, out s3_110, out fflags_103, out frm_104);
		struct Eq_77334 * a4_134;
		word32 a5_218;
		tpc_update_tx_power(ra_105, fflags_103, frm_104, out a4_134, out a5_218);
		a4Out = a4_134;
		s3Out = s3_110;
		return ra_105;
	}
}

