pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301A162: Register Eq_2 chan_tbtt_switch_update(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 Eq_8927) a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_8950) s0Out, Register out (ptr32 Eq_8951) s1Out, Register out Eq_2 a1Out, Register out Eq_8953 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out (ptr32 Eq_8957) s4Out, Register out Eq_8958 s5Out, Register out ptr32 s6Out, Register out Eq_8960 s7Out, Register out (ptr32 Eq_8961) s9Out, Register out (ptr32 Eq_8962) s10Out)
// Called from:
//      mm_tbtt_evt
//      mm_sta_tbtt
//      rxl_cntrl_evt
Eq_2 chan_tbtt_switch_update(Eq_2 ra, Eq_2 a1, Eq_2 a3, struct Eq_8927 * a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0178, struct Eq_8950 & s0Out, struct Eq_8951 & s1Out, union Eq_2 & a1Out, union Eq_8953 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, struct Eq_8957 & s4Out, union Eq_8958 & s5Out, ptr32 & s6Out, union Eq_8960 & s7Out, struct Eq_8961 & s9Out, struct Eq_8962 & s10Out)
{
	if (a5 != null && (word32) a5->b0016 != 0x00)
	{
		a1 = (word32) a1 - 0x00FFF9C4;
		struct Eq_77481 * a0_11 = *(struct Eq_77481 **) 0xFF000684;
		if (a1 != 0x00)
		{
			*((word32) a1 - 0x00FFF97C) = a0_11;
			a4 = (word32) g_b4201D24A;
			if (a4 > 0x01)
			{
				a4 = (word32) a0_11->b004E;
				if (a4 != 0x02)
				{
					a0_11->b004E = 0x00;
					word32 a5_150;
					co_list_extract(0x4201D1E8, (char *) a0_11 + 0x0044, a4, 0x02, out a5_150);
					Eq_2 a1_39;
					Eq_8953 a2_40;
					Eq_2 a4_41;
					struct Eq_8950 * s0_44;
					struct Eq_8951 * s1_45;
					struct Eq_8962 * s10_46;
					ptr32 s3_49;
					struct Eq_8957 * s4_50;
					Eq_8958 s5_51;
					ptr32 s6_52;
					Eq_8960 s7_53;
					struct Eq_8961 * s9_55;
					Eq_2 a3_58;
					word32 s2_151;
					Eq_2 ra_59 = chan_tbtt_schedule(ra, (char *) a0_11 + 0x0044, (char *) a0_11 + 0x0044, a3, a4, mstatus, dwArg08, dwArgA8, dwArg0118, dwArg0178, out s0_44, out s1_45, out a1_39, out a2_40, out a3_58, out a4_41, out s2_151, out s3_49, out s4_50, out s5_51, out s6_52, out s7_53, out s9_55, out s10_46);
					s0Out = s0_44;
					s1Out = s1_45;
					a1Out = a1_39;
					a2Out = a2_40;
					a3Out = a3_58;
					a4Out = a4_41;
					s3Out = s3_49;
					s4Out = s4_50;
					s5Out = s5_51;
					s6Out = s6_52;
					s7Out = s7_53;
					s9Out = s9_55;
					s10Out = s10_46;
					return ra_59;
				}
			}
		}
	}
	s0Out = s0;
	s1Out = s1;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 2301A1BE: Register Eq_2 chan_bcn_to_evt(Register Eq_2 ra, Register (ptr32 Eq_24265) a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      vif_mgmt_bcn_recv
Eq_2 chan_bcn_to_evt(Eq_2 ra, struct Eq_24265 * a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0158, ptr32 & s0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_2 a4_18 = (word32) a0->b004E;
	Eq_2 a5_188 = 0x02;
	if (a4_18 == 0x02)
	{
		a0->b004E = 0x00;
		word32 a5_260;
		co_list_extract(0x4201D1E8, (char *) a0 + 0x0044, a4_18, 0x02, out a5_260);
		a1 = (char *) a0 + 0x0044;
		a4_18 = (word32) g_b4201D24A;
		a5_188.u0 = 0x01;
		if (a4_18 > 0x01)
		{
			struct Eq_77583 * s0_45;
			Eq_2 s1_46;
			struct Eq_77585 * s2_49;
			word32 s3_262;
			word32 s4_263;
			word32 a2_261;
			ra = chan_tbtt_schedule(ra, (char *) a0 + 0x0044, (char *) a0 + 0x0044, a3, a4_18, mstatus, s2, dwArg88, dwArgF8, dwArg0158, out s0_45, out s1_46, out a1, out a2_261, out a3, out a4_18, out s2_49, out s3_262, out s4_263, out s5, out s6, out s7, out s9, out s10);
			ui32 a5_63 = (word32) s0_45->b0070;
			a5_188 = a5_63 & 0x0C;
			if ((a5_63 & 0x0C) == 0x00)
			{
				Eq_2 s0_65 = (a5_63 & 0x0C)->t0024;
				if ((a5_63 & 0x0C) == 0x00)
				{
					struct Eq_77625 * a5_70;
					word32 a4_264;
					a1 = chan_upd_nb_rem_slots.isra.3((char *) s2_49 + 18, s1_46, out a4_264, out a5_70);
					Eq_2 a4_71 = (word32) s2_49->w0014;
					if (a4_71 != 0x00)
					{
						uint32 a5_75 = s1_46 - a5_70 >> 0x0A << 16;
						s0_65 = a5_70->t006C;
						Eq_2 a5_76 = a5_75 >> 16;
						if (a4_71 < a5_75 >> 16)
							a5_76 = a4_71;
						s2_49->w0014 = (word16) (a4_71 - a5_76);
					}
					*((word32) s1_46 + 0x006C) = s0_65;
					Eq_2 a0_91;
					word32 s2_265;
					chan_get_next_chan(s0_65, s1_46, a4_71, dwArg18, out a0_91, out a3, out a4_18, out a5_188, out s2_265);
					if (a5_188 != a0_91)
					{
						Eq_2 a5_120;
						ptr32 a1_122;
						ptr32 a2_123;
						Eq_2 a3_124;
						Eq_2 a4_125;
						ptr32 s0_128;
						ptr32 s4_132;
						word32 s1_266;
						word32 s2_267;
						word32 s3_268;
						Eq_2 ra_127 = chan_switch_start(ra, a0_91, a3, mstatus, dwArg08, out s0_128, out s1_266, out a1_122, out a2_123, out a3_124, out a4_125, out a5_120, out s2_267, out s3_268, out s4_132);
						s0Out = s0_128;
						a1Out = a1_122;
						a2Out = a2_123;
						a3Out = a3_124;
						a4Out = a4_125;
						a5Out = a5_120;
						s4Out = s4_132;
						s5Out = s5;
						s6Out = s6;
						s7Out = s7;
						s9Out = s9;
						s10Out = s10;
						return ra_127;
					}
				}
			}
		}
	}
	s0Out = s1;
	a1Out = a1;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4_18;
	a5Out = a5_188;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

