pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301A278: Register Eq_2 chan_bcn_detect_start(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Register out Eq_2 s0Out, Register out (ptr32 Eq_12256) a3Out, Register out Eq_2 s3Out)
// Called from:
//      mm_sta_tbtt
//      mm_hw_config_handler
Eq_2 chan_bcn_detect_start(Eq_2 ra, Eq_2 s0, ptr32 mstatus, union Eq_2 & s0Out, struct Eq_12256 & a3Out, union Eq_2 & s3Out)
{
	Eq_2 s3_133 = *((word32) s0 + 64);
	if (s0 != 0x00)
	{
		if (((word32) g_b4201D248 & 64) == 0x00)
		{
			Eq_2 a4_26 = (word32) g_b4201D24A;
			if (a4_26 > 0x01)
			{
				Eq_2 a0_34;
				struct Eq_77718 * s0_42;
				struct Eq_77719 * s2_44;
				struct Eq_77720 * s3_45;
				word32 s1_143;
				word32 a1_144;
				word32 a2_145;
				word32 a3_146;
				word32 a4_147;
				word32 a5_148;
				word32 a6_149;
				word32 s4_150;
				word32 s8_151;
				ra = ke_msg_alloc(ra, 70, 0x00, 0x14, a4_26, mstatus, dwLoc08, out s0_42, out s1_143, out a0_34, out a1_144, out a2_145, out a3_146, out a4_147, out a5_148, out a6_149, out s2_44, out s3_45, out s4_150, out s8_151);
				a0_34->u1 = 0x00;
				*((word32) a0_34 + 1) = (byte) (word32) s3_45->b0057;
				*((word32) a0_34 + 2) = (byte) (word32) s0_42->b0004;
				*((word32) a0_34 + 3) = (byte) (word32) s0_42->b0005;
				*((word32) a0_34 + 4) = (word16) (word32) s0_42->w0006;
				*((word32) a0_34 + 6) = (word16) (word32) s0_42->w0008;
				*((word32) a0_34 + 8) = (word16) (word32) s0_42->w000A;
				(s2_44->dw420190D4 + ~0x01000387 >> 1000)->t000C = a0_34;
				((word32) a0_34 + 16)->u1 = (byte) (int32) s0_42->b000C;
				struct Eq_77819 * s1_86;
				word32 a0_152;
				word32 a1_153;
				word32 a2_154;
				word32 a4_155;
				word32 a5_156;
				word32 s2_157;
				word32 s4_158;
				word32 s8_159;
				s0 = ke_msg_send(a0_34, mstatus, out s1_86, out a0_152, out a1_153, out a2_154, out a3, out a4_155, out a5_156, out s2_157, out s3_133, out s4_158, out s8_159);
				s1_86->b0070 = (byte) ((word32) s1_86->b0070 | 64);
			}
		}
		s0Out = s0;
		a3Out = a3;
		s3Out = s3_133;
		return ra;
	}
	else
		assert_err();
}

// 2301A352: Register Eq_2 chan_is_on_channel(Register Eq_2 a0, Register out ptr32 a3Out, Register out Eq_12139 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mm_sta_tbtt
//      ps_uapsd_timer_handle
//      ps_set_mode
//      ps_traffic_status_update
//      tpc_update_vif_tx_power
//      txl_cntrl_tx_check
//      bl_sleep
Eq_2 chan_is_on_channel(Eq_2 a0, ptr32 & a3Out, union Eq_12139 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_25 = g_t4201D1F8;
	if (a5_25 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_25;
		return 0x00;
	}
	else
	{
		Eq_77859 a0_12;
		ptr32 a3_7 = (word32) *((word32) a5_25 + 23);
		if (a3_7 <= 0x02)
			a0_12 = *((word32) a0 + 64) - a5_25;
		else
		{
			a5_25 = (word32) *((word32) a5_25 + 25);
			a0_12 = a5_25 - (word32) (*((word32) a0 + 87));
		}
		a3Out = a3_7;
		a4Out.u0 = 0x02;
		a5Out = a5_25;
		return (word32) (a0_12 < 1);
	}
}

// 2301A382: Register Eq_2 chan_is_tx_allowed(Register Eq_2 a0, Register out ptr32 a3Out, Register out (ptr32 Eq_20583) a4Out)
// Called from:
//      txl_cntrl_tx_check
Eq_2 chan_is_tx_allowed(Eq_2 a0, ptr32 & a3Out, struct Eq_20583 & a4Out)
{
	ptr32 a3_9;
	struct Eq_20583 * a4_10;
	word32 a5_30;
	Eq_2 a0_16 = chan_is_on_channel(a0, out a3_9, out a4_10, out a5_30);
	if (a0_16 != 0x00)
	{
		struct Eq_77895 * a5_12 = a4_10->ptr0024;
		if (a4_10 != null)
			a0_16 = (word32) ((word32) a5_12->ptr0020->b0016 < ~0x06);
	}
	a3Out = a3_9;
	a4Out = a4_10;
	return a0_16;
}

// 2301A3AA: Register word32 chan_is_on_operational_channel(Register out Eq_2 a4Out)
// Called from:
//      mm_bcn_transmit
word32 chan_is_on_operational_channel(union Eq_2 & a4Out)
{
	Eq_2 a4_5 = g_t4201D1F8;
	word32 a5_12 = 0x00;
	if (a4_5 != 0x00)
	{
		a5_12 = 0x00;
		if ((word32) *((word32) a4_5 + 23) <= 0x02)
			a5_12 = (word32) (0x00 - a4_5 < 1);
	}
	a4Out = a4_5;
	return a5_12;
}

// 2301A3CE: Register int32 chan_update_tx_power(Register Eq_2 a0, Register Eq_2 a3)
// Called from:
//      tpc_update_vif_tx_power
//      chan_ctxt_link
//      chan_ctxt_unlink
int32 chan_update_tx_power(Eq_2 a0, Eq_2 a3)
{
	if ((word32) *((word32) a0 + 24) == 0x00)
		return a4;
	int32 a5_10 = 0x007F;
	if (a0 == a3)
	{
		word32 a5_12 = (word32) g_b4201A46A;
		word32 a3_11 = (word32) g_b4201A469;
		if ((int32) (byte) a3_11 < (int32) ((byte) a5_12))
			a5_12 = a3_11;
		a5_10 = (int32) (byte) a5_12;
	}
	if (a0 == g_t4201AA28)
	{
		int32 a3_28 = (word32) g_b4201AA42;
		if (a5_10 < (int32) ((byte) a3_28))
			a3_28 = a5_10;
		int32 a5_37 = a3_28 << 0x18;
		a4 = (int32) g_b4201AA41;
		a5_10 = a5_37 >> 24;
		if (a4 < a5_37 >> 24)
		{
			a5_10 = a4;
l2301A43A:
			((word32) a0 + 0x0C)->u1 = (byte) a5_10;
			return a4;
		}
	}
	a4 = 0x007F;
	if (a5_10 == 0x007F)
		return 0x007F;
	goto l2301A43A;
}

// 2301A440: Register word32 chan_ctxt_link(Register Eq_2 ra, Register (ptr32 Eq_25536) a0, Register (ptr32 Eq_25374) a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_25536) s3Out, Register out ptr32 s4Out)
// Called from:
//      vif_mgmt_switch_channel
//      scanu_join_cfm_handler
//      apm_start_cac_req_handler
//      apm_start_req_handler
word32 chan_ctxt_link(Eq_2 ra, struct Eq_25536 * a0, struct Eq_25374 * a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a4Out, union Eq_2 & s2Out, struct Eq_25536 & s3Out, ptr32 & s4Out)
{
	struct Eq_25536 * s3_118 = a0;
	Eq_2 s2_117 = (char *) a1 + 1107415400;
	if (a0->ptr4201AA28 == 0x00)
	{
		if ((word32) a1->b4201D17F != 0x00FF)
		{
			struct Eq_78002 * s0_59 = *(struct Eq_78002 **) 359;
			Eq_2 s1_101 = (word32) a1->b4201D180 + 0x01 & 0x00FF;
			*(struct Eq_78002 **) 218102119 = s0_59;
			a0->ptr4201AA28 = (char *) a1 + 1107415400;
			a1->b4201D180 = (byte) s1_101;
			if (s1_101 == 0x01)
			{
				struct Eq_78028 * a5_68 = (word32) s0_59->b0072;
				a1->b4201D17E = (byte) s1_101;
				s0_59->b0072 = (byte) ((char *) a5_68 + 1);
				s1_101 = co_list_push_back((char *) a1 + 1107415400, (char *) a5_68 + 1);
				struct Eq_78047 * s0_78 = a5_68->ptr0025;
				if (a5_68 == (struct Eq_78028 *) 0x01)
				{
					if (((word32) s0_78->b0070 & 0x0C) == 0x00)
					{
						if ((word32) s0_78->b0072 == s1_101)
						{
							word32 s0_178;
							word32 a1_179;
							word32 a2_180;
							word32 a4_181;
							word32 a5_182;
							word32 s4_183;
							chan_switch_start(ra, (char *) a1 + 1107415400, a3, mstatus, s2, out s0_178, out s1_101, out a1_179, out a2_180, out a3, out a4_181, out a5_182, out s2_117, out s3_118, out s4_183);
						}
						else
						{
							word32 s0_175;
							word32 a1_176;
							word32 a4_177;
							chan_cde_evt(ra, mstatus, s2, dwLoc08, out s0_175, out s1_101, out a1_176, out a3, out a4_177, out s2_117, out s3_118);
						}
					}
				}
				else
				{
					a5_68->b0017 = (byte) s1_101;
					s0_78->dw0024 = 0x00;
				}
			}
			ptr32 a4_139 = chan_update_tx_power(s2_117, a3);
			s1Out = s1_101;
			a4Out = a4_139;
			s2Out = s2_117;
			s3Out = s3_118;
			s4Out = dwArg04;
			return s1;
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 2301A562: Register Eq_2 chan_ctxt_unlink(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0168, Register out (ptr32 Eq_25342) s1Out, Register out ptr32 a4Out, Register out ptr32 s6Out, Register out ptr32 s10Out)
// Called from:
//      vif_mgmt_switch_channel
//      sm_delete_resources
//      apm_stop
//      apm_stop_cac_req_handler
Eq_2 chan_ctxt_unlink(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArg0108, Eq_2 dwArg0168, struct Eq_25342 & s1Out, ptr32 & a4Out, ptr32 & s6Out, ptr32 & s10Out)
{
	Eq_2 a4_104 = a0 + 0x05D8;
	if (s0 == 0x00)
		assert_err();
	word32 a5_254;
	struct Eq_14082 * s1_34 = co_list_extract(0x4201D1E8, a0 + 0x4201AA2C, a0 + 0x05D8, 0x05D8, out a5_254);
	s1_34->b004E = 0x00;
	s1_34->dw0040 = 0x00;
	((word32) s0 + 24)->u1 = (byte) ((word32) *((word32) s0 + 24) + ~0x00);
	Eq_2 a1_114 = a0 + 0x4201AA2C;
	struct Eq_78146 * a5_42 = (word32) *((word32) s0 + 22);
	if (a5_42 == null)
	{
l2301A648:
		if ((word32) *((word32) s0 + 24) == 0x00)
			ra = chan_ctxt_del(ra, (word32) *((word32) s0 + 23), dwArg28, out a1_114, out a3, out a4_104);
		goto l2301A656;
	}
	a3 = a5_42->t0068;
	a5_42->tF3FFF868 = a3;
	a4_104.u0 = ~0x0C0007FF;
	Eq_2 a5_49 = (word32) *((word32) s0 + 24);
	if (a5_49 != 0x00)
	{
l2301A656:
		Eq_2 s0_169;
		struct Eq_25342 * s1_170;
		ptr32 s10_171;
		ptr32 s6_177;
		Eq_2 a3_183;
		word32 s9_263;
		word32 s3_259;
		word32 s4_260;
		word32 s7_262;
		word32 s5_261;
		word32 a1_255;
		word32 a2_256;
		word32 s2_258;
		word32 a4_257;
		Eq_2 ra_184 = chan_tbtt_schedule(ra, 0x00, a1_114, a3, a4_104, mstatus, dwLoc08, dwArg98, dwArg0108, dwArg0168, out s0_169, out s1_170, out a1_255, out a2_256, out a3_183, out a4_257, out s2_258, out s3_259, out s4_260, out s5_261, out s6_177, out s7_262, out s9_263, out s10_171);
		0x00 = (uint16) dwArg38;
		ptr32 a4_194 = chan_update_tx_power(s0_169, a3_183);
		s1Out = s1_170;
		a4Out = a4_194;
		s6Out = s6_177;
		s10Out = s10_171;
		return ra_184;
	}
	Eq_2 s2_54 = g_t4201D1FC;
	word32 a5_264;
	struct Eq_14082 * s1_56 = co_list_extract(0x4201D1E0, s0, ~0x0C0007FF, a5_49, out a5_264);
	((word32) s0 + 22)->u1 = 0x00;
	struct Eq_78223 * s1_61 = *(struct Eq_78223 **) ~0x0C0007DF;
	uint32 a5_63 = (word32) s1_56->b0072 + ~0x00 & 0x00FF;
	s1_61->b0072 = (byte) a5_63;
	a1_114 = s0;
	if (s0 == ~0x0C0007FF)
		s1_61->dw0020 = 0x00;
	else if (s2_54 == s0)
	{
		s1_61->dw0024 = 0x00;
l2301A63C:
		s1_61->b0070 = (byte) ((word32) s1_61->b0070 | 32);
		goto l2301A648;
	}
	if (s2_54 == 0x00)
	{
		a4_104.u0 = 0x01;
		if (a5_63 > 0x01)
		{
			word32 s2_266;
			word32 s3_267;
			word32 s1_265;
			ra = chan_cde_evt(ra, mstatus, dwLoc08, dwArg08, out s0, out s1_265, out a1_114, out a3, out a4_104, out s2_266, out s3_267);
		}
		else if (a5_63 == 0x01)
		{
			word32 s4_273;
			word32 s3_272;
			word32 s2_271;
			word32 a5_270;
			word32 a2_269;
			word32 s1_268;
			ra = chan_switch_start(ra, 0x4201D1E0, a3, mstatus, dwLoc08, out s0, out s1_268, out a1_114, out a2_269, out a3, out a4_104, out a5_270, out s2_271, out s3_272, out s4_273);
		}
		goto l2301A648;
	}
	goto l2301A63C;
}

