pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301A678: void hal_dma_init()
// Called from:
//      mm_init
void hal_dma_init()
{
	co_list_init(&g_t4201D24C);
	g_w4201D264 = *(word16 *) 0x44A000A4;
	co_list_init(&g_t4201D254);
	g_w4201D266 = *(word16 *) 0x44A000AC;
}

// 2301A6BA: void hal_dma_push(Register (ptr32 Eq_36534) s0, Register Eq_2 a1, Register word32 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      scanu_start
void hal_dma_push(struct Eq_36534 * s0, Eq_2 a1, word32 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 s1_13 = a1;
	Eq_2 a0_14 = s0->t0004;
	if (a5 != 0x00)
	{
		ui32 a5_19 = (word32) *((word32) a1 + 0x2308DDD0);
		s0->w000A = (word16) (a5_19 << 8 | (a5_19 | 16) | 0x01000000);
		__csrrc(mstatus, 0x08);
		s1_13 = co_list_push_back(a0_14, a1 << 0x03);
		__csrrs(mstatus, 0x08);
		a1 = a0_14;
		a0_14 = (a1 << 0x03) + 0x4201D24C;
	}
	else
		s0->w000A = 0x00;
	Eq_2 a0_56;
	word32 a6_141;
	word32 a7_142;
	word32 a1_139;
	word32 a5_140;
	Eq_2 a4_102;
	Eq_2 a3_47;
	Eq_2 a2_46;
	memcpy(a0_14, a1, (word32) s0->w0008, out a1_139, out a2_46, out a3_47, out a4_102, out a5_140, out a6_141, out a7_142);
	if (s1_13 != 0x00)
	{
		Eq_2 a5_57 = 0x01;
		if (s1_13 != 0x01)
		{
			while (true)
			{
				word32 s4_151;
				word32 s3_150;
				word32 s1_143;
				word32 a1_145;
				word32 a4_147;
				word32 s2_149;
				word32 a0_144;
				word32 a2_146;
				word32 a5_148;
				word32 s8_152;
				word32 a0_153;
				word32 a1_154;
				word32 s4_155;
				word32 s8_156;
				puts((word32) vTaskDelay(1000, a2_46, a3_47, a4_102, a5_57, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_143, out a0_144, out a1_145, out a2_146, out a3_47, out a4_147, out a5_148, out s2_149, out s3_150, out s4_151, out s8_152) - 0x0630, out a0_153, out a1_154, out a2_46, out a4_102, out a5_57, out s4_155, out s8_156);
			}
		}
		a0_56.u0 = 0x10000000;
	}
	else
		a0_56.u0 = 64;
	word32 a5_157;
	ke_evt_set(a0_56, a4_102, mstatus, out a5_157);
}

// 2301A74A: void hal_dma_evt(Register word32 a0, Register Eq_2 a4, Register ptr32 mstatus)
void hal_dma_evt(word32 a0, Eq_2 a4, ptr32 mstatus)
{
	Eq_2 a0_12;
	if (a0 == 0x00)
		a0_12.u0 = 64;
	else
		a0_12.u0 = 0x10000000;
	ke_evt_clear(a0_12, a4, mstatus);
	__csrrc(mstatus, 0x08);
	Eq_2 a5_24 = 0x4201D24C;
	while (true)
	{
		Eq_2 a0_30 = co_list_pop_front(a4, a5_24, out a5_24);
		__csrrs(mstatus, 0x08);
		if (a0_30 == 0x00)
			break;
		if (a5_24 != 0x00)
			a5_24();
		__csrrc(mstatus, 0x08);
	}
}

// 2301A79C: Register ui32 blmac_soft_reset_getf(Register ui32 s0)
// Called from:
//      hal_machw_stop
//      hal_machw_init
ui32 blmac_soft_reset_getf(ui32 s0)
{
	if ((s0 & -2) == 0x00)
		return s0 & 0x00FF;
	assert_err();
}

// 2301A7D2: void blmac_wt_2_crypt_clk_ratio_setf(Register ui32 a0)
// Called from:
//      hal_machw_init
void blmac_wt_2_crypt_clk_ratio_setf(ui32 a0)
{
	*(int32 *) 0x44B000F0 = a0 | *((int32 *) 0x44B000F0) & ~0x03;
}

// 2301A7E4: Register Eq_2 blmac_rx_flow_cntrl_en_setf.constprop.9(Register Eq_2 a5)
// Called from:
//      hal_machw_init
//      hal_machw_reset
Eq_2 blmac_rx_flow_cntrl_en_setf.constprop.9(Eq_2 a5)
{
	Eq_2 a3_5 = *((word32) a5 + 84);
	(a5 & ~0x10000000 | 0x10000000)->t0054 = a3_5;
	return a3_5;
}

// 2301A7F8: Register word32 blmac_key_sto_ram_reset_setf.constprop.12(Register (ptr32 Eq_78498) a5)
// Called from:
//      hal_machw_init
//      hal_machw_monitor_mode
word32 blmac_key_sto_ram_reset_setf.constprop.12(struct Eq_78498 * a5)
{
	(a5 & ~0x02000000 | 0x02000000)->dw004C = a5->dw004C;
	return 0x02000000;
}

// 2301A80C: void hal_machw_idle_req(Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      mm_set_idle_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
void hal_machw_idle_req(Eq_2 a4, ptr32 mstatus)
{
	Eq_2 a5_5 = *((word32) a4 + 56);
	if ((a4 & 0x0F) != 0x00)
	{
		__csrrc(mstatus, 0x08);
		*((word32) a5_5 + 316) = (word32) *((word32) a5_5 + 288) + 0x0C000350;
		((union Eq_13963 *) 0x44B08088)->u0 = 32;
		*(union Eq_2 *) 0x44B0808C |= 32;
		((word32) a5_5 + 56)->u0 = 0x00;
		*(struct Eq_16363 **) 0x44B08008 = *(struct Eq_16363 **) 0x44B08004;
		__csrrs(mstatus, 0x08);
	}
	else
	{
		word32 a2_44;
		word32 a4_45;
		word32 a5_46;
		assert_rec(mstatus, out a2_44, out a4_45, out a5_46);
	}
}

// 2301A874: void hal_machw_stop(Register ui32 s0)
// Called from:
//      mm_reset_req_handler
void hal_machw_stop(ui32 s0)
{
	((union Eq_2 *) 0x51)->u0 = 0x44B08000;
	do
		;
	while (blmac_soft_reset_getf(s0) != 0x00);
}

// 2301A88C: Register Eq_2 hal_machw_init(Register Eq_2 ra, Register ui32 s0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      mm_init
Eq_2 hal_machw_init(Eq_2 ra, ui32 s0, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	((union Eq_2 *) 0x51)->u0 = 0x44B08000;
	do
		;
	while (blmac_soft_reset_getf(s0) != 0x00);
	*(word32 *) 0x44B00404 = 2422327;
	*(int32 *) 0x44B00400 = 0x01;
	*(int32 *) 0x44B00400 = 0x00;
	*(int32 *) 0x44B00400 = 0x0069;
	*(int32 *) 0x44B00400 &= -33;
	*(word32 *) 0x50100023 = 0x44920000;
	Eq_78596 a0_35 = phy_get_mac_freq();
	Eq_78600 s0_36 = *(union Eq_78600 *) 0x44B000E4;
	*(union Eq_78600 *) 0x44B000E4 = *(union Eq_78600 *) 0x44B000E4 & -0x0100 | 40;
	uint32 a5_50 = (word32) a0_35.u1 + (*((union Eq_78600 *) 0x44B000E4) >> 8 & 0x03FF) >> (s0_36 & 0x00FF);
	ui32 s2_52 = a5_50 << 8 & 0x00FFFF00;
	if ((a5_50 << 8 & 0x00FC0000) == 0x00)
	{
		*(union Eq_78600 *) 0x44B000E4 = *(union Eq_78600 *) 0x44B000E4 & ~0x0003FF00 | s2_52;
		*(union Eq_78600 *) 0x44B000E4 = *(union Eq_78600 *) 0x44B000E4 & ~0x0FFC0000 | 0x02200000;
		*(union Eq_78648 *) 0x44B000E8 = (word32) a0_35.u1 + (word32) ((word16) (*((union Eq_78648 *) 0x44B000E8) >> 8)) >> (s0_36 & 0x00FF) << 8 & 0x00FFFF00 | *((union Eq_78648 *) 0x44B000E8) & 0xFF0000FF;
		*(union Eq_78668 *) 0x44B000EC = *(union Eq_78668 *) 0x44B000EC & ~0x3FF00000 | 0x02700000;
		uint32 a5_104 = (word32) a0_35.u1 + (*((union Eq_78668 *) 0x44B000EC) >> 0x0A & 0x03FF) >> (s0_36 & 0x00FF);
		ui32 s2_106 = a5_104 << 0x0A & 0x03FFFC00;
		if ((a5_104 << 0x0A & 0x03F00000) == 0x00)
		{
			*(union Eq_78668 *) 0x44B000EC = *(union Eq_78668 *) 0x44B000EC & ~0x000FFC00 | s2_106;
			*(union Eq_78668 *) 0x44B000EC = *(union Eq_78668 *) 0x44B000EC & -0x0400 | 0x00B4;
			ui32 a0_122 = 0x03;
			if (a0_35 > 0x1D)
			{
				a0_122 = 0x02;
				if (a0_35 > 59)
					a0_122 = 0x01;
			}
			blmac_wt_2_crypt_clk_ratio_setf(a0_122);
			*(union Eq_78722 *) 0x44B000F4 = (word32) a0_35.u1 + (*((union Eq_78722 *) 0x44B000F4) >> 8 & 0x0FFFFFFF) >> (s0_36 & 0x00FF) << 8 & 0x00FFFF00 | *((union Eq_78722 *) 0x44B000F4) & 0xFF0000FF;
			*(union Eq_78742 *) 0x44B000F8 = (word32) a0_35.u1 + (*((union Eq_78742 *) 0x44B000F8) >> 8 & 0x0FFFFFFF) >> (s0_36 & 0x00FF) << 8 & 0x00FFFF00 | *((union Eq_78742 *) 0x44B000F8) & 0xFF0000FF;
			uint32 s2_171 = (word32) a0_35.u1 + (*((union Eq_78763 *) 0x44B00104) >> 0x14 & 0x03FF) >> (s0_36 & 0x00FF);
			if ((s2_171 << 20 & 0xC0000000) == 0x00)
			{
				*(union Eq_78763 *) 0x44B00104 = *(union Eq_78763 *) 0x44B00104 & ~0x3FF00000 | s2_171 << 20;
				uint32 a5_194 = (word32) a0_35.u1 + (*((union Eq_78763 *) 0x44B00104) >> 0x0A & 0x03FF) >> (s0_36 & 0x00FF);
				ui32 s2_196 = a5_194 << 0x0A & 0x03FFFC00;
				if ((a5_194 << 0x0A & 0x03F00000) == 0x00)
				{
					*(union Eq_78763 *) 0x44B00104 = *(union Eq_78763 *) 0x44B00104 & ~0x000FFC00 | s2_196;
					uint32 s0_214 = (word32) a0_35.u1 + (*((union Eq_78763 *) 0x44B00104) & 0x03FF) >> (s0_36 & 0x00FF);
					ui32 s2_219 = (word32) (word16) s0_214;
					if ((s0_214 & 0x0FFFFC00) == 0x00)
					{
						*(union Eq_78763 *) 0x44B00104 = *(union Eq_78763 *) 0x44B00104 & -0x0400 | s2_219;
						*(word32 *) 0x8373F1C0 = 0x44B08000;
						struct Eq_78845 * a5_235 = *(struct Eq_78845 **) 0x8373F198;
						*(struct Eq_78845 **) 0x83000198 = a5_235;
						if (a5_235->t00D8 >> 24 > 0x10)
						{
							word32 s11_402;
							struct Eq_8573 * a0_257;
							word32 t4_403;
							word32 s9_400;
							word32 s10_401;
							word32 s7_398;
							word32 s8_399;
							word32 s5_396;
							word32 s6_397;
							word32 s3_394;
							word32 s4_395;
							word32 a7_392;
							word32 s2_393;
							word32 a4_390;
							word32 a5_391;
							word32 a2_388;
							word32 a3_389;
							word32 s1_386;
							word32 a1_387;
							Eq_2 ra_265 = printf(ra, &g_t23077F68, 0x08, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_386, out a0_257, out a1_387, out a2_388, out a3_389, out a4_390, out a5_391, out a7_392, out s2_393, out s3_394, out s4_395, out s5_396, out s6_397, out s7_398, out s8_399, out s9_400, out s10_401, out s11_402, out t4_403);
							((union Eq_9057 *) 0x44B000D8)->u0 = 0x00021108;
							*(word32 *) 0x44B08080 = 0x800A07C0;
							struct Eq_78909 * s0_287 = *(struct Eq_78909 **) 0x800A080C;
							*(struct Eq_78909 **) 0x840A080C = s0_287;
							blmac_rx_flow_cntrl_en_setf.constprop.9(0x840A07C0);
							*(struct Eq_78909 **) 0x8000003E = s0_287;
							s0_287->dw0114 = 0x0003010A;
							*(struct Eq_78909 **) 0xFF9000C8 = s0_287;
							s0_287->dw0150 = 0x01000000;
							s0_287->dw0224 = 0x00;
							s0_287->dw00A0 = 0x02000020;
							struct Eq_78938 * s0_310 = *(struct Eq_78938 **) 0x0200006C;
							*(struct Eq_78938 **) 0x0300006C = s0_310;
							blmac_key_sto_ram_reset_setf.constprop.12((struct Eq_78498 *) 0x03000020);
							s0_310->dw0510 = 33553445;
							s0_310->dw0310 |= 0x0080;
							ui32 s0_327 = phy_get_ntx(a0_257) + 0x01 << 0x1A;
							if ((s0_327 & 0xE0000000) == 0x00)
							{
								*(int32 *) 0x44B0009C = *(int32 *) 0x44B0009C & ~0x1C000000 | s0_327;
								*(word32 *) 0xE400004B = *(word32 *) 0xE400004B;
								0x00 = (uint16) dwArg38;
								return ra_265;
							}
							else
								assert_err();
						}
						else
							assert_err();
					}
					else
						assert_err();
				}
				else
					assert_err();
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

