pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301ACCE: void hal_machw_disable_int(Register (ptr32 Eq_61505) a3)
// Called from:
//      my_pbuf_free_custom
void hal_machw_disable_int(struct Eq_61505 * a3)
{
	struct Eq_78986 * a5_5 = a3->ptr0074;
	(a3 & 0x7FFFFFFF)->ptr0074 = a5_5;
	a5_5->dw0080 &= 0x7FFFFFFF;
}

// 2301ACEC: Register Eq_2 hal_machw_reset(Register Eq_2 a4, Stack Eq_2 dwArg28)
// Called from:
//      mm_force_idle_req
//      bl_reset_evt
Eq_2 hal_machw_reset(Eq_2 a4, Eq_2 dwArg28)
{
	if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
		a4 = helper_record_all_states(&g_t230779F8, dwArg28);
	Eq_2 a5_25 = *((word32) a4 + 76);
	(a4 & -0x0081)->t004C = a5_25;
	((word32) a5_25 + 56)->u0 = 0x00;
	*(union Eq_2 *) 0xD0 = a5_25;
	do
		a5_25 &= 0x0F;
	while (a5_25 != 0x00);
	Eq_2 a5_38 = *(union Eq_2 *) 0x0080;
	*(union Eq_2 *) 0x7C = a5_38;
	struct Eq_78917 * a3_41 = blmac_rx_flow_cntrl_en_setf.constprop.9(a5_38);
	*(union Eq_2 *) 0x44B0808C &= -64;
	*(word32 *) 0x7B = 0x44B08000;
	*(word32 *) 0x037FF1F7 = 0x44B08000;
	struct Eq_79054 * a5_55 = a3_41->ptr0074;
	(a3_41 & 0x7FFFFFFF | 0x80000000)->ptr0074 = a5_55;
	Eq_2 a4_61 = a5_55->t0080 & 0x7FFFFFFF | 0x80000000;
	a5_55->t0080 = a4_61;
	(a5_55 | 0x0080)->dw004C = a5_55->dw004C;
	return a4_61;
}

// 2301AD84: Register (ptr32 Eq_32497) hal_machw_search_addr(Register (ptr32 Eq_32497) a0, Register out Eq_32498 a3Out, Register out Eq_32499 a4Out)
// Called from:
//      rxu_cntrl_frame_handle
//      apm_auth_handler
struct Eq_32497 * hal_machw_search_addr(struct Eq_32497 * a0, union Eq_32498 & a3Out, union Eq_32499 & a4Out)
{
	*(union Eq_9004 *) 0x44B000BC = (word32) a0->b0003 << 24 | (((word32) a0->b0001 << 8 | (word32) a0->b0000) | (word32) a0->b0002 << 16);
	*(ui32 *) 0x44B000C0 = (word32) a0->b0005 << 8 | (word32) a0->b0004;
	((union Eq_8307 *) 0x44B000C4)->u0 = 0x20000000;
	do
	{
		Eq_8307 a5_26 = *(union Eq_8307 *) 0x44B000C4;
	} while (a5_26 << 0x02 < 0x00);
	struct Eq_32497 * a0_29 = (struct Eq_32497 *) 0x00FF;
	if (a5_26 << 0x03 >= 0x00)
		a0_29 = (a5_26 >> 0x10) + ~0x07 & 0x00FF;
	a3Out = a5_26 << 0x02;
	a4Out = a5_26 << 0x03;
	return a0_29;
}

// 2301ADE4: Register Eq_2 hal_machw_monitor_mode(Register Eq_2 a4)
// Called from:
//      mm_hw_config_handler
Eq_2 hal_machw_monitor_mode(Eq_2 a4)
{
	(a4 & ~0x01)->t0074 = *((word32) a4 + 116);
	struct Eq_79157 * a4_11 = a4 & ~0x01 & ~0x02;
	a4_11->dw0074 = (a4 & ~0x01)->dw0074;
	word32 a5_13 = a4_11->dw004C;
	(a4_11 | 0x0700)->dw004C = a5_13;
	*(word32 *) 0x7FFFFFDE = 0x42018E58;
	int32 a3_19 = g_dw42018E5C;
	(a3_19 | 0x7FFFFFDE)->dw0060 = a5_13;
	struct Eq_78498 * a5_22 = (a3_19 | 0x7FFFFFDE)->ptr004C;
	((a3_19 | 0x7FFFFFDE) & ~0x1C000000 | 0x0C000000)->ptr004C = a5_22;
	return blmac_key_sto_ram_reset_setf.constprop.12(a5_22);
}

// 2301AE2A: Register word32 hal_machw_sleep_check(Register out Eq_2 a3Out)
// Called from:
//      bl_sleep
word32 hal_machw_sleep_check(union Eq_2 & a3Out)
{
	Eq_2 a0_10 = *(union Eq_2 *) 0x44B0808C;
	ui32 a5_12;
	for (a5_12 = 0x00; a5_12 != 0x09; ++a5_12)
	{
		word32 s0_35;
		if ((0x01 << a5_12 & a0_10) != 0x00)
		{
			struct Eq_79214 * a3_21 = a5_12 << 0x02;
			a3 = &a3_21->dw44B00128;
			int32 a4_30 = -2000 - *((union Eq_2 *) 0x44B00120) + a3_21->dw44B00128;
			if (a4_30 < 0x00)
			{
				a3 = *(union Eq_2 *) 0x44B00120;
				s0_35 = 0x00;
				if (0x01000388 - a3 + a4_30 >= 0x00)
					goto l2301AE98;
				assert_err();
			}
		}
	}
	s0_35 = 0x01;
l2301AE98:
	a3Out = a3;
	return s0_35;
}

// 2301AEAC: void hal_machw_gen_handler(Register (ptr32 Eq_79247) s0, Register Eq_2 a4, Register ptr32 mstatus)
void hal_machw_gen_handler(struct Eq_79247 * s0, Eq_2 a4, ptr32 mstatus)
{
	struct Eq_79250 * s0_13 = s0 & a4;
	s0_13->dw0070 = s0->dw0074;
	if ((s0_13 & 0x00040001) != 0x00)
	{
		word32 a5_322;
		a4 = ke_evt_set(0x00400000, a4, mstatus, out a5_322);
	}
	if ((s0_13 & 0x00080002) != 0x00)
	{
		word32 a5_323;
		a4 = ke_evt_set(0x00200000, a4, mstatus, out a5_323);
	}
	if ((s0_13 & 4) != 0x00)
	{
		if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
		{
			word32 a5_326;
			word32 a2_325;
			assert_rec(mstatus, out a2_325, out a4, out a5_326);
		}
		else
		{
			*(union Eq_2 *) 0x44B0808C &= -33;
			*(struct Eq_16363 **) 0x44B08004 = *(struct Eq_16363 **) 0x44B08004;
			word32 a5_324;
			a4 = ke_evt_set(0x00800000, 0x44B08000, mstatus, out a5_324);
		}
	}
	if ((s0_13 & 8) != 0x00)
	{
		Eq_13963 s1_63 = *(union Eq_13963 *) 0x44B08084;
		*(union Eq_13963 *) 0x44B08088 = s1_63;
		if ((s1_63 & 0x0100) != 0x00)
		{
			word32 a5_327;
			a4 = ke_evt_set(0x04000000, a4, mstatus, out a5_327);
		}
		if ((s1_63 & 64) != 0x00)
			a4 = rxl_timeout_int_handler();
		if ((s1_63 & 0x0080) != 0x00)
		{
			word32 a5_331;
			ke_evt_set(0x08000000, a4, mstatus, out a5_331);
		}
		if ((s1_63 & 1) != 0x00)
		{
			word32 a2_332;
			word32 a4_333;
			word32 a5_334;
			assert_rec(mstatus, out a2_332, out a4_333, out a5_334);
		}
		if ((s1_63 & 2) != 0x00 || ((s1_63 & 4) != 0x00 || ((s1_63 & 8) != 0x00 || ((s1_63 & 16) != 0x00 || (s1_63 & 32) != 0x00))))
		{
			word32 a2_335;
			word32 a4_336;
			word32 a5_337;
			assert_rec(mstatus, out a2_335, out a4_336, out a5_337);
		}
	}
	if ((s0_13 & 0x0080) == 0x00 && ((s0_13 & 0x0100) == 0x00 && (s0_13 << 0x13 >= 0x00 && (s0_13 << 0x12 >= 0x00 && (s0_13 << 0x11 >= 0x00 && (s0_13 << 0x10 >= 0x00 && (s0_13 << 0x0F >= 0x00 && (s0_13 << 0x0E >= 0x00 && (s0_13 << 0x0A >= 0x00 && (s0_13 << 0x09 >= 0x00 && (s0_13 << 0x07 >= 0x00 && (s0_13 << 0x06 >= 0x00 && s0_13 << 11 >= 0x00))))))))))))
		return;
	word32 a5_330;
	word32 a2_328;
	word32 a4_329;
	assert_rec(mstatus, out a2_328, out a4_329, out a5_330);
}

// 2301B1AE: Register Eq_2 hal_mib_dump(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 s10Out)
// Called from:
//      bl60x_fw_dump_statistic
//      cmd_wifi_mib
Eq_2 hal_mib_dump(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & s10Out)
{
	word32 a0_71;
	word32 a1_72;
	word32 a2_73;
	word32 a4_74;
	word32 a5_75;
	word32 s4_76;
	word32 s8_77;
	puts(0x23078024, out a0_71, out a1_72, out a2_73, out a4_74, out a5_75, out s4_76, out s8_77);
	ptr32 s10_34;
	word32 s1_78;
	word32 a0_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a5_84;
	word32 a7_85;
	word32 s2_86;
	word32 s3_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	word32 s9_93;
	word32 s11_94;
	word32 t4_95;
	Eq_2 ra_32 = printf(ra, &g_t2307804C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_78, out a0_79, out a1_80, out a2_81, out a3_82, out a4_83, out a5_84, out a7_85, out s2_86, out s3_87, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92, out s9_93, out s10_34, out s11_94, out t4_95);
	ptr32 a0_50;
	word32 a1_96;
	word32 a2_97;
	word32 a4_98;
	word32 a5_99;
	word32 s4_100;
	word32 s8_101;
	s1Out = puts(0x230727FC, out a0_50, out a1_96, out a2_97, out a4_98, out a5_99, out s4_100, out s8_101);
	a0Out = a0_50;
	s10Out = s10_34;
	return ra_32;
}

