pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301B1E4: void mm_monitor_channel_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack word32 dwArg0148)
void mm_monitor_channel_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, word32 dwArg0148)
{
	Eq_2 a0_18;
	word32 a1_19;
	struct Eq_79532 * a2_20;
	struct Eq_63365 * s3_29;
	word32 s1_151;
	word32 a4_152;
	word32 a5_153;
	word32 s0_150;
	word32 a6_154;
	word32 s2_155;
	word32 s4_156;
	word32 s8_157;
	word32 a3_21;
	Eq_2 ra_25 = ke_msg_alloc(ra, 95, a3, 40, a4, mstatus, dwArg08, out s0_150, out s1_151, out a0_18, out a1_19, out a2_20, out a3_21, out a4_152, out a5_153, out a6_154, out s2_155, out s3_29, out s4_156, out s8_157);
	*(union Eq_2 *) 0x01 = a0_18;
	*(union Eq_2 *) 0x1111111D = a0_18;
	*(union Eq_2 *) 0x22222232 = a0_18;
	*(union Eq_2 *) 0x33333347 = a0_18;
	*(union Eq_2 *) 0x4444445C = a0_18;
	*(union Eq_2 *) 0x55555571 = a0_18;
	*(union Eq_2 *) 0x66666686 = a0_18;
	*((word32) a0_18 + 8) = 0x00;
	*(union Eq_2 *) 0x7777779B = a0_18;
	a2_20->t0004 = a0_18;
	word32 a2_66 = (word32) (word16) a2_20;
	if (a1_19 != 0x00)
	{
		a3_21 = a2_66 + 0x0A;
		if (false)
			a3_21 = a2_66 + -0x0A;
	}
	Eq_2 s0_97;
	word32 s1_158;
	word32 s2_159;
	word32 s3_160;
	word32 fflags_161;
	word32 frm_162;
	phy_set_channel(ra_25, 0x00, (word32) (a1_19 != 0x00), (word32) (word16) a3_21, s3_29, fflags, frm, s0, dwArg14, dwArg0148, out s0_97, out s1_158, out s2_159, out s3_160, out fflags_161, out frm_162);
	*s0_97 = 0x00;
	word32 s1_163;
	word32 a0_164;
	word32 a1_165;
	word32 a2_166;
	word32 a3_167;
	word32 a4_168;
	word32 a5_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s8_173;
	ke_msg_send(s0_97, mstatus, out s1_163, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_170, out s3_171, out s4_172, out s8_173);
}

// 2301B290: void mm_monitor_enable_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg0108)
void mm_monitor_enable_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg0108)
{
	Eq_2 a0_18;
	word32 s0_179;
	word32 s1_180;
	word32 a1_181;
	word32 a2_182;
	word32 a3_183;
	word32 a4_184;
	word32 a5_185;
	word32 a6_186;
	word32 s2_187;
	word32 s3_188;
	word32 s4_189;
	word32 s8_190;
	Eq_2 ra_25 = ke_msg_alloc(ra, 93, a3, 40, a4, mstatus, dwLoc38, out s0_179, out s1_180, out a0_18, out a1_181, out a2_182, out a3_183, out a4_184, out a5_185, out a6_186, out s2_187, out s3_188, out s4_189, out s8_190);
	*(union Eq_2 *) 0x01 = a0_18;
	*(union Eq_2 *) 0x1111111D = a0_18;
	*(union Eq_2 *) 0x22222232 = a0_18;
	*(union Eq_2 *) 0x33333347 = a0_18;
	*(union Eq_2 *) 0x4444445C = a0_18;
	*(union Eq_2 *) 0x55555571 = a0_18;
	*(union Eq_2 *) 0x66666686 = a0_18;
	*((word32) a0_18 + 8) = 0x00;
	*(union Eq_2 *) 0x7777779B = a0_18;
	Eq_2 s1_60 = *(union Eq_2 *) 0x77777777;
	*(union Eq_2 *) 0x7777777B = a0_18;
	struct Eq_63365 * s3_88;
	word32 t1_191;
	word32 a0_192;
	word32 a1_193;
	word32 a2_194;
	word32 a3_195;
	word32 a4_196;
	word32 a5_197;
	word32 s0_198;
	word32 s1_199;
	word32 s2_200;
	word32 s3_201;
	word32 fflags_202;
	word32 frm_203;
	phy_set_channel(phy_init(memset(ra_25, fp + -80, 0x00, 64, out t1_191, out a0_192, out a1_193, out a2_194, out a3_195, out a4_196, out a5_197), s1_60, dwLoc18, out s3_88), 0x00, null, 16775557, s3_88, fflags, frm, dwLoc4C, s0, dwArg0108, out s0_198, out s1_199, out s2_200, out s3_201, out fflags_202, out frm_203);
	word32 a4_204;
	word32 s2_205;
	Eq_2 s0_140 = mm_active(mstatus, out a4_204, out s2_205);
	*s0_140 = 0x00;
	word32 s1_206;
	word32 a0_207;
	word32 a1_208;
	word32 a2_209;
	word32 a3_210;
	word32 a4_211;
	word32 a5_212;
	word32 s2_213;
	word32 s3_214;
	word32 s4_215;
	word32 s8_216;
	ke_msg_send(s0_140, mstatus, out s1_206, out a0_207, out a1_208, out a2_209, out a3_210, out a4_211, out a5_212, out s2_213, out s3_214, out s4_215, out s8_216);
}

// 2301B33E: void mm_cfg_rssi_req_handler(Register (ptr32 Eq_79787) a1, Stack word32 dwArg38)
void mm_cfg_rssi_req_handler(struct Eq_79787 * a1, word32 dwArg38)
{
	struct Eq_79789 * s1_13 = (word32) a1->b0000;
	if ((word32) s1_13->b4201AA3E == 0x00)
	{
		s1_13->b4201AA5E = (byte) (int32) a1->b0001;
		word32 a4_34 = (word32) a1->b0002;
		s1_13->b4201AA60 = 0x00;
		s1_13->b4201AA5F = (byte) a4_34;
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 2301B3B0: void mm_set_ps_options_req_handler(Register Eq_2 ra, Register (ptr32 Eq_79825) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack word32 dwArg0128)
void mm_set_ps_options_req_handler(Eq_2 ra, struct Eq_79825 * a1, Eq_2 a3, ptr32 mstatus, word32 dwArg0128)
{
	struct Eq_79829 * s1_15 = (word32) a1->b0000;
	if ((word32) s1_15->b4201AA3E == 0x00)
	{
		s1_15->w4201AA44 = (word16) (word32) a1->w0002;
		Eq_2 a4_42 = (word32) a1->b0004;
		s1_15->b4201AA46 = (byte) a4_42;
		word32 s0_81;
		word32 s1_82;
		word32 a0_83;
		word32 a3_84;
		word32 s2_85;
		word32 s3_86;
		word32 s4_87;
		word32 s8_88;
		ke_msg_send_basic(ra, 76, a3, a4_42, mstatus, dwLoc28, out s0_81, out s1_82, out a0_83, out a3_84, out s2_85, out s3_86, out s4_87, out s8_88);
		0x00 = dwArg0128;
	}
	else
		assert_err();
}

// 2301B434: void mm_tim_update_req_handler(Register Eq_2 a1)
void mm_tim_update_req_handler(Eq_2 a1)
{
	mm_tim_update(a1);
}

// 2301B446: void mm_bcn_change_req_handler(Register Eq_2 ra, Register (ptr32 Eq_13773) a1, Register (ptr32 Eq_13912) a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118)
void mm_bcn_change_req_handler(Eq_2 ra, struct Eq_13773 * a1, struct Eq_13912 * a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg7C, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0118)
{
	mm_bcn_change(ra, a1, a4, s3, s5, s6, fflags, frm, mstatus, dwArg08, dwArg7C, dwArgB8, dwArgE8, dwArg0118);
}

// 2301B458: void mm_remain_on_channel_req_handler(Register Eq_2 ra, Register (ptr32 Eq_76884) a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack word32 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
void mm_remain_on_channel_req_handler(Eq_2 ra, struct Eq_76884 * a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, word32 dwArg18, Eq_2 dwArg1C, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	Eq_2 a4_24;
	Eq_2 ra_35 = chan_roc_req(ra, a3, a1, a3, a3, s2, mstatus, s2, dwLoc08, dwArg18, dwArg1C, dwArgB8, dwArgC8, out a4_24);
	if (a3 != 0x00)
	{
		Eq_2 a0_51;
		byte * s1_60;
		word32 s2_61;
		word32 s3_143;
		word32 a6_142;
		word32 a5_141;
		word32 a4_140;
		word32 a3_139;
		word32 a2_138;
		word32 a1_137;
		word32 s0_136;
		word32 s4_144;
		word32 s8_145;
		ke_msg_alloc(ra_35, 71, a3, 0x03, a4_24, mstatus, dwLoc08, out s0_136, out s1_60, out a0_51, out a1_137, out a2_138, out a3_139, out a4_140, out a5_141, out a6_142, out s2_61, out s3_143, out s4_144, out s8_145);
		word32 a4_69 = (word32) *s1_60;
		*((word32) a0_51 + 1) = (byte) s2_61;
		a0_51->u1 = (byte) a4_69;
		((word32) a0_51 + 2)->u1 = 0x04;
		word32 s1_146;
		word32 a0_147;
		word32 a1_148;
		word32 a2_149;
		word32 a3_150;
		word32 a4_151;
		word32 a5_152;
		word32 s2_153;
		word32 s3_154;
		word32 s4_155;
		word32 s8_156;
		ke_msg_send(a0_51, mstatus, out s1_146, out a0_147, out a1_148, out a2_149, out a3_150, out a4_151, out a5_152, out s2_153, out s3_154, out s4_155, out s8_156);
	}
}

// 2301B4A6: void mm_sta_del_req_handler(Register Eq_2 ra, Register word32 s1, Register (ptr32 byte) a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack word32 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void mm_sta_del_req_handler(Eq_2 ra, word32 s1, byte * a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, word32 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	Eq_2 a3_18;
	Eq_2 a4_19;
	word32 s0_78;
	word32 s1_79;
	word32 a0_80;
	word32 a3_81;
	word32 s2_82;
	word32 s3_83;
	word32 s4_84;
	word32 s8_85;
	ke_msg_send_basic(mm_sta_del(ra, s1, (word32) *a1, s2, mstatus, dwArg28, dwArg38, ra, dwArg88, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out a3_18, out a4_19), 0x0D, a3_18, a4_19, mstatus, dwLoc18, out s0_78, out s1_79, out a0_80, out a3_81, out s2_82, out s3_83, out s4_84, out s8_85);
}

// 2301B4CA: void mm_sta_add_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void mm_sta_add_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	word32 a0_18;
	Eq_2 a4_22;
	Eq_2 a5_23;
	struct Eq_10270 * s1_27;
	Eq_2 s2_28;
	Eq_2 s0_49;
	word32 a0_68;
	word32 s0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a3_113;
	word32 a6_114;
	word32 s3_115;
	word32 s4_116;
	word32 s8_117;
	word32 s4_118;
	word32 s5_119;
	mm_sta_add(ke_msg_alloc(ra, 11, a3, 0x03, a4, mstatus, dwArg08, out s0_110, out s1_27, out a0_18, out a1_111, out a2_112, out a3_113, out a4_22, out a5_23, out a6_114, out s2_28, out s3_115, out s4_116, out s8_117), s1_27, s1_27, a0_18 + 1, a4_22, a5_23, s2_28, s7, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_49, out a0_68, out s4_118, out s5_119);
	s0_49->u1 = (byte) a0_68;
	word32 s1_120;
	word32 a0_121;
	word32 a1_122;
	word32 a2_123;
	word32 a3_124;
	word32 a4_125;
	word32 a5_126;
	word32 s2_127;
	word32 s3_128;
	word32 s4_129;
	word32 s8_130;
	ke_msg_send(s0_49, mstatus, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s8_130);
}

// 2301B504: void mm_key_del_req_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg0108)
void mm_key_del_req_handler(Eq_2 ra, byte * a1, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg0108)
{
	if ((word32) (*(union Eq_9057 *) 0x44B000D8 >> 24) + 1 >= (word32) (*a1))
	{
		Eq_2 a4_33;
		word32 a2_83;
		word32 s2_84;
		word32 s3_85;
		word32 s6_86;
		word32 s0_87;
		word32 s1_88;
		word32 a0_89;
		word32 a3_90;
		word32 s2_91;
		word32 s3_92;
		word32 s4_93;
		word32 s8_94;
		ke_msg_send_basic(ra, 39, mm_sec_machwkey_del((word32) *a1, dwArg0108, out a2_83, out a4_33, out s2_84, out s3_85, out s6_86), a4_33, mstatus, dwLoc08, out s0_87, out s1_88, out a0_89, out a3_90, out s2_91, out s3_92, out s4_93, out s8_94);
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 2301B562: void mm_key_add_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgF8)
void mm_key_add_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgF8)
{
	struct Eq_9677 * s0_26;
	word32 s1_111;
	word32 a0_112;
	word32 a1_113;
	word32 a2_114;
	word32 a3_115;
	word32 a4_116;
	word32 a5_117;
	word32 a6_118;
	word32 s2_119;
	word32 s3_120;
	word32 s4_121;
	word32 s8_122;
	Eq_2 ra_25 = ke_msg_alloc(ra, 37, a3, 0x02, a4, mstatus, dwArg08, out s0_26, out s1_111, out a0_112, out a1_113, out a2_114, out a3_115, out a4_116, out a5_117, out a6_118, out s2_119, out s3_120, out s4_121, out s8_122);
	if ((word32) s0_26->b0000 <= 0x03)
	{
		if ((word32) s0_26->b0004 <= 32)
		{
			if ((word32) s0_26->b0028 <= 0x05)
			{
				word32 a0_59;
				Eq_2 s1_69;
				word32 s0_123;
				word32 a3_124;
				word32 a4_125;
				word32 a5_126;
				word32 s2_127;
				word32 s3_128;
				word32 s4_129;
				word32 s5_130;
				mm_sec_machwkey_wr(ra_25, s0_26, dwArgF8, out s0_123, out s1_69, out a0_59, out a3_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s5_130);
				*((word32) s1_69 + 1) = (byte) a0_59;
				s1_69->u1 = 0x00;
				word32 s1_131;
				word32 a0_132;
				word32 a1_133;
				word32 a2_134;
				word32 a3_135;
				word32 a4_136;
				word32 a5_137;
				word32 s2_138;
				word32 s3_139;
				word32 s4_140;
				word32 s8_141;
				ke_msg_send(s1_69, mstatus, out s1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137, out s2_138, out s3_139, out s4_140, out s8_141);
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 2301B602: void mm_set_power_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void mm_set_power_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	struct Eq_20224 * a0_21;
	Eq_2 a3_24;
	struct Eq_80306 * s1_30;
	struct Eq_80307 * s2_31;
	word32 s0_100;
	word32 a1_101;
	word32 a2_102;
	word32 a4_103;
	word32 a5_104;
	word32 a6_105;
	word32 s3_106;
	word32 s4_107;
	word32 s8_108;
	Eq_2 ra_28 = ke_msg_alloc(ra, 47, a3, 0x02, a4, mstatus, dwArg08, out s0_100, out s1_30, out a0_21, out a1_101, out a2_102, out a3_24, out a4_103, out a5_104, out a6_105, out s2_31, out s3_106, out s4_107, out s8_108);
	s1_30->b4201AA42 = (byte) (int32) s2_31->b0001;
	a0_21->b0001 = (byte) (int32) s1_30->b4201AA41;
	s1_30->b4201AA41 = 0x7F;
	word32 s1_109;
	word32 a3_110;
	word32 a4_111;
	word32 s2_112;
	word32 s3_113;
	word32 s1_114;
	word32 a0_115;
	word32 a1_116;
	word32 a2_117;
	word32 a3_118;
	word32 a4_119;
	word32 a5_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s8_124;
	ke_msg_send(tpc_update_vif_tx_power(ra_28, (char *) s1_30 + 1107405288, &a0_21->b0001, a0_21, a3_24, fflags, frm, out s1_109, out a3_110, out a4_111, out s2_112, out s3_113), mstatus, out s1_114, out a0_115, out a1_116, out a2_117, out a3_118, out a4_119, out a5_120, out s2_121, out s3_122, out s4_123, out s8_124);
	0x00 = dwArg38;
}

// 2301B668: void mm_set_idle_req_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void mm_set_idle_req_handler(Eq_2 ra, byte * a1, Eq_2 a2, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18)
{
	word32 a0_19;
	word32 s2_190;
	word32 a4_189;
	word32 a2_188;
	ke_state_get(a2, dwArg18, out a0_19, out a2_188, out a4_189, out s2_190);
	if (a0_19 == 0x03)
		return;
	Eq_2 a4_46;
	Eq_2 s2_51;
	word32 a4_28 = (word32) *a1;
	g_t42018E7A = (byte) a4_28;
	if (a4_28 != 0x00)
	{
		word32 a0_57;
		word32 a2_194;
		Eq_2 s1_61 = ke_state_get(a2, dwArg18, out a0_57, out a2_194, out a4_46, out s2_51);
		if (a0_57 != 0x00)
		{
			if (a0_57 != 0x02)
			{
				hal_machw_idle_req(a4_46, mstatus);
				word32 s1_195;
				word32 a0_196;
				word32 a1_197;
				word32 a4_198;
				word32 a5_199;
				word32 s2_200;
				word32 s3_201;
				word32 s4_202;
				ke_state_set(a2, 0x02, mstatus, out s1_195, out a0_196, out a1_197, out a4_198, out a5_199, out s2_200, out s3_201, out s4_202);
			}
			return;
		}
		if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
			assert_err();
		((word32) s1_61 + 18)->u0 = 0x00;
	}
	else
	{
		word32 a0_34;
		word32 a4_192;
		word32 s2_193;
		word32 a2_191;
		ke_state_get(a2, dwArg18, out a0_34, out a2_191, out a4_192, out s2_193);
		if (a0_34 == 0x02)
			return;
		mm_active(mstatus, out a4_46, out s2_51);
	}
	word32 s0_203;
	word32 s1_204;
	word32 a0_205;
	word32 a3_206;
	word32 s2_207;
	word32 s3_208;
	word32 s4_209;
	word32 s8_210;
	ke_msg_send_basic(ra, 35, s2_51, a4_46, mstatus, s2, out s0_203, out s1_204, out a0_205, out a3_206, out s2_207, out s3_208, out s4_209, out s8_210);
}

