pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301B70E: void mm_reset_req_handler(Register Eq_2 ra, Register ui32 s0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArgF8, Stack Eq_2 dwArg0148)
void mm_reset_req_handler(Eq_2 ra, ui32 s0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArgD8, Eq_2 dwArgE8, word32 dwArgF8, Eq_2 dwArg0148)
{
	__csrrc(mstatus, 0x08);
	hal_machw_stop(s0);
	phy_stop();
	ui32 s0_24;
	Eq_2 a3_37;
	Eq_2 a4_38;
	word32 s0_127;
	Eq_2 ra_42 = mm_init(me_init(ra, mstatus, out s0_24), s0_24, mstatus, dwLoc18, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg68, ra, dwArg7C, dwArg8C, dwArgD8, dwArgE8, dwArgF8, dwArg0148, out s0_127, out a3_37, out a4_38);
	__csrrs(mstatus, 0x08);
	word32 s0_128;
	word32 s1_129;
	word32 a0_130;
	word32 a3_131;
	word32 s2_132;
	word32 s3_133;
	word32 s4_134;
	word32 s8_135;
	ke_msg_send_basic(ra_42, 0x01, a3_37, a4_38, mstatus, dwLoc18, out s0_128, out s1_129, out a0_130, out a3_131, out s2_132, out s3_133, out s4_134, out s8_135);
	word32 s1_136;
	word32 a0_137;
	word32 a1_138;
	word32 a4_139;
	word32 a5_140;
	word32 s2_141;
	word32 s3_142;
	word32 s4_143;
	ke_state_set(0x00, 0x00, mstatus, out s1_136, out a0_137, out a1_138, out a4_139, out a5_140, out s2_141, out s3_142, out s4_143);
}

// 2301B74A: void mm_version_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void mm_version_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_14;
	struct Eq_80605 * a4_18;
	word32 s0_69;
	word32 s1_70;
	word32 a1_71;
	word32 a2_72;
	word32 a3_73;
	word32 a5_74;
	word32 a6_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	ke_msg_alloc(ra, 0x05, a3, 0x18, a4, mstatus, dwArg08, out s0_69, out s1_70, out a0_14, out a1_71, out a2_72, out a3_73, out a4_18, out a5_74, out a6_75, out s2_76, out s3_77, out s4_78, out s8_79);
	*(union Eq_2 *) 0x05040000 = a0_14;
	Eq_2 a5_34 = a4_18->t0004;
	a4_18->t0004 = a0_14;
	*((word32) a0_14 + 4104) = *((word32) a5_34 + 8);
	phy_get_version((word32) a0_14 + 0x0C, (word32) a0_14 + 16);
	*(union Eq_2 *) 0x08FFF9F3 = a0_14;
	word32 s1_80;
	word32 a0_81;
	word32 a1_82;
	word32 a2_83;
	word32 a3_84;
	word32 a4_85;
	word32 a5_86;
	word32 s2_87;
	word32 s3_88;
	word32 s4_89;
	word32 s8_90;
	ke_msg_send(a0_14, mstatus, out s1_80, out a0_81, out a1_82, out a2_83, out a3_84, out a4_85, out a5_86, out s2_87, out s3_88, out s4_89, out s8_90);
}

// 2301B792: void mm_start_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack word32 dwArg0148)
void mm_start_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, word32 dwArg38, word32 dwArg0148)
{
	word32 a0_19;
	word32 a2_181;
	word32 a4_182;
	word32 s2_183;
	Eq_2 s1_23 = ke_state_get(a2, dwArg28, out a0_19, out a2_181, out a4_182, out s2_183);
	if (a0_19 == 0x00)
	{
		struct Eq_63365 * s3_43;
		ptr32 fflags_67;
		ptr32 frm_68;
		Eq_2 s2_73;
		word32 s0_184;
		word32 s1_185;
		word32 s3_186;
		Eq_2 ra_69 = phy_set_channel(phy_init(ra, s1_23, dwArg28, out s3_43), 0x00, null, 0x00FFF96C, s3_43, fflags, frm, s0, dwArg14, dwArg0148, out s0_184, out s1_185, out s2_73, out s3_186, out fflags_67, out frm_68);
		struct Eq_80727 * a5_95;
		word32 a4_187;
		tpc_update_tx_power(ra_69, fflags_67, frm_68, out a4_187, out a5_95);
		struct Eq_80733 * s1_100 = a5_95->ptr0040;
		g_ptr42019ED0 = (char *) &a5_95->ptr0040 + 936;
		Eq_2 a4_108 = (word32) s1_100->w0044;
		g_w42019E78 = (word16) a4_108;
		word32 s0_188;
		word32 s1_189;
		word32 a0_190;
		word32 a3_191;
		word32 s2_192;
		word32 s3_193;
		word32 s4_194;
		word32 s8_195;
		ke_msg_send_basic(ra_69, 0x03, s2_73, a4_108, mstatus, dwLoc08, out s0_188, out s1_189, out a0_190, out a3_191, out s2_192, out s3_193, out s4_194, out s8_195);
		Eq_2 a4_133;
		word32 s2_196;
		Eq_2 s0_136 = mm_active(mstatus, out a4_133, out s2_196);
		hal_machw_idle_req(a4_133, mstatus);
		word32 s1_197;
		word32 a0_198;
		word32 a1_199;
		word32 a4_200;
		word32 a5_201;
		word32 s2_202;
		word32 s3_203;
		word32 s4_204;
		ke_state_set(s0_136, 0x02, mstatus, out s1_197, out a0_198, out a1_199, out a4_200, out a5_201, out s2_202, out s3_203, out s4_204);
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 2301B828: void mm_set_ps_mode_req_handler(Register Eq_2 ra, Register word32 s0, Register (ptr32 byte) a1, Register word32 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0168)
void mm_set_ps_mode_req_handler(Eq_2 ra, word32 s0, byte * a1, word32 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0168)
{
	ui32 a0_9 = (word32) *a1;
	if (a0_9 == 0x03)
	{
		Eq_2 s0_48 = g_t4201AFC8;
		while (s0_48 != 0x00)
		{
			if ((word32) *((word32) s0_48 + 86) == 0x00 && (word32) (*((word32) s0_48 + 88)) != 0x00)
				ra = ps_polling_frame(ra, fflags, frm, mstatus, dwLoc08, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0118, out s0_48, out a4);
			s0_48 = *s0_48;
		}
		word32 s0_225;
		word32 s1_226;
		word32 a0_227;
		word32 a3_228;
		word32 s2_229;
		word32 s3_230;
		word32 s4_231;
		word32 s8_232;
		ke_msg_send_basic(ra, 50, (word32) g_w42018EB2, a4, mstatus, dwLoc08, out s0_225, out s1_226, out a0_227, out a3_228, out s2_229, out s3_230, out s4_231, out s8_232);
	}
	else
		ps_set_mode(ra, a0_9, a3, fflags, frm, mstatus, dwLoc10, s0, dwArg18, dwArg38, dwArg48, dwArg7C, dwArg98, dwArgB8, dwArgD8, dwArg0168);
}

// 2301B87C: void mm_force_idle_req_handler(Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_force_idle_req_handler(Eq_2 a2, ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_15;
	Eq_2 a4_17;
	word32 a2_120;
	word32 s2_121;
	Eq_2 s1_19 = ke_state_get(a2, dwArg28, out a0_15, out a2_120, out a4_17, out s2_121);
	if (a0_15 == 0x00)
	{
		if ((*(ui32 *) 0x44B00038 & 0x0F) == 0x00)
		{
			word32 a0_33;
			<anonymous> * a5_36;
			word32 a1_45;
			word32 s1_130;
			word32 a4_131;
			word32 s2_132;
			word32 s3_133;
			word32 s4_134;
			ke_state_set(s1_19, 0x03, mstatus, out s1_130, out a0_33, out a1_45, out a4_131, out a5_36, out s2_132, out s3_133, out s4_134);
			a5_36();
		}
		else
			assert_err();
	}
	else if (a0_15 != 0x02)
	{
		hal_machw_idle_req(a4_17, mstatus);
		word32 s1_122;
		word32 a0_123;
		word32 a1_124;
		word32 a4_125;
		word32 a5_126;
		word32 s2_127;
		word32 s3_128;
		word32 s4_129;
		ke_state_set(s1_19, 0x02, mstatus, out s1_122, out a0_123, out a1_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129);
	}
}

// 2301B8E0: void mm_hw_config_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack word32 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118, Stack word32 dwArg0128)
void mm_hw_config_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, word32 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0118, word32 dwArg0128)
{
	Eq_2 s0_144 = a1;
	Eq_2 s3_136 = a3;
	word32 a0_33;
	Eq_80982 s2_38;
	word32 a2_1298;
	Eq_2 a4_154;
	Eq_2 s1_37 = ke_state_get(a2, dwArg08, out a0_33, out a2_1298, out a4_154, out s2_38);
	if (a0_33 != 0x00)
	{
		if ((word32) (word16) (a0_33 + ~0x01) > 0x01)
		{
			g_b42018E6B = (byte) (*(ui32 *) 0x44B00038 & 0x0F);
			word32 a0_759;
			Eq_2 a4_761;
			word32 a2_1299;
			word32 s2_1300;
			Eq_2 s1_763 = ke_state_get(s1_37, dwArg08, out a0_759, out a2_1299, out a4_761, out s2_1300);
			g_t42018E6A = (byte) a0_759;
			hal_machw_idle_req(a4_761, mstatus);
			word32 s4_1308;
			word32 s3_1307;
			word32 s2_1306;
			word32 a1_1303;
			word32 a4_1304;
			word32 a5_1305;
			word32 s1_1301;
			word32 a0_1302;
			ke_state_set(s1_763, 0x02, mstatus, out s1_1301, out a0_1302, out a1_1303, out a4_1304, out a5_1305, out s2_1306, out s3_1307, out s4_1308);
		}
		goto l2301BAE2;
	}
	if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
		assert_err();
	Eq_2 s1_594;
	struct Eq_81050 * s4_597;
	Eq_2 a1_177;
	Eq_2 a0_178;
	if (s2_38 == 22)
	{
		a4_154 = g_t4201D1F8;
		struct Eq_81059 * s0_54 = *a3;
		*((word32) a3 + 4) = ((word32) *((word32) a1 + 5) + 0x04 << 2) + 0x42018E58;
		if (a4_154 != 0x00)
		{
			a4_154 = (word32) *((word16) a4_154.u0 + 4);
			if (a4_154 == (word32) s0_54->b0005)
			{
				*(word32 *) 0x44B000DC = 0x10;
				a4_154.u0 = 0x10;
			}
		}
		a1_177 = a3;
		a0_178.u0 = 0x17;
		goto l2301BAA6;
	}
	Eq_2 a0_197;
	if (s2_38 <= 22)
	{
		if (s2_38 == 0x0E)
		{
			int32 a4_417 = g_dw42018E5C;
			g_dw42018E58 = 0x0E;
			(a4_417 | 0x0E)->dw0060 = 0x44B00000;
			a4_154.u0 = 0x44B00000;
			a1_177 = a3;
			a0_178.u0 = 0x0F;
			goto l2301BAA6;
		}
		Eq_2 s2_489;
		if (s2_38 <= 0x0E)
		{
			if (s2_38 != 0x06)
			{
				if (s2_38 != 0x08)
					goto l2301B960;
				struct Eq_24669 * a0_603 = (word32) *a1;
				if (a0_603 <= (struct Eq_24669 *) 0x01)
					ra = vif_mgmt_unregister(ra, s1_37, a0_603, a3, a4_154, 0x01, mstatus, dwLoc18, dwArg10, dwArg14, dwArg48, s3, out a4_154, out s3_136);
				if (g_t4201AFC8 == 0x00)
					a4_154 = hal_machw_monitor_mode(a4_154);
				a1_177 = s3_136;
				a0_178.u0 = 0x09;
l2301BAA6:
				word32 s8_1355;
				word32 s3_1354;
				word32 a0_1351;
				word32 a3_1352;
				word32 s2_1353;
				word32 s0_1350;
				ke_msg_send_basic(ra, a0_178, a1_177, a4_154, mstatus, s6, out s0_1350, out s1_594, out a0_1351, out a3_1352, out s2_1353, out s3_1354, out s4_597, out s8_1355);
				goto l2301BAAA;
			}
			struct Eq_81106 * s0_538;
			Eq_2 s1_539;
			word32 s8_1319;
			word32 s4_1318;
			word32 a6_1315;
			word32 s2_1316;
			word32 s3_1317;
			word32 a4_1313;
			word32 a5_1314;
			word32 a2_1311;
			word32 a3_1312;
			word32 a1_1310;
			word32 a0_1309;
			s2_489->u1 = (byte) vif_mgmt_register(ke_msg_alloc(ra, 0x07, a3, 0x02, a4_154, mstatus, dwLoc18, out s0_538, out s1_539, out a0_1309, out a1_1310, out a2_1311, out a3_1312, out a4_1313, out a5_1314, out a6_1315, out s2_1316, out s3_1317, out s4_1318, out s8_1319), s1_539, &s0_538->b0000 + 1, (word32) s0_538->b0000, (word32) s0_538->b0007, mstatus, dwLoc18, dwArg10, dwArg14, s3, out s2_489);
l2301B9BA:
			a0_197 = s2_489;
			goto l2301B9BC;
		}
		if (s2_38 == 0x12)
		{
			*(int32 *) 0x44B00090 = (word32) *a1 | *((int32 *) 0x44B00090) & -0x0100;
			int32 a4_433 = *(int32 *) 0x44B00090;
			*(int32 *) 0x44B00090 = a4_433 | 0x80000000;
			a1_177 = a3;
			a4_154 = a4_433 | 0x80000000;
			a0_178.u0 = 0x13;
			goto l2301BAA6;
		}
		if (s2_38 == 0x14)
		{
			struct Eq_81356 * a5_440 = (word32) *((word32) a1 + 2);
			uint32 a1_445 = (word32) *a1;
			if ((word32) a5_440->b4201AA3E == 0x00)
			{
				word32 a4_452 = (word32) a5_440->b4201AA48;
				((Eq_363077[]) 4)[a1_445].dw0000 = a4_452 + 0x420190D0;
				a4_154 = a4_452 + 432;
			}
			else
				a4_154 = vif_mgmt_set_ap_bcn_int((char *) a5_440 + 1107405288, a1_445, mstatus);
			a1_177 = a3;
			a0_178.u0 = 0x15;
			goto l2301BAA6;
		}
		if (s2_38 == 0x10)
		{
			Eq_2 a0_470;
			struct Eq_81375 * s0_478;
			struct Eq_63365 * s3_481;
			word32 s8_1336;
			word32 s2_1334;
			word32 s4_1335;
			word32 a6_1333;
			word32 a5_1332;
			word32 a4_1331;
			word32 a3_1330;
			word32 a2_1329;
			word32 s1_1327;
			word32 a1_1328;
			Eq_2 ra_477 = ke_msg_alloc(ra, 0x11, a3, 0x02, a4_154, mstatus, dwLoc18, out s0_478, out s1_1327, out a0_470, out a1_1328, out a2_1329, out a3_1330, out a4_1331, out a5_1332, out a6_1333, out s2_1334, out s3_481, out s4_1335, out s8_1336);
			s2_489 = a0_470;
			if ((word32) s0_478->b0008 != 0x00)
			{
				word32 frm_1341;
				word32 s1_1338;
				word32 s3_1339;
				word32 fflags_1340;
				word32 s0_1337;
				phy_set_channel(ra_477, (word32) s0_478->b0000, (word32) s0_478->b0001, (word32) s0_478->w0004, s3_481, fflags, frm, s8, dwLoc0C, dwArg0128, out s0_1337, out s1_1338, out s2_489, out s3_1339, out fflags_1340, out frm_1341);
			}
			goto l2301B9BA;
		}
	}
	else
	{
		if (s2_38 == 0x1E)
		{
			struct Eq_81191 * s7_70 = (word32) *((word32) a1 + 3);
			Eq_2 a4_77 = (word32) s7_70->b4201AA3E;
			if (a4_77 == 0x00)
			{
				if ((word32) *((word32) a1 + 2) != 0x00)
				{
					struct Eq_81697 * a5_85 = (word32) s7_70->b4201AA48;
					struct Eq_81702 * s2_103;
					struct Eq_81703 * s4_105;
					struct Eq_81704 * s8_106;
					word32 a0_1378;
					word32 s1_1377;
					word32 a1_1379;
					word32 a2_1380;
					word32 s3_1383;
					word32 a5_1382;
					word32 a4_1381;
					Eq_2 s0_101 = mm_timer_set((char *) s7_70 + 0x4201AA00, (word32) *(union Eq_2 *) 0x44B00120 + a5_85->dw420190D4, 432, mstatus, out s1_1377, out a0_1378, out a1_1379, out a2_1380, out a4_1381, out a5_1382, out s2_103, out s3_1383, out s4_105, out s8_106);
					word32 a5_109 = (word32) *s0_101;
					int32 a4_110 = a5_85->dw420190D4;
					s2_103->w005C = 0x00;
					a5_85->w420190E8 = (word16) a5_109;
					word32 a5_113 = (word32) s4_105->w0020;
					s2_103->b005E = 0x00;
					a5_85->w420190E6 = (word16) (a5_113 + 0x14 + a4_110 >> 1000000);
					int32 a5_122 = s8_106->dw0120;
					s2_103->b0074 = 0x00;
					s2_103->dw0070 = 0x00;
					s2_103->dw0064 = a5_122;
					s2_103->dw0004 |= 1;
					s2_103->dw006C = s8_106->dw0120;
					ra = chan_bcn_detect_start(ra, s0_101, mstatus, out s0_144, out a3, out s3_136);
				}
				else
				{
					word32 a5_1376;
					word32 a2_1375;
					mm_timer_clear((char *) s7_70 + 0x4201AA00, a4_77, out a2_1375, out a5_1376);
				}
			}
			a4_154 = (word32) *((word32) s0_144 + 2);
			s7_70->b4201AA40 = (byte) a4_154;
			if (a4_154 != 0x00)
			{
				*(union Eq_2 *) 0x44B00200 = a3;
				*(union Eq_2 *) 0x44B00204 = a3;
				struct Eq_81807 * a5_164 = *((word32) a3 + 20);
				*(union Eq_2 *) 0x44B00208 = a3;
				*(union Eq_2 *) 0x44B0020C = a5_164->t0014;
				a4_154 = mm_env_max_ampdu_duration_set();
			}
			a1_177 = s3_136;
			a0_178.u0 = 0x1F;
			goto l2301BAA6;
		}
		if (s2_38 <= 0x1E)
		{
			if (s2_38 == 0x1A)
			{
				struct Eq_81209 * s5_273 = (word32) *((word32) a1 + 6);
				struct Eq_81059 * s0_278 = *a3;
				*((word32) a3 + 8) = ((char *) s5_273 + 374 + (word32) (*((word32) a1 + 5)) << 2) + 0x4201A410;
				a4_154 = (char *) s5_273 + 1107405288;
				Eq_2 a5_288 = (word32) s5_273->b4201AA40;
				if (a5_288 != 0x00)
				{
					word32 a4_289 = (word32) s0_278->b0005;
					s0_278 = (struct Eq_81059 *) *a5_288;
					if (a4_289 != 0x01)
					{
						if (a4_289 != 0x00)
						{
							if (a4_289 != 0x02)
								*(union Eq_2 *) 0x44B0020C = a5_288;
							else
								*(union Eq_2 *) 0x44B00208 = a5_288;
						}
						else
							*(union Eq_2 *) 0x44B00200 = a5_288;
					}
					else
						*(union Eq_2 *) 0x44B00204 = a5_288;
					a4_154 = mm_env_max_ampdu_duration_set();
				}
				if ((word32) s5_273->b4201AA3E == 0x00)
					a4_154 = ps_uapsd_set((char *) s5_273 + 1107405288, (word32) s0_278->b0005, (word32) s0_278->b0004, a4_154, mstatus, out s3_136);
				a1_177 = s3_136;
				a0_178.u0 = 0x1B;
				goto l2301BAA6;
			}
			if (s2_38 == 0x1C)
			{
				ui32 a5_345 = (word32) *a1;
				struct Eq_81248 * a5_348 = a5_345 << 0x0E & 0x003E0000;
				if (a5_348 != null)
					assert_err();
				(a5_348 & ~0x1C000000 | a5_345 << 0x0E)->dw004C = a5_348->dw004C;
				a4_154.u0 = ~0x1C000000;
				a1_177 = a3;
				a0_178.u0 = 0x1D;
				goto l2301BAA6;
			}
			if (s2_38 == 0x18)
			{
				word32 a7_1326;
				word32 a5_1324;
				word32 a6_1325;
				word32 a4_1323;
				word32 a3_1322;
				word32 a2_1321;
				word32 a1_1320;
				memcpy((word32) *((word32) a1 + 6) + 0x4201AA20, a1, 0x06, out a1_1320, out a2_1321, out a3_1322, out a4_1323, out a5_1324, out a6_1325, out a7_1326);
				a4_154.u0 = 0x01;
				if (g_b4201AFD0 + g_b4201AFD1 == 0x01)
				{
					((word32) *((word32) a1 + 3) << 24 | (((word32) (*((word32) a1 + 1)) << 8 | (word32) (*a1)) | (word32) (*((word32) a1 + 2)) << 16))->dw0020 = 0x44B00000;
					((word32) *((word32) a1 + 5) << 8 | (word32) (*((word32) a1 + 4)))->dw0024 = 0x44B00000;
					a4_154.u0 = 0x44B00000;
				}
				a1_177 = a3;
				a0_178.u0 = 0x19;
				goto l2301BAA6;
			}
		}
		else
		{
			if (s2_38 == 40)
			{
				struct Eq_81543 * a5_180 = (word32) *a1;
				if (a5_180 != null)
				{
					a4_154 = a5_180->t0054;
					(a5_180 | 0x0080)->t0054 = a4_154;
				}
				word32 s8_1365;
				struct Eq_81579 * s0_205;
				word32 s2_207;
				word32 a5_1361;
				word32 a4_1360;
				word32 s4_1364;
				word32 s3_1363;
				word32 a3_1359;
				word32 a6_1362;
				word32 a1_1357;
				word32 s1_1356;
				word32 a2_1358;
				ke_msg_alloc(ra, 41, a3, 0x03, a4_154, mstatus, dwLoc18, out s0_205, out s1_1356, out a0_197, out a1_1357, out a2_1358, out a3_1359, out a4_1360, out a5_1361, out a6_1362, out s2_207, out s3_1363, out s4_1364, out s8_1365);
				a0_197->u1 = (byte) (word32) s0_205->b0001;
				word32 a4_217 = (word32) s0_205->b0002;
				*((word32) a0_197 + 2) = (byte) s2_207;
				*((word32) a0_197 + 1) = (byte) a4_217;
l2301B9BC:
				word32 a3_1369;
				word32 a1_1367;
				word32 a0_1366;
				word32 a2_1368;
				word32 s2_1372;
				word32 s3_1373;
				word32 a4_1370;
				word32 s8_1374;
				word32 a5_1371;
				ke_msg_send(a0_197, mstatus, out s1_594, out a0_1366, out a1_1367, out a2_1368, out a3_1369, out a4_1370, out a5_1371, out s2_1372, out s3_1373, out s4_597, out s8_1374);
l2301BAAA:
				ui32 s2_720 = (word32) s4_597->b0013;
				if ((s2_720 << 4 & -0x00F1) != 0x00)
					assert_err();
				*(ui32 *) 0x44B00038 = s2_720 << 4;
				word32 s4_1349;
				word32 s3_1348;
				word32 s2_1347;
				word32 a5_1346;
				word32 a4_1345;
				word32 a1_1344;
				word32 a0_1343;
				word32 s1_1342;
				ke_state_set(s1_594, (word32) s4_597->b0012, mstatus, out s1_1342, out a0_1343, out a1_1344, out a4_1345, out a5_1346, out s2_1347, out s3_1348, out s4_1349);
l2301BAE2:
				0x00 = dwArg0128;
				return;
			}
			if (s2_38 == 59)
			{
				Eq_2 s3_243;
				ra = chan_ctxt_update(ra, a1, a1, a1, s5, s6, s7, s10, s11, fflags, frm, mstatus, s0, dwLoc18, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg34, dwArg38, dwArg48, s7, s5, s3, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0118, out a4_154, out s3_243);
				a1_177 = s3_243;
				a0_178.u0 = 60;
				goto l2301BAA6;
			}
			if (s2_38 == 32)
			{
				ui32 a3_263 = (word32) *a1;
				*(union Eq_78648 *) 0x44B000E8 = a3_263 + (*((union Eq_78600 *) 0x44B000E4) & 0x00FF) << 8 | a3_263;
				a4_154.u0 = 0x44B00000;
				a1_177 = a3;
				a0_178.u0 = 33;
				goto l2301BAA6;
			}
		}
	}
l2301B960:
	assert_err();
}

// 2301BE2E: void bl60x_edca_get(Register int32 a0, Register (ptr32 byte) a1, Register (ptr32 byte) a2, Register (ptr32 byte) a3, Register (ptr32 word16) a4)
// Called from:
//      wifi_edca_dump_cmd
void bl60x_edca_get(int32 a0, byte * a1, byte * a2, byte * a3, word16 * a4)
{
	Eq_2 a5_10;
	if (a0 != 0x01)
	{
		if (a0 <= 0x01)
		{
			if (a0 != 0x00)
				return;
			Eq_2 a5_35 = *(union Eq_2 *) 0x44B00200;
			*a4 = (word16) (a5_35 >> 0x0C);
			*a3 = (byte) (a5_35 >> 0x08 & 0x0F);
			*a2 = (byte) (a5_35 >> 0x04 & 0x0F);
			*a1 = (byte) (a5_35 & 0x0F);
			return;
		}
		if (a0 != 0x02)
		{
			if (a0 != 0x03)
				return;
			a5_10 = *(union Eq_2 *) 0x44B0020C;
		}
		else
			a5_10 = *(union Eq_2 *) 0x44B00208;
	}
	else
		a5_10 = *(union Eq_2 *) 0x44B00204;
	*a4 = (word16) (a5_10 >> 0x0C);
	*a3 = (byte) (a5_10 >> 0x08 & 0x0F);
	*a2 = (byte) (a5_10 >> 0x04 & 0x0F);
	*a1 = (byte) (a5_10 & 0x0F);
}

