pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301BEB8: Register Eq_2 bl_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack word32 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      wifi_main
Eq_2 bl_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArg9C, word32 dwArgE8, Eq_2 dwArgF8, word32 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	g_dw4200ED60 = 0x4201D274;
	g_dw4201D270 = 0x00;
	ui32 s0_33;
	Eq_2 a4_47;
	struct Eq_81923 * s0_52;
	word32 a3_172;
	Eq_2 ra_51 = mm_init(me_init(dbg_init(ra), mstatus, out s0_33), s0_33, mstatus, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg8C, dwArg9C, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_52, out a3_172, out a4_47);
	ke_init(a4_47, mstatus);
	word32 t1_173;
	word32 a0_174;
	word32 a1_175;
	word32 a2_176;
	word32 a3_177;
	word32 a4_178;
	word32 a5_179;
	Eq_2 ra_81 = memset(ra_51, &s0_52->bFFFFF8D8, 0x00, 0x00EC, out t1_173, out a0_174, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179);
	s0_52->wFFFFF8DC = ~0x00;
	s0_52->bFFFFF8D8 = 0x00;
	s0_52->bFFFFF8DB = ~0x00;
	Eq_2 ra_96 = supplicantFuncInit(ra_81, dwArg08, dwArg18, dwArg28, dwArg0138, dwArg0148, dwArg0158, dwArg0168);
	ptr32 a0_114;
	ptr32 a2_116;
	ptr32 s2_120;
	ptr32 s3_121;
	ptr32 a3_129;
	ptr32 s0_132;
	Eq_2 ra_131 = allocSupplicantData(ra_96, dwArg38, dwArg0128, dwArg0138, dwArg0148, dwArg0168, dwArg0178, out s0_132, out a0_114, out a2_116, out a3_129, out s2_120, out s3_121);
	s0Out = s0_132;
	a0Out = a0_114;
	a2Out = a2_116;
	a3Out = a3_129;
	s2Out = s2_120;
	s3Out = s3_121;
	return ra_131;
}

// 2301BF1C: void bl_reset_evt(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void bl_reset_evt(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	__csrrc(mstatus, 0x08);
	ke_evt_clear(0x80000000, a4, mstatus);
	Eq_2 a4_20;
	Eq_2 s5_55;
	Eq_2 ra_49 = txl_reset(rxl_reset(ra, hal_machw_reset(a4, dwArg18), mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108, out a4_20), a4_20, mstatus, dwArg0118, out s5_55);
	mm_reset(mstatus, dwArg18);
	vif_mgmt_reset(ra_49, s5_55, mstatus, dwArg48, dwArg58, dwArg8C, dwArgF8);
	__csrrs(mstatus, 0x08);
}

// 2301BF4A: Register word32 bl_sleep(Stack Eq_2 dwArg28, Register out ptr32 a3Out)
// Called from:
//      wifi_main
word32 bl_sleep(Eq_2 dwArg28, ptr32 & a3Out)
{
	if (g_ptr4201BC58 != null)
	{
		a3Out = a3;
		return 0x00;
	}
	word32 a0_38;
	word32 a0_12;
	word32 a4_142;
	word32 s2_143;
	word32 a2_141;
	ke_state_get(0x04, dwArg28, out a0_12, out a2_141, out a4_142, out s2_143);
	if (a0_12 == 0x00 && ((word32) g_b42018EB0 != 0x00 && g_dw42018EB4 == 0x00))
	{
		Eq_2 s0_24 = g_t4201AFC8;
		while (s0_24 != 0x00)
		{
			struct Eq_82076 * a5_28;
			word32 a4_144;
			if (chan_is_on_channel(s0_24, out a3, out a4_144, out a5_28) != 0x00)
			{
				s0_24 = a5_28->t0004;
				if (a5_28 != null)
					goto l2301BF58;
			}
			s0_24 = *s0_24;
		}
		if (g_dw4201A3F8 == 0x00)
		{
			a0_38 = hal_machw_sleep_check(out a3);
l2301BF5A:
			a3Out = a3;
			return a0_38;
		}
	}
l2301BF58:
	a0_38 = 0x00;
	goto l2301BF5A;
}

// 2301BFAC: void bl_nap_calculate()
// Called from:
//      cmd_wifi_coex_pta_force_on
void bl_nap_calculate()
{
	Eq_2 a6_5 = *(union Eq_2 *) 0x44B0808C;
	ui32 a4_13;
	Eq_82108 a0_29 = ~0x00;
	for (a4_13 = 0x00; a4_13 != 0x09; ++a4_13)
	{
		if ((0x01 << a4_13 & a6_5) != 0x00)
		{
			Eq_82108 a5_25;
			Eq_2 a5_21 = ((Eq_2[]) 0x44B00128)[a4_13];
			Eq_2 a3_23 = *(union Eq_2 *) 0x44B00120;
			if (a3_23 < a5_21)
				a5_25 = a5_21 - a3_23;
			else
				a5_25 = (word32) a3_23 - 1 - a5_21;
			if (a5_25 < a0_29)
				a0_29 = a5_25;
		}
	}
}

// 2301BFF6: void rx_swdesc_init()
// Called from:
//      rxl_init
void rx_swdesc_init()
{
	g_dw42043004 = 0x4201D280;
	g_dw42043088 = 0x4201D280;
	g_dw4204310C = 0x4201D280;
	g_dw42043190 = 0x4201D280;
	g_dw4201D304 = 1107571088;
	g_dw4201D324 = 1107571188;
	g_dw4201D344 = 0x42043258;
	g_dw4201D364 = 0x420432BC;
	g_dw4201D384 = 0x42043320;
	g_dw4201D3A4 = 0x42043384;
	g_dw4201D3C4 = 0x420433E8;
	g_dw4201D3E4 = 0x4204344C;
	g_dw4201D404 = 0x420434B0;
}

// 2301C094: void scan_cancel_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void scan_cancel_req_handler(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18)
{
	word32 a0_9;
	Eq_2 a4_11;
	word32 a2_77;
	word32 s2_78;
	ke_state_get(0x02, dwArg18, out a0_9, out a2_77, out a4_11, out s2_78);
	if (a0_9 != 0x00)
		g_b42019F13 = 0x01;
	else
		scan_send_cancel_cfm(ra, a3, a4_11, mstatus, dwLoc18);
}

// 2301C0C0: void scan_start_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack word32 dwArgE8)
void scan_start_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, word32 dwArg38, word32 dwArgE8)
{
	Eq_2 a0_22;
	word32 a2_126;
	word32 s0_123;
	word32 s1_124;
	word32 a1_125;
	word32 a3_127;
	word32 a4_128;
	word32 a5_129;
	word32 a6_130;
	word32 s2_131;
	word32 s3_132;
	word32 s4_133;
	word32 s8_134;
	ke_msg_alloc(ra, 0x00FFF801, a3, 0x01, a4, mstatus, dwArg08, out s0_123, out s1_124, out a0_22, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out a6_130, out s2_131, out s3_132, out s4_133, out s8_134);
	Eq_2 s0_40 = a0_22;
	word32 a0_42;
	word32 s2_47;
	word32 a2_135;
	word32 a4_136;
	Eq_2 s1_46 = ke_state_get(0x02, dwArg28, out a0_42, out a2_135, out a4_136, out s2_47);
	if (a0_42 == 0x00)
	{
		if ((word32) *((word32) s1_46 + 335) == 0x00)
			assert_err();
		a0_22->u1 = 0x00;
		*((word32) s1_46 + 16) = 0x42018EF8;
		g_b42018F12 = 0x00;
		g_w42018F10 = (word16) s2_47;
		s0_40 = scan_ie_download(&g_t42018EF8, mstatus, dwArgE8);
	}
	else
		a0_22->u1 = 0x08;
	word32 s1_137;
	word32 a0_138;
	word32 a1_139;
	word32 a2_140;
	word32 a3_141;
	word32 a4_142;
	word32 a5_143;
	word32 s2_144;
	word32 s3_145;
	word32 s4_146;
	word32 s8_147;
	ke_msg_send(s0_40, mstatus, out s1_137, out a0_138, out a1_139, out a2_140, out a3_141, out a4_142, out a5_143, out s2_144, out s3_145, out s4_146, out s8_147);
	0x00 = dwArg38;
}

// 2301C140: void mm_scan_channel_end_ind_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack word32 dwArg0108)
void mm_scan_channel_end_ind_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg28, word32 dwArg0108)
{
	struct Eq_82309 * a0_9;
	word32 a2_178;
	word32 a4_179;
	word32 s2_180;
	ke_state_get(0x02, dwArg28, out a0_9, out a2_178, out a4_179, out s2_180);
	if (a0_9 == (struct Eq_82309 *) 0x03)
	{
		Eq_2 a4_23 = *(union Eq_2 *) 0x07;
		*(union Eq_2 *) 0x07 = a4_23;
		(*a4_23 | 0x03)->dw0060 = 0x44B00000;
		struct Eq_82336 * a4_35 = a0_9->ptr0010;
		uint32 a3_38 = (word32) a0_9->b014F;
		uint32 a5_39 = (word32) g_b42018F12 + 0x01 & 0x00FF;
		a4_35->b001A = (byte) a5_39;
		if (a5_39 < a3_38)
		{
			struct Eq_18301 * a5_41 = (word32) a4_35->b001B;
			if (a5_41 == null)
			{
				word32 a0_186;
				word32 a4_187;
				scan_set_channel_request(a5_41, mstatus, dwArg0108, out a0_186, out a4_187);
				return;
			}
		}
		Eq_2 a4_48;
		word32 s1_181;
		word32 a3_182;
		word32 a5_183;
		word32 s2_184;
		word32 s4_185;
		Eq_2 s0_51 = ke_msg_free((char *) a0_9 - 0x0C, mstatus, out s1_181, out a3_182, out a4_48, out a5_183, out s2_184, out s4_185);
		Eq_2 a1_60 = (word32) *((word32) s0_51 + 24);
		if ((word32) *((word32) s0_51 + 27) != 0x00)
			scan_send_cancel_cfm(ra, a1_60, a4_48, mstatus, dwLoc08)->b001B = 0x00;
		else
		{
			word32 s0_188;
			word32 s1_189;
			word32 a0_190;
			word32 a3_191;
			word32 s2_192;
			word32 s3_193;
			word32 s4_194;
			word32 s8_195;
			ke_msg_send_basic(ra, 0x00FFF802, a1_60, a4_48, mstatus, dwLoc08, out s0_188, out s1_189, out a0_190, out a3_191, out s2_192, out s3_193, out s4_194, out s8_195);
		}
		word32 s1_196;
		word32 a0_197;
		word32 a1_198;
		word32 a4_199;
		word32 a5_200;
		word32 s2_201;
		word32 s3_202;
		word32 s4_203;
		ke_state_set(0x02, 0x00, mstatus, out s1_196, out a0_197, out a1_198, out a4_199, out a5_200, out s2_201, out s3_202, out s4_203);
	}
	else
		assert_err();
}

// 2301C1F2: void mm_scan_channel_start_ind_handler(Register Eq_2 ra, Register ptr32 s0, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0118)
void mm_scan_channel_start_ind_handler(Eq_2 ra, ptr32 s0, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0118)
{
	word32 a0_14;
	word32 a2_139;
	word32 a4_140;
	word32 s2_141;
	Eq_2 s1_18 = ke_state_get(0x02, dwArg28, out a0_14, out a2_139, out a4_140, out s2_141);
	if (a0_14 == 0x02)
	{
		Eq_2 a4_28 = *(union Eq_2 *) 0x06;
		*(union Eq_2 *) 0x02000206 = a4_28;
		(*a4_28 | 0x02000202)->dw0060 = 0x44B00000;
		if (((word32) (s0 + ((word32) s1_18 + 6))->b0003 & 0x01) == 0x00)
			scan_probe_req_tx(ra, (word32) s1_18 + 6, s5, fflags, frm, mstatus, dwLoc08, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0118);
		word32 s1_142;
		word32 a0_143;
		word32 a1_144;
		word32 a4_145;
		word32 a5_146;
		word32 s2_147;
		word32 s3_148;
		word32 s4_149;
		ke_state_set(0x02, 0x03, mstatus, out s1_142, out a0_143, out a1_144, out a4_145, out a5_146, out s2_147, out s3_148, out s4_149);
	}
	else
		assert_err();
}

// 2301C272: void txl_buffer_reinit()
// Called from:
//      txl_reset
//      txl_buffer_init
void txl_buffer_reinit()
{
	g_t4201D4D8.u0 = 0x00;
	g_t4201D4DC.u0 = 0x00;
}

// 2301C284: void txl_buffer_init(Register (ptr32 Eq_8573) a0, Stack word32 dwArg0128)
// Called from:
//      txl_cntrl_init
void txl_buffer_init(struct Eq_8573 * a0, word32 dwArg0128)
{
	txl_buffer_reinit();
	struct Eq_82534 * s0_13 = g_a4204643C;
	do
	{
		s0_13->dw0000 = 3135023902;
		ui32 a0_39 = phy_get_ntx(a0);
		((Eq_363080[]) 4)[a0_39].ptr0000.dw0000 = s0_13;
		struct Eq_82547 * a0_47 = 0x01 << phy_get_ntx(a0_39 << 0x0E) + 0x01;
		a0_47->ptr0007 = s0_13;
		s0_13->dw000C = 0x00;
		s0_13->dw0010 = 0xF0000704;
		s0_13->dw0014 = 0x00;
		s0_13->dw0018 = 0x00;
		s0_13->dw001C = 0x00;
		s0_13->dw0020 = 0x00;
		++s0_13;
		s0_13->dw0FE8 = *(int32 *) 0x44B000A0 & 0x00FF;
		s0_13->dw0FEC = *(int32 *) 0x44B000A0 & 0x00FF;
		s0_13[0x0044] = (struct Eq_82534) (*(int32 *) 0x44B000A0 & 0x00FF);
		int32 a5_68 = *(int32 *) 0x44B000A0;
		s0_13->dw0FF8 = 0x02000200;
		s0_13->dw0FFC = 0x003F0000;
		s0_13->dw0FF4 = a5_68 & 0x00FF;
		a0 = (struct Eq_8573 *) ((char *) a0_47 - 1);
	} while (s0_13 != g_a42046694);
	struct Eq_82626 * s0_110 = g_a420463C4;
	do
	{
		s0_110->dw0000 = 3135023902;
		ui32 a0_90 = phy_get_ntx(a0);
		((Eq_363094[]) 4)[a0_90].ptr0000.dw0000 = s0_110;
		struct Eq_82639 * a0_98 = 0x01 << phy_get_ntx(a0_90 << 0x0E) + 0x01;
		a0_98->ptr0007 = s0_110;
		s0_110->dw000C = 0x00;
		*(struct Eq_82626 **) 0xF0000714 = s0_110;
		s0_110->dw0014 = 0x00;
		s0_110->dw0018 = 0x00;
		s0_110->dw001C = 0x00;
		s0_110->dw0020 = 0x00;
		int32 a5_109 = *(int32 *) 0x44B000A0;
		++s0_110;
		s0_110->dw0FEC = 0x00;
		s0_110->dw0FE8 = a5_109 & 0x00FF;
		s0_110[0x0044] = (struct Eq_82626) 0x00;
		s0_110->dw0FF4 = 0x00;
		s0_110->dw0FF8 = 0x00;
		s0_110->dw0FFC = 0x003F0000;
		a0 = (struct Eq_8573 *) ((char *) a0_98 - 1);
	} while (s0_110 != g_a4204643C);
	0x00 = dwArg0128;
}

// 2301C3CA: void txl_buffer_reset()
// Called from:
//      txl_cntrl_flush_ac
void txl_buffer_reset()
{
	g_t4201D4D8.u0 = 0x00;
	g_t4201D4DC.u0 = 0x00;
}

