pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301C3DC: Register (ptr32 Eq_20436) txl_buffer_alloc(Register (ptr32 Eq_20436) a0, Register Eq_2 a1, Register word32 a2, Register out ptr32 a2Out, Register out (ptr32 Eq_21630) a3Out, Register out ptr32 a5Out)
// Called from:
//      txl_cntrl_push
struct Eq_20436 * txl_buffer_alloc(struct Eq_20436 * a0, Eq_2 a1, word32 a2, ptr32 & a2Out, struct Eq_21630 & a3Out, ptr32 & a5Out)
{
	int32 a4_11 = (word32) a0->b005E;
	a0->b01B8 = (byte) a2;
	a0->dw00D4 = (a4_11 + 0x0F & ~0x0F) - a4_11;
	a0->dw0104 = ~0x35010521;
	ui32 a5_22 = (word32) a0->w0032;
	a0->dw00D0 = a4_11;
	if ((a5_22 & 0x08) == 0x00)
		a1 = txu_cntrl_frame_build(a0, &a0->b01B8 + 96 + a4_11 / 441, out a2);
	Eq_2 s0_41 = *((word32) a1 + 84);
	int32 a5_42;
	for (a5_42 = 0x00; a5_42 != 60; a5_42 += 0x04)
	{
		struct Eq_21630 * a3_49 = (word32) s0_41 + a5_42;
		a3_49->dw01BC = a2;
	}
	if (g_t4201D4D8 == 0x00)
		g_t4201D4D8 = &a0->b0060 + 0x006C;
	else
		a0->t00DC = g_t4201D4DC;
	g_t4201D4DC = &a0->b0060 + 0x006C;
	*((word32) s0_41 + 220) = 0x00;
	a2Out = dwArg10;
	a3Out = a3_49;
	a5Out = 1107416100;
	return &a0->b0060 + 0x006C;
}

// 2301C46E: Register (ptr32 Eq_21622) txl_buffer_update_thd(Register Eq_2 ra, Register (ptr32 Eq_21620) a2, Register Eq_2 a3, Register (ptr32 Eq_21622) a5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      txl_cntrl_push
struct Eq_21622 * txl_buffer_update_thd(Eq_2 ra, struct Eq_21620 * a2, Eq_2 a3, struct Eq_21622 * a5, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_82792 * a7_7 = a5->ptr0068->ptr006C;
	struct Eq_21620 * a4_17 = (char *) a5 + 76;
	word32 a1_10 = 0x00;
	while (a3 != 0x00)
	{
		a4_17->dw0000 = ~0x35010521;
		Eq_47572 a0_19 = *a3;
		++a4_17;
		a4_17->dw0FF4 = (word32) a3;
		int32 t3_23 = *((word32) a0_19 + 16);
		a4_17->dw0FFC = 0x00;
		ptr32 a3_27 = (word32) a3 + t3_23;
		a4_17->dw0FF8 = a3_27 + ~0x00;
		a4_17->dw0004 = a4_17;
		a2 = a4_17;
		++a1_10;
		a3 = a3_27 + ~0x00;
	}
	if (a1_10 != 0x00)
	{
		Eq_2 a5_32 = a4_17->dw0004;
		*(union Eq_2 *) 3405708054 = a5_32;
		*((word32) a5_32 + 396) = a5_32;
		Mem40[a4_17 + ~0x00 + (a5_32 + 332) + 0x0044:word32] = a5_32;
		*((word32) a5_32 + 60) = (char *) a5 + 76;
		((word32) a5_32 + 72)->u0 = 0x00;
		Mem46[a7_7 + 16:word32] = a5_32 + 56;
		a2->dw0010 = 0x00;
		a7_7->dw003C = 0x0100;
		a2->dw0004 = 0x00;
		return (struct Eq_21622 *) 0x0100;
	}
	else
	{
		word32 a1_102;
		word32 a2_103;
		word32 a0_101;
		word32 s1_100;
		word32 a3_104;
		word32 a4_105;
		word32 a5_106;
		word32 a7_107;
		word32 s2_108;
		word32 s3_109;
		word32 s4_110;
		word32 s5_111;
		word32 s6_112;
		word32 s7_113;
		word32 s8_114;
		word32 s9_115;
		word32 s10_116;
		word32 s11_117;
		word32 t4_118;
		printf(ra, &g_t230783B8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_100, out a0_101, out a1_102, out a2_103, out a3_104, out a4_105, out a5_106, out a7_107, out s2_108, out s3_109, out s4_110, out s5_111, out s6_112, out s7_113, out s8_114, out s9_115, out s10_116, out s11_117, out t4_118);
		while (true)
			;
	}
}

// 2301C508: Register Eq_2 txl_cfm_init(Register Eq_2 ra)
// Called from:
//      txl_cntrl_init
//      txl_reset
Eq_2 txl_cfm_init(Eq_2 ra)
{
	word32 t1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	Eq_2 ra_18 = memset(ra, 0x4201D500, 0x00, 40, out t1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42);
	co_list_init(&g_t4201D500);
	co_list_init(&g_t4201D508);
	co_list_init(&g_t4201D510);
	co_list_init(&g_t4201D518);
	co_list_init(&g_t4201D520);
	return ra_18;
}

// 2301C55E: Register Eq_2 txl_cfm_push(Register (ptr32 Eq_20444) a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a4Out)
// Called from:
//      txl_transmit_trigger
//      txu_cntrl_push
Eq_2 txl_cfm_push(struct Eq_20444 * a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, union Eq_2 & a4Out)
{
	Eq_2 a0_7 = *((word32) a5 + 0x006C);
	a1->t0010 = *a5;
	Eq_2 a0_17 = (a2 << 0x03) + 0x4201D500;
	Eq_2 s1_19 = co_list_push_back(a0_7, 0x4201D500);
	word32 a5_35;
	a4Out = ke_evt_set(a0_17, a2 << 0x03, mstatus, out a5_35);
	return s1_19;
}

// 2301C59A: void txl_cfm_evt(Register Eq_2 s0, Register ui32 a0, Register ptr32 mstatus, Stack uint32 dwArg04, Stack Eq_2 dwArg18, Stack word32 dwArg0108)
void txl_cfm_evt(Eq_2 s0, ui32 a0, ptr32 mstatus, uint32 dwArg04, Eq_2 dwArg18, word32 dwArg0108)
{
	Eq_2 a4_5 = a0 << 0x02;
	int32 * s1_16 = (a0 << 0x03) + 0x4201D500;
	if ((g_ptr4201BC58 & s0) != 0x00)
	{
		Eq_2 a5_37 = ke_evt_clear(s0, a0 << 0x02, mstatus);
		while (*s1_16 != 0x00)
		{
			__csrrc(mstatus, 0x08);
			struct Eq_26558 * a5_54;
			co_list_pop_front(a4_5, a5_37, out a5_54);
			__csrrs(mstatus, 0x08);
			struct Eq_83022 * a5_81;
			Eq_20629 s2_83;
			word32 a1_131;
			word32 s3_132;
			word32 s4_133;
			word32 s5_134;
			word32 mstatus_135;
			txu_cntrl_cfm(me_tx_cfm_singleton(a5_54, dwLoc04, dwArg04, dwArg0108), dwArg18, out s1_16, out a1_131, out a4_5, out a5_81, out s2_83, out s3_132, out s4_133, out s5_134, out mstatus_135);
			a5_81->dw004F = a5_81->dw0050;
			a5_37 = ipc_emb_txcfm_ind(s2_83);
		}
	}
	else
		assert_err();
}

// 2301C63A: Register Eq_2 txl_cfm_flush(Register Eq_2 ra, Register Eq_2 a1, Register ui32 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_20629 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s8Out)
// Called from:
//      txl_cntrl_flush_ac
//      txl_reset
Eq_2 txl_cfm_flush(Eq_2 ra, Eq_2 a1, ui32 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_20629 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s8Out)
{
	Eq_2 s5_22 = a1;
	ui32 s4_24 = a2;
	ui32 s3_27 = a2 | 0x3C000000;
	while (true)
	{
		union Eq_2 * a5_34;
		if (co_list_pop_front(a4, a5, out a5_34) == 0x00)
			break;
		Eq_2 a5_65 = *a5_34;
		if (a4 != 0x00)
			*((word32) a5_65 + 16) = s3_27;
		else
		{
			a5_65 = *((word32) a4 + 16);
			if (a4 >= 0x00)
				*((word32) a5_65 + 16) = s4_24;
		}
		Eq_2 s0_73 = *((word32) a5_65 + 8);
		if (a5_65 == 0x00)
			a1 = txl_frame_cfm(s0_73, a4, a5_65, mstatus, out a4, out a5);
		else
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			word32 s1_161;
			struct Eq_83089 * a5_98;
			word32 s2_162;
			ra = txu_cntrl_cfm((char *) a5_98 - 1, stackArg56, out s1_161, out a1, out a4, out a5_98, out s2_162, out s3_27, out s4_24, out s5_22, out mstatus);
			a5_98->dw004F = a5_98->dw0050;
			a5 = (char *) a5_98 - 1;
			struct Eq_83111 * s0_108 = a5_98->ptr0067;
			if (a5_98 != (struct Eq_83089 *) ~0x00)
				s0_108->dw0068 = 0x00;
		}
	}
	Eq_20629 s2_45;
	ptr32 s3_46;
	ptr32 s1_44 = txl_frame_evt(ra, a1, a4, mstatus, out s2_45, out s3_46);
	Eq_2 a5_62 = ipc_emb_txcfm_ind(s2_45);
	s0Out = s1;
	s1Out = s1_44;
	a1Out.u0 = <invalid>;
	a4Out.u0 = <invalid>;
	a5Out = a5_62;
	s2Out = s2_45;
	s3Out = s3_46;
	s4Out = dwArg04;
	s5Out = s5_22;
	s6Out.u0 = <invalid>;
	s8Out = s4;
	return <invalid>;
}

// 2301C6C0: void txl_cfm_dma_int_handler(Register (ptr32 Eq_83145) a5)
void txl_cfm_dma_int_handler(struct Eq_83145 * a5)
{
	struct Eq_83146 * a4_5 = a5->ptr0024;
	(a5 & 0x0100)->ptr0020 = a4_5;
	(a4_5 & ~0x01)->dw0004 = a4_5->dw0004;
}

