pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301C6DC: void txl_cfm_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
void txl_cfm_dump(Eq_2 a5)
{
	Eq_2 s0_13 = 0x4201D500;
	do
	{
		if (co_list_cnt(a5, out a5) != null)
		{
			s0_13 = *a5;
			while (a5 != 0x00)
				a5 = *a5;
		}
		s0_13 = (word32) s0_13 + 8;
	} while (s0_13 != 1107416360);
}

// 2301C710: Register Eq_2 bam_init(Register ptr32 mstatus)
// Called from:
//      me_init
Eq_2 bam_init(ptr32 mstatus)
{
	g_b4201D534 = ~0x00;
	word32 s1_23;
	word32 a0_24;
	word32 a1_25;
	word32 a4_26;
	word32 a5_27;
	word32 s2_28;
	word32 s3_29;
	word32 s4_30;
	return ke_state_set(0x08, 0x00, mstatus, out s1_23, out a0_24, out a1_25, out a4_26, out a5_27, out s2_28, out s3_29, out s4_30);
}

// 2301C722: void bam_send_air_action_frame(Register Eq_2 ra, Register word32 a0, Register word32 a2, Register uint32 a5, Register word32 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_83216 dwArg64, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8)
// Called from:
//      rxu_mgt_ind_handler
void bam_send_air_action_frame(Eq_2 ra, word32 a0, word32 a2, uint32 a5, word32 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg58, Eq_83216 dwArg64, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8)
{
	Eq_2 a4_53;
	Eq_2 a5_54;
	phy_get_channel(fp + -72, out a4_53, out a5_54);
	struct Eq_83230 * s1_66;
	struct Eq_83231 * s4_67;
	word32 s8_68;
	struct Eq_83233 * a0_71;
	word32 s2_75;
	word32 s3_76;
	word32 s0_449;
	word32 a1_450;
	word32 a3_451;
	word32 a4_452;
	word32 a5_453;
	word32 s5_454;
	word32 s6_455;
	word32 s7_456;
	word32 s9_457;
	word32 s10_458;
	word32 s11_459;
	txl_frame_get(ra, (word32) ((word32) (byte) s10 != 0x00), (struct Eq_14556 *) 0x0100, a4_53, a5_54, fflags, frm, mstatus, dwArgA8, dwArgC8, dwArgE8, out s0_449, out s1_66, out a0_71, out a1_450, out a3_451, out a4_452, out a5_453, out s2_75, out s3_76, out s4_67, out s5_454, out s6_455, out s7_456, out s8_68, out s9_457, out s10_458, out s11_459);
	if (a0_71 == null)
		return;
	word32 a5_132;
	struct Eq_83275 * a4_97;
	struct Eq_13120 * a3_193 = tpc_update_frame_tx_power(ra, (char *) s4_67 + 1107405288, fflags, frm, out a4_97);
	struct Eq_83282 * a1_103 = a0_71->ptr0068;
	a1_103->b014C = 0xD0;
	a1_103->b014D = 0x00;
	a1_103->b014E = 0x00;
	a1_103->b014F = 0x00;
	struct Eq_83302 * s8_89 = s8_68 + (a0 + 0x01CE);
	a1_103->w0150 = (word16) (word32) s8_89->w0000;
	a1_103->w0152 = (word16) (word32) s8_89->w0002;
	a1_103->w0154 = (word16) (word32) s8_89->w0004;
	a1_103->w0156 = (word16) (word32) s4_67->w4201AA38;
	a1_103->w0158 = (word16) (word32) s4_67->w4201AA3A;
	a1_103->w015A = (word16) (word32) s4_67->w4201AA3C;
	if ((word32) a4_97->b0056 == 0x02)
	{
		a1_103->w015C = (word16) (word32) s4_67->w4201AA38;
		a1_103->w015E = (word16) (word32) s4_67->w4201AA3A;
		a5_132 = (word32) s4_67->w4201AA3C;
	}
	else
	{
		a1_103->w015C = (word16) (word32) s8_89->w0000;
		a1_103->w015E = (word16) (word32) s8_89->w0002;
		a5_132 = (word32) s8_89->w0004;
	}
	Eq_2 s0_181;
	struct Eq_83433 * a0_185;
	struct Eq_83408 * a5_173;
	word32 a0_170;
	a1_103->w0160 = (word16) a5_132;
	uint32 a6_145 = (word32) g_w4201A3FC + 0x01 << 16;
	g_w4201A3FC = (word16) (a6_145 >> 0x10);
	uint32 a6_150 = (word32) (word16) (a6_145 >> 0x10 << 4);
	a1_103->b0162 = (byte) a6_150;
	a1_103->b0163 = (byte) (a6_150 >> 0x08);
	a0_71->b002F = (byte) s4_67;
	a0_71->b0030 = (byte) s3_76;
	if (a2 != 0x01)
	{
		if (a2 == 0x00)
		{
			s0_181 = (word32) (dwArg64 >> 2 & 0x0F)->b23075D40;
			a0_185 = me_build_add_ba_req(&a1_103->b0163 + 1, s1_66, out a5_173) + 0x18;
			goto l2301C8AE;
		}
		a5_173 = (struct Eq_83408 *) 0x02;
		if (a2 != 0x02)
		{
			assert_warn();
			a0_185 = (struct Eq_83433 *) 0x18;
			goto l2301C8FE;
		}
		a0_170 = me_build_del_ba(&a1_103->b0163 + 1, s1_66, a5, out a3_193, out a5_173);
	}
	else
		a0_170 = me_build_add_ba_rsp(&a1_103->b0163 + 1, dwArg64, a3_193, a5, out a5_173);
	a0_185 = a0_170 + 0x18;
l2301C8FE:
	s0_181.u0 = 0x03;
l2301C8AE:
	word32 a4_215 = a5_173->dw0014;
	word32 a5_219 = a5_173 + ~0x00 + a0_185;
	a5_219->dw0018 = a4_215;
	a0_185->dw0020 = a4_215;
	if (s2_75 != 0x00)
	{
		a0_71->dw02CC = s2_75;
		a0_71->ptr02D0 = s1_66;
	}
	word32 s7_472;
	word32 s9_473;
	word32 s10_474;
	word32 s11_475;
	word32 a5_466;
	word32 s2_467;
	word32 s3_468;
	word32 s4_469;
	word32 s6_471;
	word32 s5_470;
	word32 s1_461;
	word32 a0_462;
	word32 a1_463;
	word32 a4_465;
	word32 a3_464;
	word32 s0_460;
	txl_frame_push(ra, s0_181, s0_181, a3_193, a5_219, mstatus, dwLoc28, dwArg28, dwArg58, dwArg8C, out s0_460, out s1_461, out a0_462, out a1_463, out a3_464, out a4_465, out a5_466, out s2_467, out s3_468, out s4_469, out s5_470, out s6_471, out s7_472, out s9_473, out s10_474, out s11_475);
}

// 2301C90E: void rxu_mgt_ind_handler(Register Eq_2 ra, Register (ptr32 Eq_83557) a1, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_83216 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8)
void rxu_mgt_ind_handler(Eq_2 ra, struct Eq_83557 * a1, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_83216 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8)
{
	if ((word32) a1->b001D != 0x00)
		return;
	int32 s0_26 = (word32) a1->b0020 << 8 | (word32) a1->b001F;
	word32 s1_301;
	up32 s3_65;
	word32 a1_303;
	word32 a0_302;
	word32 a3_305;
	word32 a2_304;
	word32 a4_306;
	word32 a5_307;
	word32 a7_308;
	word32 s2_309;
	word32 s4_310;
	word32 s5_311;
	word32 s6_312;
	word32 s7_313;
	word32 s8_314;
	word32 s9_315;
	word32 s10_316;
	word32 s11_317;
	word32 t4_318;
	Eq_2 ra_60 = printf(ra, &g_t23078440, s0_26 >> 0x02 & 0x0F, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_301, out a0_302, out a1_303, out a2_304, out a3_305, out a4_306, out a5_307, out a7_308, out s2_309, out s3_65, out s4_310, out s5_311, out s6_312, out s7_313, out s8_314, out s9_315, out s10_316, out s11_317, out t4_318);
	up32 a3_75 = s3_65;
	if (s3_65 > 0x08)
		a3_75 = 0x08;
	word32 s1_110;
	word32 s10_111;
	word32 a0_319;
	word32 a1_320;
	word32 a2_321;
	word32 a3_322;
	word32 a4_323;
	word32 a5_324;
	word32 a7_325;
	word32 s2_326;
	word32 s3_327;
	word32 s4_328;
	word32 s5_329;
	word32 s6_330;
	word32 s7_331;
	word32 s8_332;
	word32 s9_333;
	word32 s11_334;
	word32 t4_335;
	bam_send_air_action_frame(printf(ra_60, &g_t230784B8, (int32) (word16) ((word32) (word16) a3_75 << 6 | (s0_26 & 62 | 2)) >> 2 & 0x0F, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_110, out a0_319, out a1_320, out a2_321, out a3_322, out a4_323, out a5_324, out a7_325, out s2_326, out s3_327, out s4_328, out s5_329, out s6_330, out s7_331, out s8_332, out s9_333, out s10_111, out s11_334, out t4_335), s1_110, 0x01, 0x00, s10_111, fflags, frm, mstatus, dwArg08, dwArg38, dwArg44, ra, dwArg88, dwArgA8, dwArgC8);
}

// 2301C9E6: Register word32 co_pack8p(Register word32 a0, Register Eq_2 a1, Register (ptr32 word32) a2, Register out (ptr32 byte) a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      me_add_ie_ssid
//      me_add_ie_supp_rates
//      me_add_ie_ext_supp_rates
//      me_add_ie_ht_capa
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
word32 co_pack8p(word32 a0, Eq_2 a1, word32 * a2, byte & a4Out, word32 & a5Out)
{
	word32 * a5_12 = null;
	while (a2 != a5_12)
	{
		a3 = CONVERT(Mem8[a1 + a5_12:byte], byte, word32);
		a4 = (byte *) (a5_12 + a0);
		*a4 = (byte) a3;
		a5_12 = (word32 *) ((char *) a5_12 + 1);
	}
	a4Out = a4;
	a5Out = a5_12;
	return a3;
}

// 2301CA02: Register Eq_83729 phy_freq_to_channel(Register Eq_83729 a0, Register word32 a1, Register out (ptr32 byte) a3Out, Register out Eq_83732 a4Out, Register out Eq_83729 a5Out)
// Called from:
//      me_add_ie_ht_oper
//      me_build_associate_req
//      me_extract_country_reg
//      me_build_probe_rsp
Eq_83729 phy_freq_to_channel(Eq_83729 a0, word32 a1, byte & a3Out, union Eq_83732 & a4Out, union Eq_83729 & a5Out)
{
	Eq_83732 a4_11;
	Eq_83729 a5_20;
	word32 a5_13;
	if (a0 == 0x00)
	{
		uint32 a4_17 = a1 + 0xFF000694 << 16;
		a4_11 = a4_17 >> 16;
		a3 = (byte *) 72;
		a5_20.u0 = 0x00;
		if (a4_17 >> 16 > 72)
			goto l2301CA32;
		a4_11.u0 = 0x00FFF9B4;
		a5_20.u0 = 0x0E;
		if (a1 != 0x00FFF9B4)
		{
			a5_13 = 0xFF000699;
			goto l2301CA2A;
		}
	}
	else
	{
		a4_11.u0 = 0x01;
		a5_20.u0 = 0x00;
		if (a0 != 0x01)
			goto l2301CA32;
		uint32 a4_10 = a1 + ~0x0100038C << 16;
		a4_11 = a4_10 >> 16;
		a3 = (byte *) 0x0334;
		if (a4_10 >> 16 <= 0x0334)
		{
			a5_13 = ~0x01000387;
l2301CA2A:
			a5_20 = a1 + a5_13 ^ 0x05;
			goto l2301CA32;
		}
	}
l2301CA32:
	a3Out = a3;
	a4Out = a4_11;
	a5Out = a5_20;
	return a5_20;
}

// 2301CA58: Register ui32 phy_channel_to_freq(Register ui32 a0, Register Eq_2 a1)
// Called from:
//      me_extract_csa
ui32 phy_channel_to_freq(ui32 a0, Eq_2 a1)
{
	up32 a1_10;
	if (a0 != 0x00)
	{
		if (a1 > -0x00A5)
			return 0x0FFFFFFF;
		a1_10 = 0x01000388;
		return (word32) (word16) ((word32) a1 + 5 + a1_10);
	}
	else
	{
		if (a1 > ~0x0D)
			return 0x0FFFFFFF;
		if (a1 == 0x0E)
			return 0x00FFF9B4;
		a1_10 = 0x00FFF967;
		return (word32) (word16) ((word32) a1 + 5 + a1_10);
	}
}

// 2301CAA2: Register word32 me_add_ie_ssid(Register (ptr32 word32) a1, Register Eq_2 a2, Register (ptr32 Eq_83799) a4)
// Called from:
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
word32 me_add_ie_ssid(word32 * a1, Eq_2 a2, struct Eq_83799 * a4)
{
	a4->t0000.u0 = 0x00;
	Eq_83800 a0_16 = a4->t0000;
	a4->b0001 = (byte) a1;
	word32 * a5_14 = a1;
	if (a1 != null)
	{
		word32 a4_51;
		co_pack8p((word32) *a0_16 + 2, a2, a1, out a4_51, out a5_14);
	}
	Mem35[a5_14 + (a1 + 2):word32] = Mem18[a5_14 + 0x00:word32];
	return (char *) a1 + 2;
}

// 2301CADE: Register Eq_83834 me_add_ie_supp_rates(Register (ptr32 Eq_45035) a1, Register out Eq_83834 a0Out, Register out (ptr32 Eq_83833) a3Out)
// Called from:
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
Eq_83834 me_add_ie_supp_rates(struct Eq_45035 * a1, union Eq_83834 & a0Out, struct Eq_83833 & a3Out)
{
	word32 * a5_11 = (word32) a1->b0000;
	word32 * a2_15 = (word32 *) 0x08;
	if (a5_11 <= (word32 *) 0x08)
		a2_15 = a5_11;
	((union Eq_2 *) 0x08)->u1 = 0x01;
	Eq_83834 s1_24 = (char *) a2_15 + 2;
	word32 * a4_27 = a5_11;
	if (a5_11 > (word32 *) 0x08)
		a4_27 = (word32 *) 0x08;
	*(union Eq_2 *) 0x02 = (byte) a4_27;
	word32 a4_66;
	word32 * a5_41;
	struct Eq_83833 * a3_39 = co_pack8p(0x0A, a1 + 1, a2_15, out a4_66, out a5_41);
	Mem49[a5_41 + s1_24:word32] = Mem31[a5_41 + 0x00:word32];
	a0Out = s1_24;
	a3Out = a3_39;
	return s1_24;
}

