pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301CB2E: Register word32 me_add_ie_ext_supp_rates(Register (ptr32 Eq_45035) a1, Register (ptr32 Eq_83877) a5, Register out ptr32 a0Out, Register out (ptr32 Eq_83833) a3Out, Register out ptr32 a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
word32 me_add_ie_ext_supp_rates(struct Eq_45035 * a1, struct Eq_83877 * a5, ptr32 & a0Out, struct Eq_83833 & a3Out, ptr32 & a4Out, word32 & a5Out)
{
	word32 a2_14 = (word32) a1->b0000;
	a5->t0000.u0 = 0x32;
	Eq_83887 a0_16 = a5->t0000;
	a5->b0001 = (byte) (a2_14 + ~0x07);
	ptr32 a4_25;
	word32 * a5_26;
	struct Eq_83833 * a3_24 = co_pack8p((word32) *a0_16 + 2, a1 + 9, a2_14 + ~0x07, out a4_25, out a5_26);
	word32 * a5_30 = a5_26 + (a2_14 + -6);
	*a5_30 = *a5_26;
	a0Out = a2_14 + -6;
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_30;
	return a2_14 + -6;
}

// 2301CB6E: Register word32 me_add_ie_ds(Register ui32 a1, Register (ptr32 Eq_83930) a5, Register out ptr32 a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      me_build_beacon
//      me_build_probe_rsp
word32 me_add_ie_ds(ui32 a1, struct Eq_83930 * a5, ptr32 & a4Out, word32 & a5Out)
{
	a5->t0000.u0 = 0x03;
	a5->b0001 = 0x01;
	a5->b0002 = (byte) a1;
	a5->t0003 = a5->t0000;
	a4Out = 0x01;
	a5Out = (word32 *) &a5->t0003;
	return 0x03;
}

// 2301CB8E: Register word32 me_add_ie_erp(Register word32 a1, Register (ptr32 Eq_83956) a5, Register out ptr32 a4Out)
// Called from:
//      me_build_beacon
//      me_build_probe_rsp
word32 me_add_ie_erp(word32 a1, struct Eq_83956 * a5, ptr32 & a4Out)
{
	a5->t0000.u0 = 0x2A;
	a5->b0001 = 0x01;
	a5->b0002 = (byte) a1;
	a5->t0003 = a5->t0000;
	a4Out = 0x01;
	return 0x03;
}

// 2301CBB0: Register int32 me_add_ie_rsn(Register ptr32 a1, Register (ptr32 Eq_83980) a4, Register out ptr32 a2Out, Register out Eq_83982 a5Out)
// Called from:
//      me_build_beacon
//      me_build_probe_rsp
int32 me_add_ie_rsn(ptr32 a1, struct Eq_83980 * a4, ptr32 & a2Out, union Eq_83982 & a5Out)
{
	int32 a0_11;
	if (a1 == 0x01)
	{
		a4->t0000.u0 = 0x30;
		a4->b0001 = 0x14;
		a4->b0002 = (byte) a1;
		a4->b0003 = 0x00;
		a4->b0006 = 0xAC;
		a4->b0007 = 0x04;
		a4->b0004 = 0x00;
		a4->b0005 = 0x0F;
		a4->b0008 = (byte) a1;
		a4->b0009 = 0x00;
		a4->b000C = 0xAC;
		a4->b000D = 0x04;
		a4->b000A = 0x00;
		a4->b000B = 0x0F;
		a4->b000E = (byte) a1;
		a4->b000F = 0x00;
		a4->b0012 = 0xAC;
		a4->b0010 = 0x00;
		a4->b0011 = 0x0F;
		a4->b0013 = 0x02;
		a4->b0014 = 0x00;
		a4->b0015 = 0x00;
		a2 = 0x0F;
		a0_11 = 22;
	}
	else
	{
		a0_11 = 0x00;
		if (a1 == 0x02)
		{
			a4->t0000.u0 = 0x30;
			a4->b0001 = 0x18;
			a4->b0002 = 0x01;
			a4->b0003 = 0x00;
			a4->b0004 = 0x00;
			a4->b0005 = 0x0F;
			a4->b0006 = 0xAC;
			a4->b0007 = (byte) a1;
			a4->b0008 = (byte) a1;
			a4->b0009 = 0x00;
			a4->b000A = 0x00;
			a4->b000B = 0x0F;
			a4->b000C = 0xAC;
			a4->b000D = (byte) a1;
			a4->b0011 = 0x04;
			a4->b000E = 0x00;
			a4->b000F = 0x0F;
			a4->b0010 = 0xAC;
			a4->b0012 = 0x01;
			a4->b0013 = 0x00;
			a4->b0014 = 0x00;
			a4->b0015 = 0x0F;
			a4->b0016 = 0xAC;
			a4->b0017 = (byte) a1;
			a4->b0018 = 0x00;
			a4->b0019 = 0x00;
			a2 = 0x0F;
			a0_11 = 0x1A;
		}
	}
	Eq_83982 a5_92 = a4->t0000;
	a4[a0_11 / 26] = (struct Eq_83980) a5_92;
	a2Out = a2;
	a5Out = a5_92;
	return a0_11;
}

// 2301CCD0: Register word32 me_add_ie_wpa(Register ptr32 a1, Register (ptr32 Eq_84194) a2, Register out Eq_84195 a3Out, Register out (ptr32 word32) a4Out)
// Called from:
//      me_build_beacon
//      me_build_probe_rsp
word32 me_add_ie_wpa(ptr32 a1, struct Eq_84194 * a2, union Eq_84195 & a3Out, word32 & a4Out)
{
	word32 * a4_20 = (word32 *) 0x02;
	word32 a0_50 = 0x00;
	if (a1 == 0x02)
	{
		((union Eq_2 *) 0x02)->u1 = ~0x22;
		((union Eq_2 *) 0x03)->u1 = 0x1C;
		a2->b0005 = 0x01;
		a2->b0002 = 0x00;
		a2->b0003 = 0x50;
		a2->b0004 = 242;
		a2->b0006 = 0x01;
		a2->b0007 = 0x00;
		a2->b0008 = 0x00;
		a2->b0009 = 0x50;
		a2->b000A = 242;
		a2->b000B = (byte) a1;
		a2->b000C = (byte) a1;
		a2->b000D = 0x00;
		a2->b000E = 0x00;
		a2->b000F = 0x50;
		a2->b0010 = 242;
		a2->b0011 = (byte) a1;
		a2->b0012 = 0x00;
		a2->b0013 = 0x50;
		a2->b0014 = 242;
		a2->b0015 = 0x04;
		a2->b0016 = 0x01;
		a2->b0017 = 0x00;
		a2->b0018 = 0x00;
		a2->b0019 = 0x50;
		a2->b001A = 242;
		a2->b001B = (byte) a1;
		a3.u0 = 80;
		a4_20 = (word32 *) ~0x0D;
		a0_50 = 0x1E;
	}
	word32 * a4_59 = a4_20 + a0_50;
	*a4_59 = *a4_20;
	a3Out = a3;
	a4Out = a4_59;
	return a0_50;
}

// 2301CD78: Register word32 me_add_ie_tim(Register word32 a1, Register (ptr32 Eq_84327) a5, Register out ptr32 a4Out)
// Called from:
//      me_build_beacon
word32 me_add_ie_tim(word32 a1, struct Eq_84327 * a5, ptr32 & a4Out)
{
	a5->t0000.u0 = 0x05;
	a5->b0001 = 0x04;
	a5->b0003 = (byte) a1;
	a5->t0006 = a5->t0000;
	a4Out = 0x04;
	return 0x06;
}

// 2301CD98: Register word32 me_add_ie_ht_capa(Register (ptr32 Eq_45035) a4, Register out ptr32 a0Out, Register out (ptr32 word32) a5Out)
// Called from:
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
word32 me_add_ie_ht_capa(struct Eq_45035 * a4, ptr32 & a0Out, word32 & a5Out)
{
	ui32 a5_15 = (word32) g_a4201AFE0[0];
	a4->b0000 = 0x2D;
	a4[1] = (struct Eq_45035) 0x1A;
	uint32 a5_22 = a5_15 & ~0x0C | 0x0C;
	a4[2] = (struct Eq_45035) (byte) a5_22;
	a4[3] = (struct Eq_45035) (byte) (a5_22 >> 8);
	word32 * a0_28 = *(a5_22 >> 8);
	(a5_22 >> 8)->b0004 = (byte) (word32) g_b4201AFE2;
	word32 a0_32 = *a0_28;
	struct Eq_84397 * a4_36;
	word32 a5_69;
	co_pack8p(a0_32 + 0x05, 1107406819, (word32 *) 0x10, out a4_36, out a5_69);
	uint32 a5_38 = (word32) g_w4201AFF4;
	a4_36->b0015 = (byte) a5_38;
	a4_36->b0016 = (byte) (a5_38 >> 8);
	struct Eq_84421 * a5_50;
	word32 a4_70;
	co_pack8p(a0_32 + 0x1C, 1107406840, (word32 *) 0x04, out a4_70, out a5_50);
	a5_50->b001B = (byte) (word32) g_b4201AFFC;
	a5_50->dw001C = a5_50->dw0000;
	a0Out = 0x1C;
	a5Out = &a5_50->dw001C;
	return 1107406804;
}

// 2301CE2C: Register word32 me_add_ie_ht_oper(Register (ptr32 Eq_45035) s1, Register (ptr32 Eq_84449) a5, Register out ptr32 a2Out, Register out (ptr32 Eq_84451) a3Out)
// Called from:
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
word32 me_add_ie_ht_oper(struct Eq_45035 * s1, struct Eq_84449 * a5, ptr32 & a2Out, struct Eq_84451 & a3Out)
{
	a5->b0000 = 0x3D;
	a5->b0001 = 22;
	struct Eq_84460 * a5_23;
	struct Eq_84451 * a4_22;
	struct Eq_84451 * a3_24;
	a5_23->b0002 = (byte) phy_freq_to_channel((word32) s1[4], (word32) s1[6], out a3_24, out a4_22, out a5_23);
	struct Eq_84481 * a5_28 = (word32) s1[5];
	if (a5_28 != null)
	{
		a3_24 = (word32) s1[6];
		a4_22 = (word32) s1[8];
		a5_28 = (struct Eq_84481 *) 0x07;
		if (a4_22 >= a3_24)
			a5_28 = (struct Eq_84481 *) 0x05;
	}
	a4_22->b0003 = (byte) a5_28;
	a5_28->b0004 = 0x03;
	a5_28->b0005 = 0x00;
	a5_28->b0006 = 0x00;
	a5_28->b0007 = 0x00;
	a5_28->b0008 = ~0x00;
	a5_28->dw0018 = a5_28->dw0000;
	a2Out = dwArg10;
	a3Out = a3_24;
	return 0x18;
}

