pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301CEA8: Register (ptr32 Eq_39419) me_build_authenticate(Register (ptr32 Eq_39419) a0, Register uint32 a1, Register Eq_2 a2, Register uint32 a3, Register Eq_2 a4, Register out Eq_39424 a3Out, Register out Eq_39425 a5Out)
// Called from:
//      sm_auth_send
//      apm_send_mlme
struct Eq_39419 * me_build_authenticate(struct Eq_39419 * a0, uint32 a1, Eq_2 a2, uint32 a3, Eq_2 a4, union Eq_39424 & a3Out, union Eq_39425 & a5Out)
{
	a0->b0000 = (byte) a1;
	a0->b0002 = (byte) a2;
	a0->b0004 = (byte) a3;
	a0->b0001 = (byte) (a1 >> 8);
	a0->b0003 = (byte) (a2 >> 8);
	a0->b0005 = (byte) (a3 >> 8);
	if (a4 == 0x00)
	{
		a3Out = a3 >> 8;
		a5Out = a5;
		return (struct Eq_39419 *) 0x06;
	}
	else
	{
		a0->b0006 = 0x10;
		a0->b0007 = 0x80;
		Eq_39425 a5_24 = 0x00;
		do
		{
			Mem33[a0 + 0x08 + a5_24:byte] = SLICE(CONVERT(Mem28[a4 + a5_24:byte], byte, word32), byte, 0);
			a5_24 = (word32) a5_24.u0 + 1;
		} while (a5_24 != 0x0080);
		a3Out.u0 = 0x0080;
		a5Out = a5_24;
		return (struct Eq_39419 *) 0x0088;
	}
}

// 2301CEFE: Register (ptr32 Eq_38651) me_build_deauthenticate(Register (ptr32 Eq_38651) a0, Register (ptr32 Eq_32424) a1)
// Called from:
//      sm_disconnect
//      sm_handle_supplicant_result
//      apm_send_mlme
struct Eq_38651 * me_build_deauthenticate(struct Eq_38651 * a0, struct Eq_31105 * a1)
{
	a0->b0000 = (byte) a1;
	a0->b0001 = (byte) (a1 >> 8);
	return (struct Eq_38651 *) 0x02;
}

// 2301CF0C: Register Eq_2 me_build_associate_req(Register Eq_2 ra, Register (ptr32 Eq_39780) a1, Register (ptr32 Eq_26465) a3, Register (ptr32 Eq_39793) a4, Register (ptr32 word16) a5, Register Eq_2 a6, Register Eq_2 s6, Register int32 s8, Register (ptr32 byte) s10, Register (ptr32 byte) s11, Stack word32 dwArg04, Stack Eq_2 dwArg40, Register out ptr32 a0Out, Register out Eq_39792 a3Out, Register out Eq_39793 a4Out, Register out (ptr32 Eq_39794) s2Out, Register out Eq_39792 s8Out)
// Called from:
//      sm_assoc_req_send
Eq_2 me_build_associate_req(Eq_2 ra, struct Eq_39780 * a1, struct Eq_26465 * a3, union Eq_39793 * a4, word16 * a5, Eq_2 a6, Eq_2 s6, int32 s8, byte * s10, byte * s11, word32 dwArg04, Eq_2 dwArg40, ptr32 & a0Out, union Eq_39792 & a3Out, union Eq_39793 & a4Out, struct Eq_39794 & s2Out, union Eq_39792 & s8Out)
{
	int8 bLoc50_515 = (int8) s6;
	byte bLoc51_523 = SLICE(s8, byte, 24);
	uint32 s0_31 = (word32) *((word32) a6 + 56);
	word32 s5_41 = (word32) *((word32) a6 + 54);
	Eq_39792 s8_154 = (word32) *((word32) a6 + 60);
	if (s0_31 == 0x00)
		s0_31 = 0x05;
	struct Eq_84622 * a2_52;
	struct Eq_84623 * a5_55;
	word32 a4_835;
	word32 a3_834;
	uint32 a0_51 = me_build_capability(a3, out a2_52, out a3_834, out a4_835, out a5_55);
	0x00 = dwArg04;
	a5_55->b0000 = (byte) a0_51;
	a5_55->b0001 = (byte) (a0_51 >> 0x08);
	a5_55->b0002 = (byte) s0_31;
	a5_55->b0003 = (byte) (s0_31 >> 8);
	struct Eq_83799 * a4_57 = a0_51 >> 0x08;
	int32 s0_66 = 0x04;
	if (a2_52 != null)
	{
		a5_55->w0004 = (word16) (word32) a2_52->w0000;
		a5_55->w0006 = (word16) (word32) a2_52->w0002;
		a4_57 = (word32) a2_52->w0004;
		a5_55->w0008 = (word16) a4_57;
		s0_66 = 0x0A;
	}
	*a4 = (union Eq_39793 *) (a5_55 + s0_66 / 0x0A);
	word32 a0_94 = me_add_ie_ssid((word32) a1->b0026, &a1->b0026 + 1, a4_57);
	word32 a0_105;
	byte * a3_108;
	struct Eq_45035 * s1_111 = me_add_ie_supp_rates(&a1->b0058, out a0_105, out a3_108);
	byte * a5_117 = (byte *) 0x08;
	word32 s0_118 = (word32) (word16) (s0_66 + (a0_105 + a0_94));
	if ((word32) a1->b0058 > 0x08)
	{
		word32 a0_121;
		word32 a4_836;
		s1_111 = me_add_ie_ext_supp_rates(&a1->b0058, (struct Eq_83877 *) 0x08, out a0_121, out a3_108, out a4_836, out a5_117);
		s0_118 = (word32) (word16) (s0_118 + a0_121);
	}
	struct Eq_39794 * s2_134 = a0_51 & 0x0100;
	if ((a0_51 & 0x0100) != 0x00)
	{
		*a5_117 = 33;
		*a5_117 = 0x02;
		Eq_2 s0_153 = phy_get_rf_gain_capab(fp + -80, fp + -81, out s8_154);
		byte * a5_159 = (int32) a1->ptr004C->b0004;
		if (a5_159 < (int32) bLoc50_515)
			bLoc50_515 = (byte) a5_159;
		byte * a6_190;
		*a5_159 = (byte) (word32) bLoc51_523;
		*a5_159 = (byte) (word32) bLoc50_515;
		*a5_159 = 0x24;
		byte * dwArg0C_531 = a3_108 + 1;
		if ((word32) a1->ptr004C->b0002 == 0x00)
		{
			a6_190 = (word32) g_b4201B100;
			s2_134 = (struct Eq_39794 *) &g_t4201B004;
		}
		else
		{
			a6_190 = (word32) g_b4201B101;
			s2_134 = (struct Eq_39794 *) &g_t4201B058;
		}
		ui32 a7_197 = 0x00;
		ui32 s4_198 = 0x00;
		byte * s10_199 = null;
		ui32 t1_200 = 0x00;
		a5_117 = null;
		while (true)
		{
			ui32 s9_206 = a7_197 + 2;
			if (s10_199 == a6_190)
				break;
			if (((word32) s2_134->b0003 & 0x02) == 0x00)
			{
				word32 a5_847;
				word32 a4_846;
				ui32 a0_227 = phy_freq_to_channel((word32) s2_134->b0002, (word32) s2_134->w0000, out a3_108, out a4_846, out a5_847);
				null = s11;
				a6_190 = s10;
				ui32 s4_235 = a7_197;
				a5_117 = a0_227 & 0x00FF;
				if (a7_197 != 0x00)
				{
					s0_153 = dwArg40;
					if ((a0_227 & 0x00FF) - t1_200 != dwLoc14)
					{
						*s11 = (byte) (a0_227 & 0x00FF);
						*dwArg0C_531 = (byte) a7_197;
						s8_154 = dwLoc14;
						a7_197 = s9_206 & 0x00FF;
						++dwArg0C_531;
						s4_235 = a7_197 + 1 & 0x00FF;
					}
				}
				s4_198 = s4_235 + 0x01 & 0x00FF;
				++s2_134;
				t1_200 = a0_227 & 0x00FF;
			}
			s10_199 = s10_199 + 1 & 0x00FF;
		}
		*s11 = (byte) a5_117;
		*a5_117 = (byte) s4_198;
		*a3_108 = (byte) (s9_206 & 0x00FF);
		s0_118 = (word32) (word16) ((word32) s0_153 + 6 + (s9_206 & 0x00FF));
	}
	struct Eq_45035 * a4_299 = s1_111 + s5_41;
	struct Eq_45035 * a6_300;
	int32 a5_302 = a5_117 - s1_111;
	for (a6_300 = s1_111; a4_299 != a6_300; ++a6_300)
		a6_300[a5_302] = (struct Eq_45035) (byte) (word32) a6_300[64];
	word32 s5_319 = s5_41 + a5_302;
	ptr32 s0_328 = (word32) (word16) (s0_118 + s5_41);
	if ((a1->dw0088 & 0x01) != 0x00)
	{
		word32 a3_841;
		word32 a4_842;
		word32 a1_839;
		word32 t1_837;
		word32 a0_838;
		word32 a5_843;
		word32 a2_840;
		memset(ra, fp + -78, 0x00, 0x0E, out t1_837, out a0_838, out a1_839, out a2_840, out a3_841, out a4_842, out a5_843);
		if (g_t42018ED0 != 0x00)
			(int32) a1->b0068 >= 0x00;
		word32 a4_844;
		word32 a5_845;
		co_pack8p(s5_319, fp + -80, (word32 *) 0x09, out a4_844, out a5_845);
		a4_299 = (struct Eq_45035 *) 0x07;
		s0_328 = (word32) (word16) (s0_328 + 0x09);
	}
	int32 a5_396 = a1->dw0088;
	ui32 a5_397 = a5_396 & 0x02;
	if ((a5_396 & 0x02) != 0x00)
	{
		a5_397 = (word32) g_b4201B002;
		if (a5_397 != 0x00)
		{
			word32 a0_403;
			me_add_ie_ht_capa(a4_299, out a0_403, out a5_397);
			s0_328 = (word32) (word16) (s0_328 + a0_403);
		}
	}
	Eq_39793 a4_427 = *a4;
	*a5 = (word16) (a5_397 - a4_427);
	a0Out = s0_328;
	a3Out = dwLoc14;
	a4Out = a4_427;
	s2Out = s2_134;
	s8Out = s8_154;
	return dwArg0158;
}

// 2301D20A: Register (ptr32 Eq_83425) me_build_add_ba_req(Register (ptr32 Eq_83425) a0, Register (ptr32 Eq_83230) a1, Register out Eq_83427 a5Out)
// Called from:
//      bam_send_air_action_frame
struct Eq_83425 * me_build_add_ba_req(struct Eq_83425 * a0, struct Eq_83230 * a1, union Eq_83427 & a5Out)
{
	a0->b0000 = 0x03;
	a0->b0001 = 0x00;
	a0->b0002 = (byte) (word32) a1->b0011;
	uint32 a5_17 = (word32) a1->b000E << 1 | (word32) a1->b0010 << 2 | (word32) a1->b000F << 6;
	a0->b0003 = (byte) a5_17;
	a0->b0004 = (byte) (a5_17 >> 8);
	uint32 a5_21 = (word32) a1->w000A;
	a0->b0005 = (byte) a5_21;
	a0->b0006 = (byte) (a5_21 >> 8);
	uint32 a5_28 = (word32) a1->w0008 << 20 >> 16;
	a0->b0007 = (byte) a5_28;
	a0->b0008 = (byte) (a5_28 >> 8);
	a5Out = a5_28 >> 8;
	return (struct Eq_83425 *) 0x09;
}

// 2301D262: Register (ptr32 Eq_83401) me_build_add_ba_rsp(Register (ptr32 Eq_83401) a0, Register Eq_83216 a2, Register (ptr32 Eq_13120) a3, Register uint32 a4, Register out (ptr32 byte) a5Out)
// Called from:
//      bam_send_air_action_frame
struct Eq_83401 * me_build_add_ba_rsp(struct Eq_83401 * a0, Eq_83216 a2, struct Eq_13120 * a3, uint32 a4, byte & a5Out)
{
	a0->b0000 = 0x03;
	a0->b0001 = 0x01;
	a0->b0005 = (byte) a2;
	a0->b0004 = (byte) (a4 >> 0x08);
	a0->b0002 = (byte) a3;
	a0->b0003 = (byte) a4;
	a0->b0006 = (byte) (a2 >> 8);
	if (a4 != 0x00)
	{
		a0->b0007 = 0x00;
		a0->b0008 = 0x00;
	}
	else
	{
		a0->b0007 = 0xD0;
		a0->b0008 = 0x07;
	}
	a5Out = &a0->b0007;
	return (struct Eq_83401 *) 0x09;
}

// 2301D2AA: Register (ptr32 Eq_83440) me_build_del_ba(Register (ptr32 Eq_83440) a0, Register (ptr32 Eq_83230) a1, Register uint32 a2, Register out (ptr32 byte) a3Out, Register out Eq_83444 a5Out)
// Called from:
//      bam_send_air_action_frame
struct Eq_83440 * me_build_del_ba(struct Eq_83440 * a0, struct Eq_83230 * a1, uint32 a2, byte & a3Out, union Eq_83444 & a5Out)
{
	a0->b0000 = 0x03;
	a0->b0001 = 0x02;
	uint32 a5_15 = (word32) a1->b0010 << 28 >> 16;
	if ((word32) a1->b000D == 0x01)
		a5_15 = (word32) (word16) (a5_15 | 0x00FFF800);
	a0->b0002 = 0x00;
	Eq_83444 a5_24 = a5_15 >> 8;
	a0->b0003 = (byte) a5_24;
	a0->b0004 = (byte) a2;
	a0->b0005 = (byte) (a2 >> 8);
	a3Out = &a0->b0002;
	a5Out = a5_24;
	return (struct Eq_83440 *) 0x06;
}

// 2301D2F2: void me_extract_rate_set(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_34770) a2, Stack Eq_2 dwArg38)
// Called from:
//      rxu_mgt_ind_handler
void me_extract_rate_set(Eq_2 a0, byte * a1, struct Eq_34770 * a2, Eq_2 dwArg38)
{
	a2->b0000 = 0x00;
	word32 a5_120;
	Eq_2 a0_22 = mac_ie_find(a0, a1, 0x01, out a5_120);
	if (a0_22 != 0x00)
	{
		up32 a4_23 = (word32) *((word32) a0_22 + 1);
		if (a4_23 <= 0x0C)
		{
			struct Eq_85216 * a5_25 = a2 + 1;
			up32 a3_26 = a4_23;
			while (true)
			{
				a3_26 += ~0x00;
				if (a3_26 == ~0x00)
					break;
				++a5_25;
				a5_25[0x0FFF] = (struct Eq_85216) (byte) (word32) *((word32) a0_22 + (a5_25 - a2));
			}
			a2->b0000 = (byte) a4_23;
			word32 a5_121;
			Eq_2 a0_49 = mac_ie_find(a0, a1, 50, out a5_121);
			if (a0_49 != 0x00)
			{
				int32 s1_51 = (word32) *((word32) a0_49 + 1);
				if ((word32) a2->b0000 + s1_51 > 0x0C)
					assert_err();
				word32 a5_60 = (word32) a2->b0000;
				if (a5_60 + s1_51 <= 0x0C)
				{
					int32 a5_65;
					for (a5_65 = 0x00; s1_51 != a5_65; ++a5_65)
						a2[a5_60 + 1 + a5_65] = (struct Eq_34770) (byte) (word32) ((word32) a0_49 + 2 + a5_65);
					a2->b0000 = (byte) (s1_51 + (word32) a2->b0000);
				}
			}
		}
	}
	0x00 = (uint16) dwArg38;
}

// 2301D3BA: void me_extract_power_constraint(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_27113) a2)
// Called from:
//      me_beacon_check
//      rxu_mgt_ind_handler
void me_extract_power_constraint(Eq_2 a0, byte * a1, struct Eq_27113 * a2)
{
	word32 a5_32;
	Eq_2 a0_15 = mac_ie_find(a0, a1, 32, out a5_32);
	word32 a5_16 = 0x00;
	if (a0_15 != 0x00)
		a5_16 = (word32) *((word32) a0_15 + 2);
	a2->b0084 = (byte) a5_16;
}

// 2301D3DE: void me_extract_country_reg(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_34770) a2, Stack Eq_2 dwArg38)
// Called from:
//      rxu_mgt_ind_handler
void me_extract_country_reg(Eq_2 a0, byte * a1, struct Eq_34770 * a2, Eq_2 dwArg38)
{
	word32 a5_118;
	Eq_2 a0_19 = mac_ie_find(a0, a1, 0x07, out a5_118);
	if (a0_19 != 0x00)
	{
		struct Eq_85320 * s0_20 = a2[76];
		word32 s2_22 = 0x01;
		Eq_83729 a0_23 = (word32) s0_20->b0002;
		if (a0_23 != 0x00)
			s2_22 = 0x04;
		word32 a3_119;
		word32 a4_120;
		word32 a5_121;
		ui32 a0_29 = phy_freq_to_channel(a0_23, (word32) s0_20->w0000, out a3_119, out a4_120, out a5_121);
		word32 a2_35 = (word32) *((word32) a0_19 + 1);
		int32 a5_37 = 0x05;
		while (a2_35 + 0x01 >= a5_37)
		{
			struct Eq_85354 * a1_42 = (word32) a0_19 + a5_37;
			ui32 a3_44 = (word32) a1_42->b0000;
			ui32 a6_45 = (word32) a1_42->b0001;
			ui32 a4_46 = 0x00;
			while (a4_46 != a6_45)
			{
				if (a3_44 == (a0_29 & 0x00FF))
				{
					s0_20->b0004 = (byte) (word32) a1_42->b0002;
					goto l2301D43E;
				}
				a3_44 = a3_44 + s2_22 & 0x00FF;
				a4_46 = a4_46 + 0x01 & 0x00FF;
			}
			a5_37 = a5_37 + 0x03 & 0x00FF;
		}
	}
l2301D43E:
	0x00 = (uint16) dwArg38;
}

// 2301D458: void me_extract_mobility_domain(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_34770) a2)
// Called from:
//      rxu_mgt_ind_handler
void me_extract_mobility_domain(Eq_2 a0, byte * a1, struct Eq_34770 * a2)
{
	word32 a5_40;
	Eq_2 a0_15 = mac_ie_find(a0, a1, 54, out a5_40);
	if (a0_15 == 0x00)
	{
		a2[0x008C] = (struct Eq_34770) 0x00;
		a2[0x008E] = (struct Eq_34770) 0x00;
	}
	else
	{
		a2[0x008C] = (struct Eq_34770) (word16) ((word32) *((word32) a0_15 + 3) << 8 | (word32) (*((word32) a0_15 + 2)));
		a2[0x008E] = (struct Eq_34770) (byte) (word32) *((word32) a0_15 + 4);
	}
}

// 2301D494: Register word32 me_extract_csa(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 byte) a2, Register (ptr32 Eq_27131) a3, Stack Eq_2 dwArgA8, Register out (ptr32 byte) s1Out, Register out (ptr32 byte) a0Out, Register out Eq_2 s2Out, Register out Eq_27136 s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out Eq_2 s6Out, Register out ptr32 s8Out)
// Called from:
//      me_beacon_check
word32 me_extract_csa(Eq_2 a0, byte * a1, byte * a2, struct Eq_27131 * a3, Eq_2 dwArgA8, byte & s1Out, byte & a0Out, union Eq_2 & s2Out, union Eq_27136 & s3Out, ptr32 & s4Out, byte & s5Out, union Eq_2 & s6Out, ptr32 & s8Out)
{
	byte * a0_163;
	word32 a5_289;
	Eq_2 a0_31 = mac_ie_find(a0, a1, 37, out a5_289);
	word32 a5_290;
	Eq_2 a0_38 = mac_ie_find(a0, a1, 60, out a5_290);
	byte * s5_276 = a2;
	byte * s1_160 = a1;
	Eq_2 s2_102 = a0_31;
	if ((a0_31 | a0_38) == 0x00)
	{
		a0_163 = null;
		goto l2301D57A;
	}
	word32 a5_291;
	Eq_2 a0_47 = mac_ie_find(a0, a1, 62, out a5_291);
	word32 a5_292;
	Eq_2 a0_54 = mac_ie_find(a0, a1, 0x00C4, out a5_292);
	s6 = a0_47;
	Eq_2 s0_55 = a0_54;
	if (a0_54 != 0x00)
	{
		word32 a5_293;
		s0_55 = mac_ie_find((word32) a0_54 + 2, (word32) *((word32) a0_54 + 1), 0x00C2, out a5_293);
	}
	Eq_2 a1_70;
	if (a0_31 != 0x00)
	{
		s1_160 = (word32) *((word32) a0_31 + 4);
		*a2 = (byte) (word32) *((word32) a0_31 + 2);
		a1_70 = (word32) *((word32) a0_31 + 3);
	}
	else
	{
		s1_160 = (word32) *((word32) a0_38 + 5);
		*a2 = (byte) (word32) *((word32) a0_38 + 2);
		a1_70 = (word32) *((word32) a0_38 + 4);
	}
	if (s1_160 == null)
		s1_160 = (byte *) 0x02;
	byte * s0_100;
	byte * a0_101;
	word32 s3_79 = (word32) (a1_70 < 0x0F);
	byte * a0_82 = phy_channel_to_freq(s3_79 ^ 1, a1_70);
	s3 = s3_79 ^ 1;
	s5_276 = a0_82;
	if (s0_55 != 0x00)
	{
		Eq_2 a1_111 = (word32) *((word32) s0_55 + 3);
		struct Eq_85546 * a5_113 = (word32) *((word32) s0_55 + 2) + ~0x00 & 0x00FF;
		s6 = (word32) *((word32) s0_55 + 4);
		s2_102.u0 = 0x01;
		if (a5_113 <= (struct Eq_85546 *) 0x02)
			s2_102 = (word32) a5_113->b2308DDF4;
		s0_100 = phy_channel_to_freq(s3_79 ^ 1, a1_111);
		a0_101 = null;
		if (s6 != 0x00)
			a0_101 = phy_channel_to_freq(s3_79 ^ 1, s6);
l2301D564:
		a3->w0006 = (word16) a0_101;
		a3->b0000 = (byte) (s3_79 ^ 1);
		a3->b0001 = (byte) s2_102;
		a3->w0002 = (word16) a0_82;
		a3->w0004 = (word16) s0_100;
		a0_163 = s1_160;
l2301D57A:
		0x00 = (uint16) dwArgA8;
		s1Out = s1_160;
		a0Out = a0_163;
		s2Out = s2_102;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5_276;
		s6Out = s6;
		s8Out = s4;
		return s1;
	}
	if (a0_47 != 0x00)
	{
		word32 a5_95 = (word32) *((word32) a0_47 + 2);
		word32 s0_103 = a0_82 + 0x0A;
		if (a5_95 == 0x01)
		{
l2301D5BC:
			s0_100 = (word32) (word16) s0_103;
			a0_101 = null;
			s2_102.u0 = 0x01;
			goto l2301D564;
		}
		if (a5_95 == 0x03)
		{
			s0_103 = a0_82 + -0x0A;
			goto l2301D5BC;
		}
	}
	s0_100 = a0_82;
	a0_101 = null;
	s2_102.u0 = 0x00;
	goto l2301D564;
}

// 2301D5D2: Register Eq_2 me_build_beacon(Register Eq_2 ra, Register (ptr32 Eq_85617) a0, Register (ptr32 Eq_26465) a1, Register (ptr32 word16) a2, Register (ptr32 byte) a3, Register Eq_2 s5, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg94, Register out (ptr32 Eq_85626) s0Out, Register out ptr32 a0Out, Register out (ptr32 Eq_85628) a4Out, Register out (ptr32 Eq_85629) s2Out, Register out ptr32 s4Out)
// Called from:
//      apm_start_req_handler
Eq_2 me_build_beacon(Eq_2 ra, struct Eq_85617 * a0, struct Eq_26465 * a1, word16 * a2, byte * a3, Eq_2 s5, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, Eq_2 dwArg94, struct Eq_85626 & s0Out, ptr32 & a0Out, struct Eq_85628 & a4Out, struct Eq_85629 & s2Out, ptr32 & s4Out)
{
	ptr32 s3_163 = (word32) a1->b4201AE00;
	a0->b0000 = 0x80;
	a0->b0001 = 0x00;
	a0->b0002 = 0x00;
	a0->b0003 = 0x00;
	word32 a3_621;
	word32 a1_619;
	word32 a2_620;
	word32 a4_622;
	word32 a5_623;
	word32 a6_624;
	word32 a7_625;
	memcpy(&a0->b0003 + 1, 0x2308DD8C, 0x06, out a1_619, out a2_620, out a3_621, out a4_622, out a5_623, out a6_624, out a7_625);
	word32 a3_628;
	word32 a4_629;
	word32 a1_626;
	word32 a2_627;
	word32 a7_632;
	word32 a6_631;
	word32 a5_630;
	memcpy(&a0->b0003 + 7, (char *) a1 + 0x4201AA38, 0x06, out a1_626, out a2_627, out a3_628, out a4_629, out a5_630, out a6_631, out a7_632);
	word32 a4_636;
	word32 a1_633;
	word32 a2_634;
	word32 a3_635;
	word32 a5_637;
	word32 a6_638;
	word32 a7_639;
	memcpy(&a0->b0003 + 0x0D, (char *) a1 + 0x4201AA38, 0x06, out a1_633, out a2_634, out a3_635, out a4_636, out a5_637, out a6_638, out a7_639);
	uint32 a5_102 = (word32) g_w4201A3FC + 0x01 << 16;
	g_w4201A3FC = (word16) (a5_102 >> 16);
	uint32 a5_107 = (word32) (word16) (a5_102 >> 16 << 4);
	a0->b0016 = (byte) a5_107;
	a0->b0017 = (byte) (a5_107 >> 8);
	uint32 a5_111 = (word32) a1->w4201ADFA;
	g_b4201A3C8 = (byte) a5_111;
	g_b4201A3C9 = (byte) (a5_111 >> 8);
	ptr32 s4_164 = (char *) a1 + 0x05D8;
	word16 * s6_166 = a2;
	byte * s5_165 = a3;
	int32 s2_100 = 0x4201A410;
	Eq_2 a3_118;
	struct Eq_85763 * a5_120;
	word32 a2_640;
	struct Eq_83799 * a4_119;
	uint32 a0_116 = me_build_capability(a1, out a2_640, out a3_118, out a4_119, out a5_120);
	if (s3_163 != 0x00)
		a0_116 = (word32) (word16) (a0_116 | 16);
	word32 * a1_144;
	a5_120->b0022 = (byte) a0_116;
	a5_120->b0023 = (byte) (a0_116 >> 8);
	Eq_2 a2_135 = dwArg94;
	if (a4_119 != null)
	{
		word32 s10_651;
		word32 s11_652;
		word32 t4_653;
		word32 a5_646;
		word32 a7_647;
		word32 s7_648;
		word32 s8_649;
		word32 s9_650;
		word32 a1_643;
		word32 a2_644;
		word32 a3_645;
		word32 s1_641;
		word32 a0_642;
		ra = printf(ra, &g_t23078530, a3_118, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_641, out a0_642, out a1_643, out a2_644, out a3_645, out a4_119, out a5_646, out a7_647, out s2_100, out s3_163, out s4_164, out s5_165, out s6_166, out s7_648, out s8_649, out s9_650, out s10_651, out s11_652, out t4_653);
		a2_135.u0 = 0x00;
		a1_144 = null;
	}
	else
		a1_144 = (word32) a1->b4201AD66;
	struct Eq_45035 * s7_191 = s4_164 + 944 + s2_100;
	word32 s0_206 = (word32) (word16) (me_add_ie_ssid(a1_144, a2_135, a4_119) + 36) + a0_195;
	word32 a0_195;
	word32 a3_665;
	struct Eq_45035 * s1_201 = me_add_ie_supp_rates(s7_191, out a0_195, out a3_665);
	word32 s0_208 = (word32) (word16) s0_206;
	if ((word32) (s1_201 + 0x05D8 + s2_100)[944] > 0x08)
	{
		word32 a0_215;
		word32 a3_662;
		word32 a4_663;
		word32 a5_664;
		s1_201 = me_add_ie_ext_supp_rates(s7_191, (struct Eq_83877 *) 0x08, out a0_215, out a3_662, out a4_663, out a5_664);
		s0_208 = (word32) (word16) ((word32) (word16) s0_206 + a0_215);
	}
	struct Eq_85836 * s7_232 = s1_201 + 0x05D8 + s2_100;
	struct Eq_84327 * a5_245;
	word32 a4_654;
	word32 s0_249 = (word32) (word16) (s0_208 + me_add_ie_ds(((word32) (*s7_232->ptr03A4) + 0xFF000694 ^ 0x05) + 0x01 & 0x00FF, (struct Eq_83930 *) 0x05, out a4_654, out a5_245));
	*s6_166 = (word16) s0_249;
	struct Eq_83980 * a4_257;
	ui32 a0_256 = me_add_ie_tim((word32) s7_232->b03AC, a5_245, out a4_257);
	*s5_165 = (byte) (a0_256 & 0x00FF);
	word32 a2_655;
	word32 a5_656;
	ui32 a0_270 = me_add_ie_rsn(s3_163, a4_257, out a2_655, out a5_656);
	struct Eq_83956 * a5_283;
	word32 a3_658;
	word32 a4_659;
	word32 a6_660;
	word32 a7_661;
	word32 a1_657;
	struct Eq_84194 * a2_286;
	memcpy(0x4201D0F8, s3_163 - (a0_270 & 0x00FF), a0_270 & 0x00FF, out a1_657, out a2_286, out a3_658, out a4_659, out a5_283, out a6_660, out a7_661);
	struct Eq_45035 * a4_298;
	word32 s0_308 = (word32) (word16) ((word32) (word16) (s0_249 + (a0_256 & 0x00FF)) + me_add_ie_erp(0x00, a5_283, out a4_298) + (a0_270 & 0x00FF));
	if ((s7_232->dw03E0 & 0x02) != 0x00)
	{
		word32 a0_310;
		struct Eq_84449 * a5_315;
		s1_201 = me_add_ie_ht_capa(a4_298, out a0_310, out a5_315);
		word32 a3_667;
		s0_308 = (word32) (word16) (s0_308 + (me_add_ie_ht_oper(s1_201, a5_315, out a2_286, out a3_667) + a0_310));
	}
	word32 a3_666;
	struct Eq_85628 * a4_339;
	ptr32 s0_349 = (word32) (word16) (s0_308 + me_add_ie_wpa(s3_163, a2_286, out a3_666, out a4_339));
	struct Eq_85629 * s2_351 = s1_201 + 0x05D8 + s2_100;
	if ((s2_351->dw03E0 & 0x01) != 0x00)
	{
		word32 a1_669;
		word32 a2_670;
		word32 a3_671;
		word32 a4_672;
		word32 a5_673;
		word32 a0_361;
		word32 t1_668;
		memset(ra, fp + -62, 0x00, 0x0E, out t1_668, out a0_361, out a1_669, out a2_670, out a3_671, out a4_672, out a5_673);
		word32 a5_674;
		struct Eq_86050 * a4_384;
		struct Eq_83833 * a3_383 = co_pack8p(a0_361, fp + -64, (word32 *) 0x09, out a4_384, out a5_674);
		struct Eq_86059 * a5_387 = (word32) a4_384->b0001;
		a4_384->b0001 = (byte) ((char *) a5_387 + 0x0011);
		a5_387->b001A = 0x00;
		Eq_86074 a5_397 = s2_351->t000C;
		a3_383->b0001 = (byte) a5_397;
		a3_383->b0002 = (byte) (a5_397 >> 0x08);
		a3_383->b0003 = (byte) (a5_397 >> 0x10);
		a3_383->b0004 = (byte) (a5_397 >> 24);
		Eq_86100 a5_408 = s2_351->t0008;
		(a5_397 >> 0x10)->b0004 = (byte) a5_408;
		struct Eq_86109 * a4_409 = (a5_397 >> 0x10) + 4;
		a4_409->b0001 = (byte) (a5_408 >> 0x08);
		a4_409->b0002 = (byte) (a5_408 >> 0x10);
		a4_409->b0003 = (byte) (a5_408 >> 24);
		Eq_86131 a5_419 = s2_351->t0010;
		(a5_408 >> 0x10)->b0004 = (byte) a5_419;
		a4_339 = (a5_408 >> 0x10) + 4;
		a4_339->b0001 = (byte) (a5_419 >> 0x08);
		a4_339->b0002 = (byte) (a5_419 >> 0x10);
		a4_339->b0003 = (byte) (a5_419 >> 24);
		Eq_86161 a5_429 = s2_351->t0014;
		a4_339->b0004 = (byte) a5_429;
		a4_339->b0005 = (byte) (a5_429 >> 0x08);
		a4_339->b0006 = (byte) (a5_429 >> 0x10);
		a4_339->b0007 = (byte) (a5_429 >> 24);
		s0_349 = (word32) (word16) (s0_349 + 0x1A);
	}
	s0Out = dwArgCC;
	a0Out = s0_349;
	a4Out = a4_339;
	s2Out = s2_351;
	s4Out = dwArg0168;
	return dwLoc08;
}

