pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301D8F2: Register Eq_2 me_build_probe_rsp(Register Eq_2 ra, Register (ptr32 Eq_44962) a0, Register (ptr32 Eq_26465) a1, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_44966) s1Out, Register out ptr32 a0Out, Register out Eq_44968 a3Out, Register out Eq_44969 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      apm_send_mlme
Eq_2 me_build_probe_rsp(Eq_2 ra, struct Eq_44962 * a0, struct Eq_26465 * a1, Eq_2 dwArgA4, Eq_2 dwArg0198, struct Eq_44966 & s1Out, ptr32 & a0Out, union Eq_44968 & a3Out, union Eq_44969 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 s3_26 = (word32) a1->b4201AE00;
	uint32 a5_27 = (word32) a1->w4201ADFA;
	a0->b0008 = (byte) a5_27;
	a0->b0009 = (byte) (a5_27 >> 8);
	struct Eq_83799 * a4_38;
	struct Eq_86212 * a5_39;
	word32 a3_403;
	word32 a2_402;
	uint32 a0_35 = me_build_capability(a1, out a2_402, out a3_403, out a4_38, out a5_39);
	if (s3_26 != 0x00)
		a0_35 = (word32) (word16) (a0_35 | 16);
	a5_39->b000A = (byte) a0_35;
	a5_39->b000B = (byte) (a0_35 >> 8);
	word32 a0_67 = me_add_ie_ssid((word32) a1->b4201AD66, dwArgA4, a4_38);
	uint32 s0_89 = a0_67 + a0_78 + 0x0C << 16;
	word32 a0_78;
	word32 a3_404;
	struct Eq_45035 * s1_100 = me_add_ie_supp_rates(&a1->b4201AD98, out a0_78, out a3_404);
	uint32 s0_104 = s0_89 >> 16;
	if ((word32) a1->b4201AD98 > 0x08)
	{
		word32 a0_94;
		word32 a4_409;
		word32 a5_410;
		word32 a3_408;
		s1_100 = me_add_ie_ext_supp_rates(&a1->b4201AD98, (struct Eq_83877 *) 0x08, out a0_94, out a3_408, out a4_409, out a5_410);
		s0_104 = (word32) (word16) ((s0_89 >> 16) + a0_94);
	}
	struct Eq_86269 * s5_107 = s1_100 + 0x05D8;
	struct Eq_86272 * a5_111 = s5_107->ptr4201A7B4;
	struct Eq_83930 * a5_116;
	struct Eq_83980 * a4_123;
	struct Eq_83956 * a5_132;
	struct Eq_45035 * a4_142;
	word32 a5_407;
	word32 a4_406;
	word32 a3_405;
	struct Eq_84194 * a2_134;
	word32 s0_150 = (word32) (word16) ((word32) (word16) (s0_104 + (me_add_ie_rsn(s3_26, a4_123, out a2_134, out a5_132) + me_add_ie_ds(phy_freq_to_channel((word32) a5_111->b0002, (word32) a5_111->w0000, out a3_405, out a4_406, out a5_116) & 0x00FF, a5_116, out a4_123, out a5_407))) + me_add_ie_erp(0x00, a5_132, out a4_142));
	if ((s5_107->dw4201A7F0 & 0x02) != 0x00)
	{
		word32 a0_152;
		struct Eq_84449 * a5_157;
		s1_100 = me_add_ie_ht_capa(a4_142, out a0_152, out a5_157);
		word32 a3_412;
		s0_150 = (word32) (word16) (s0_150 + (me_add_ie_ht_oper(s1_100, a5_157, out a2_134, out a3_412) + a0_152));
	}
	struct Eq_44966 * s1_187 = s1_100 + 0x05D8;
	word32 a4_411;
	Eq_44968 a3_183;
	ptr32 s0_191 = (word32) (word16) (s0_150 + me_add_ie_wpa(s3_26, a2_134, out a3_183, out a4_411));
	int32 a5_195 = s1_187->dw4201A7F0;
	Eq_44969 a5_196 = a5_195 & 0x01;
	if ((a5_195 & 0x01) != 0x00)
	{
		word32 a0_203;
		word32 a4_417;
		word32 a5_418;
		word32 t1_413;
		word32 a1_414;
		word32 a2_415;
		word32 a3_416;
		ra = memset(ra, fp + -46, 0x00, 0x0E, out t1_413, out a0_203, out a1_414, out a2_415, out a3_416, out a4_417, out a5_418);
		struct Eq_86405 * a4_226;
		word32 a5_419;
		struct Eq_83833 * a3_225 = co_pack8p(a0_203, fp + -48, (word32 *) 0x09, out a4_226, out a5_419);
		struct Eq_86415 * a5_229 = (word32) a4_226->b0001;
		a4_226->b0001 = (byte) ((char *) a5_229 + 0x0011);
		a5_229->b001A = 0x00;
		Eq_86430 a5_239 = s1_187->t4201A41C;
		a3_225->b0001 = (byte) a5_239;
		a3_225->b0002 = (byte) (a5_239 >> 0x08);
		a3_225->b0003 = (byte) (a5_239 >> 0x10);
		a3_225->b0004 = (byte) (a5_239 >> 24);
		Eq_86456 a5_250 = s1_187->t4201A418;
		(a5_239 >> 0x10)->b0004 = (byte) a5_250;
		struct Eq_86465 * a4_251 = (a5_239 >> 0x10) + 4;
		a4_251->b0001 = (byte) (a5_250 >> 0x08);
		a4_251->b0002 = (byte) (a5_250 >> 0x10);
		a4_251->b0003 = (byte) (a5_250 >> 24);
		Eq_86487 a5_261 = s1_187->t4201A420;
		(a5_250 >> 0x10)->b0004 = (byte) a5_261;
		struct Eq_86496 * a4_262 = (a5_250 >> 0x10) + 4;
		a4_262->b0001 = (byte) (a5_261 >> 0x08);
		a4_262->b0002 = (byte) (a5_261 >> 0x10);
		a4_262->b0003 = (byte) (a5_261 >> 24);
		Eq_86518 a5_271 = s1_187->t4201A424;
		a4_262->b0004 = (byte) a5_271;
		a4_262->b0005 = (byte) (a5_271 >> 0x08);
		a4_262->b0006 = (byte) (a5_271 >> 0x10);
		a4_262->b0007 = (byte) (a5_271 >> 24);
		a3_183 = a5_271 >> 0x10;
		a5_196 = a5_271 >> 24;
		s0_191 = (word32) (word16) (s0_191 + 0x1A);
	}
	0x00 = (uint16) dwArg0198;
	s1Out = s1_187;
	a0Out = s0_191;
	a3Out = a3_183;
	a5Out = a5_196;
	s2Out = (char *) s1_187 + 0x4201A410;
	s3Out = s3_26;
	s4Out = dwArgF4;
	return ra;
}

// 2301DB32: Register Eq_2 me_build_associate_rsp(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_26465) a1, Register (ptr32 Eq_44744) a3, Stack Eq_2 dwArgA4, Register out (ptr32 Eq_45035) s1Out, Register out Eq_45036 a0Out, Register out Eq_45037 a3Out, Register out (ptr32 Eq_45038) a5Out, Register out (ptr32 Eq_26465) s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_45041) s4Out)
// Called from:
//      apm_send_mlme
Eq_2 me_build_associate_rsp(Eq_2 ra, ptr32 a0, struct Eq_26465 * a1, struct Eq_44744 * a3, Eq_2 dwArgA4, struct Eq_45035 & s1Out, union Eq_45036 & a0Out, union Eq_45037 & a3Out, struct Eq_45038 & a5Out, struct Eq_26465 & s2Out, ptr32 & s3Out, struct Eq_45041 & s4Out)
{
	struct Eq_86550 * a5_35;
	word32 a2_344;
	word32 a4_346;
	word32 a3_345;
	uint32 a0_31 = me_build_capability(a1, out a2_344, out a3_345, out a4_346, out a5_35);
	if (a0 != 0x00)
		a0_31 = (word32) (word16) (a0_31 | 16);
	a5_35->b0000 = (byte) a0_31;
	a5_35->b0001 = (byte) (a0_31 >> 8);
	a5_35->b0002 = (byte) dwArgA4;
	a5_35->b0003 = (byte) (dwArgA4 >> 0x08);
	ui32 a5_56 = (word32) a3->w0044;
	(dwArgA4 >> 0x08)->b0004 = (byte) (a5_56 | 0x0C000000);
	uint32 a5_60 = (a5_56 | 0x0C000000) >> 8;
	(dwArgA4 >> 0x08)->b0005 = (byte) a5_60;
	Eq_45037 a3_121 = 0x0C000000;
	Eq_45036 s0_126 = 0x06;
	struct Eq_45038 * a5_133 = a5_60 + 0x06;
	if (dwArgA4 == 0x00)
	{
		word32 a0_68;
		s1 = me_add_ie_supp_rates(&a3->b0006, out a0_68, out a3_121);
		uint32 s0_78 = a0_68 + 0x06 << 0x10;
		struct Eq_45035 * a4_100 = (word32) a3->b0006;
		s0_126 = s0_78 >> 16;
		if (a4_100 > (struct Eq_45035 *) 0x08)
		{
			word32 a0_83;
			word32 a5_347;
			s1 = me_add_ie_ext_supp_rates(s1, (struct Eq_83877 *) 0x08, out a0_83, out a3_121, out a4_100, out a5_347);
			s0_126 = (word32) (word16) ((s0_78 >> 16) + a0_83);
		}
		if ((a3->dw0040 & 0x02) != 0x00)
		{
			struct Eq_45035 * a0_101;
			struct Eq_84449 * a5_106;
			me_add_ie_ht_capa(a4_100, out a0_101, out a5_106);
			s1 = a0_101;
			word32 a2_348;
			s0_126 = CONVERT(SLICE(s0_126 + (me_add_ie_ht_oper(a0_101, a5_106, out a2_348, out a3_121) + a0_101), word16, 0), word16, word32);
		}
		int32 a5_132 = a3->dw0040;
		a5_133 = a5_132 & 0x01;
		if ((a5_132 & 0x01) != 0x00)
		{
			word32 t1_349;
			word32 a1_350;
			word32 a2_351;
			word32 a0_144;
			word32 a3_352;
			word32 a4_353;
			word32 a5_354;
			ra = memset(ra, fp + -46, 0x00, 0x0E, out t1_349, out a0_144, out a1_350, out a2_351, out a3_352, out a4_353, out a5_354);
			struct Eq_86706 * a4_169;
			word32 a5_355;
			struct Eq_83833 * a3_168 = co_pack8p(a0_144, fp + -48, (word32 *) 0x09, out a4_169, out a5_355);
			struct Eq_86716 * a5_172 = (word32) a4_169->b0001;
			a4_169->b0001 = (byte) ((char *) a5_172 + 0x0011);
			a5_172->b001A = 0x00;
			a3_168->b0001 = (byte) &a5_172->b001A;
			a3_168->b0002 = (byte) (&a5_172->b001A >> 0x08);
			a3_168->b0003 = (byte) (&a5_172->b001A >> 0x10);
			a3_168->b0004 = (byte) (&a5_172->b001A >> 24);
			(&a5_172->b001A >> 0x10)->b0004 = (byte) (&a5_172->b001A >> 24);
			struct Eq_86765 * a4_194 = (&a5_172->b001A >> 0x10) + 4;
			a4_194->b0001 = (byte) (&a5_172->b001A >> 0x20);
			a4_194->b0002 = (byte) (&a5_172->b001A >> 0x28);
			a4_194->b0003 = (byte) (&a5_172->b001A >> 48);
			(&a5_172->b001A >> 0x28)->b0004 = (byte) (&a5_172->b001A >> 48);
			struct Eq_86799 * a4_205 = (&a5_172->b001A >> 0x28) + 4;
			a4_205->b0001 = (byte) (&a5_172->b001A >> 0x38);
			a4_205->b0002 = (byte) (&a5_172->b001A >> 0x40);
			a4_205->b0003 = (byte) (&a5_172->b001A >> 72);
			s1 = (&a5_172->b001A >> 72)->ptr0014;
			a4_205->b0004 = (byte) (&a5_172->b001A >> 72);
			a4_205->b0005 = (byte) (&a5_172->b001A >> 0x50);
			a4_205->b0006 = (byte) (&a5_172->b001A >> 88);
			a4_205->b0007 = (byte) (&a5_172->b001A >> 96);
			a3_121 = &a5_172->b001A >> 88;
			a5_133 = &a5_172->b001A >> 96;
			s0_126 = (word32) (word16) ((word32) s0_126 + 26);
		}
	}
	s1Out = s1;
	a0Out = s0_126;
	a3Out = a3_121;
	a5Out = a5_133;
	s2Out = a1;
	s3Out = 0x4201A410;
	s4Out = dwArgF4;
	return ra;
}

// 2301DD16: void me_rc_set_rate_req_handler(Register (ptr32 Eq_86865) a1, Stack Eq_2 dwArgB8)
void me_rc_set_rate_req_handler(struct Eq_86865 * a1, Eq_2 dwArgB8)
{
	struct Eq_86867 * s2_15 = (word32) a1->b0000;
	struct Eq_28193 * s0_23 = s2_15->ptr420191E0;
	if (s0_23 != null)
	{
		Eq_27524 s3_29 = (word32) a1->w0002;
		if (s3_29 != 0x0FFFFFFF)
		{
			word32 a0_67;
			struct Eq_86934 * s0_72 = rc_check_fixed_rate_config(s0_23, s3_29, out a0_67);
			if (a0_67 != 0x00)
			{
				ui32 a5_77 = (word32) s0_72->b00AF;
				s0_72->w00C6 = (word16) s3_29;
				s0_72->b00AF = (byte) (a5_77 & -97 | 32);
			}
		}
		else
		{
			s0_23->w00C6 = ~0x00;
			uint32 a2_35 = (word32) s0_23->b00BC;
			Eq_27439 a1_36 = (word32) s0_23->b00BB;
			s0_23->b00AF = (byte) ((word32) s0_23->b00AF & -97);
			word32 s0_130;
			word32 s1_131;
			word32 a1_132;
			word32 a4_133;
			word32 s3_134;
			word32 s5_135;
			word32 s6_136;
			word32 s7_137;
			rc_update_bw_nss_max((word32) s2_15->b420190EB, a1_36, a2_35, dwArgB8, out s0_130, out s1_131, out a1_132, out a4_133, out s3_134, out s5_135, out s6_136, out s7_137);
		}
	}
	else
		assert_err();
}

