pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301DDC4: void me_rc_stats_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void me_rc_stats_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	Eq_2 a0_21;
	byte * s1_30;
	word32 a3_188;
	word32 a4_189;
	word32 a5_190;
	word32 a6_191;
	word32 s2_192;
	word32 a2_187;
	word32 a1_186;
	word32 s0_185;
	word32 s3_193;
	word32 s4_194;
	word32 s8_195;
	ke_msg_alloc(ra, 0x0100040F, a3, 0x00D0, a4, mstatus, dwArg08, out s0_185, out s1_30, out a0_21, out a1_186, out a2_187, out a3_188, out a4_189, out a5_190, out a6_191, out s2_192, out s3_193, out s4_194, out s8_195);
	struct Eq_86994 * a3_39 = (word32) *s1_30;
	Eq_2 s1_112 = a3_39->t420191E0;
	a0_21->u1 = (byte) a3_39;
	Eq_2 s0_106 = a0_21;
	if (s1_112 != 0x00)
	{
		*((word32) a0_21 + 2) = (word16) (word32) *((word32) s1_112 + 0x00C0);
		*((word32) a0_21 + 4100) = (word16) (word32) *((word32) s1_112 + 0x00A4);
		*((word32) a0_21 + 0x00001006) = (word16) (word32) *((word32) s1_112 + 166);
		*((word32) a0_21 + 4104) = *((word32) s1_112 + 0x00A8);
		((word32) a0_21 + 0x0000100C)->u1 = (byte) (word32) *((word32) s1_112 + 0x00B0);
		((word32) a0_21 + 0x0000100D)->u1 = (byte) (word32) *((word32) s1_112 + 0x00AC);
		word32 a1_196;
		word32 a2_197;
		word32 a3_198;
		word32 a4_199;
		word32 a5_200;
		word32 a6_201;
		word32 a7_202;
		memcpy((word32) a0_21 + 16, (word32) s1_112 + 0x007C, 32, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200, out a6_201, out a7_202);
		word32 a1_203;
		word32 a2_204;
		word32 a3_205;
		word32 a4_206;
		word32 a5_207;
		word32 a6_208;
		word32 a7_209;
		memcpy((word32) a0_21 + 48, (word32) s1_112 + 4, 0x0078, out a1_203, out a2_204, out a3_205, out a4_206, out a5_207, out a6_208, out a7_209);
		uint32 s2_122 = 0x00;
		while (s2_122 < (word32) (*((word32) s1_112 + 0x00C0)))
		{
			struct Eq_87104 * a0_101;
			word32 s2_113;
			word32 a3_210;
			word32 s3_211;
			word32 s4_212;
			word32 s8_213;
			s0_106 = rc_calc_tp(s1_112, s2_122 & 0x00FF, dwArg08, out s1_112, out a0_101, out a3_210, out s2_113, out s3_211, out s4_212, out s8_213);
			a0_101->dw0008 = (word32) s0_106 + (s2_113 + 40 << 2);
			s2_122 = (word32) (word16) (s2_113 + 0x01);
		}
	}
	else
		*((word32) a0_21 + 2) = 0x00;
	word32 s1_214;
	word32 a0_215;
	word32 a1_216;
	word32 a2_217;
	word32 a3_218;
	word32 a4_219;
	word32 a5_220;
	word32 s2_221;
	word32 s3_222;
	word32 s4_223;
	word32 s8_224;
	ke_msg_send(s0_106, mstatus, out s1_214, out a0_215, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out s2_221, out s3_222, out s4_223, out s8_224);
	0x00 = dwArg38;
}

// 2301DE92: void me_traffic_ind_req_handler(Register Eq_2 ra, Register (ptr32 Eq_87164) a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus)
void me_traffic_ind_req_handler(Eq_2 ra, struct Eq_87164 * a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus)
{
	struct Eq_87168 * s1_17 = (word32) a1->b0000;
	Eq_2 s3_100 = a3;
	word32 a3_28 = (word32) a1->b0001;
	Eq_2 a4_116 = (char *) s1_17 + 0x420190D0;
	ui32 a5_31 = (word32) s1_17->b42019102;
	if ((word32) a1->b0002 != 0x00)
	{
		ui32 a4_37 = a5_31 & 0x00FB;
		if (a3_28 != 0x00)
			a4_37 = a5_31 | 4;
		s1_17->b42019102 = (byte) a4_37;
		a4_116 = (word32) s1_17->b420191C2;
		if (a4_116 != 0x0F)
		{
l2301DF24:
			word32 a3_208;
			word32 a0_207;
			word32 s4_211;
			word32 s8_212;
			word32 s3_210;
			word32 s2_209;
			word32 s1_206;
			word32 s0_205;
			ke_msg_send_basic(ra, 0x0100040D, s3_100, a4_116, mstatus, s2, out s0_205, out s1_206, out a0_207, out a3_208, out s2_209, out s3_210, out s4_211, out s8_212);
			return;
		}
	}
	else
	{
		ui32 a5_32;
		if (a3_28 != 0x00)
			a5_32 = a5_31 | 1;
		else
			a5_32 = a5_31 & ~0x01;
		s1_17->b42019102 = (byte) a5_32;
	}
	Eq_2 a0_64;
	word32 s0_72;
	word32 s1_73;
	struct Eq_87220 * s2_74;
	word32 s8_195;
	word32 a5_191;
	word32 a6_192;
	word32 s4_194;
	word32 s3_193;
	word32 a1_187;
	word32 a2_188;
	word32 a4_190;
	word32 a3_189;
	ra = ke_msg_alloc(ra, 65, 0x00, 0x04, a4_116, mstatus, dwLoc08, out s0_72, out s1_73, out a0_64, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a6_192, out s2_74, out s3_193, out s4_194, out s8_195);
	struct Eq_87249 * s0_84 = s0_72 + (s1_73 + 432);
	*a0_64 = (word16) (word32) s0_84->w0018;
	*((word32) a0_64 + 3) = (byte) (word32) s0_84->b001A;
	*((word32) a0_64 + 2) = (byte) (word32) s2_74->b0001;
	word32 s4_203;
	word32 s8_204;
	word32 a2_199;
	word32 a3_200;
	word32 s2_202;
	word32 a5_201;
	word32 s1_196;
	word32 a1_198;
	word32 a0_197;
	ke_msg_send(a0_64, mstatus, out s1_196, out a0_197, out a1_198, out a2_199, out a3_200, out a4_116, out a5_201, out s2_202, out s3_100, out s4_203, out s8_204);
	goto l2301DF24;
}

// 2301DF54: void me_sta_del_req_handler(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void me_sta_del_req_handler(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	Eq_2 a0_24;
	byte * s0_32;
	word32 a4_159;
	word32 a3_158;
	word32 a2_157;
	word32 a1_156;
	word32 s1_155;
	word32 a5_160;
	word32 a6_161;
	word32 s2_162;
	word32 s3_163;
	word32 s4_164;
	word32 s8_165;
	Eq_2 ra_113 = ke_msg_alloc(ra, 0x0C, 0x00, 0x01, a4, mstatus, dwArg08, out s0_32, out s1_155, out a0_24, out a1_156, out a2_157, out a3_158, out a4_159, out a5_160, out a6_161, out s2_162, out s3_163, out s4_164, out s8_165);
	a0_24->u1 = (byte) (word32) *s0_32;
	word32 a0_166;
	word32 a1_167;
	word32 a2_168;
	word32 a3_169;
	word32 a5_170;
	word32 s2_171;
	word32 s3_172;
	word32 s4_173;
	word32 s8_174;
	Eq_2 s1_110;
	Eq_2 a4_115;
	if ((word32) *((word32) ke_msg_send(a0_24, mstatus, out s1_110, out a0_166, out a1_167, out a2_168, out a3_169, out a4_115, out a5_170, out s2_171, out s3_172, out s4_173, out s8_174) + 1) != 0x00)
	{
		Eq_2 a0_65;
		byte * s0_73;
		word32 s1_183;
		word32 a1_184;
		word32 a2_185;
		word32 a3_186;
		word32 a4_187;
		word32 a5_188;
		word32 a6_189;
		word32 s2_190;
		word32 s3_191;
		word32 s4_192;
		word32 s8_193;
		ra_113 = ke_msg_alloc(ra_113, 0x01000413, 0x05, 0x02, a4_115, mstatus, dwArg08, out s0_73, out s1_183, out a0_65, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188, out a6_189, out s2_190, out s3_191, out s4_192, out s8_193);
		a0_65->u1 = 0x00;
		*((word32) a0_65 + 1) = (byte) (word32) g_a420190EA[(word32) *s0_73];
		word32 a0_194;
		word32 a1_195;
		word32 a2_196;
		word32 a3_197;
		word32 a5_198;
		word32 s2_199;
		word32 s3_200;
		word32 s4_201;
		word32 s8_202;
		ke_msg_send(a0_65, mstatus, out s1_110, out a0_194, out a1_195, out a2_196, out a3_197, out a4_115, out a5_198, out s2_199, out s3_200, out s4_201, out s8_202);
	}
	word32 s0_175;
	word32 s1_176;
	word32 a0_177;
	word32 a3_178;
	word32 s2_179;
	word32 s3_180;
	word32 s4_181;
	word32 s8_182;
	ke_msg_send_basic(ra_113, 0x0100040A, s1_110, a4_115, mstatus, dwLoc08, out s0_175, out s1_176, out a0_177, out a3_178, out s2_179, out s3_180, out s4_181, out s8_182);
	0x00 = dwArg38;
}

