pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301DFD4: void me_set_control_port_req_handler(Register Eq_2 ra, Register (ptr32 Eq_87488) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void me_set_control_port_req_handler(Eq_2 ra, struct Eq_87488 * a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	struct Eq_87493 * a5_13 = (word32) a1->b0000;
	struct Eq_87498 * a3_26 = (word32) a5_13->b420190EA;
	word32 a5_29 = (word32) ((word32) a1->b0001 != 0x00);
	a5_13->b42019101 = (byte) (a5_29 + 0x01);
	Eq_2 s1_19 = a3;
	Eq_2 a4_33 = (word32) a3_26->b4201AA3E;
	if (a4_33 == 0x00)
	{
		a4_33.u0 = 0x02;
		if (a5_29 == ~0x00)
		{
			Eq_2 a0_41;
			struct Eq_87550 * s0_49;
			word32 s1_133;
			word32 a1_134;
			word32 a2_135;
			word32 a3_136;
			word32 a4_137;
			word32 a5_138;
			word32 a6_139;
			word32 s2_140;
			word32 s3_141;
			word32 s4_142;
			word32 s8_143;
			ra = ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, 0x02, mstatus, dwArg08, out s0_49, out s1_133, out a0_41, out a1_134, out a2_135, out a3_136, out a4_137, out a5_138, out a6_139, out s2_140, out s3_141, out s4_142, out s8_143);
			a0_41->u1 = 0x00;
			*((word32) a0_41 + 1) = (byte) (word32) s0_49->b001A;
			word32 a0_144;
			word32 a1_145;
			word32 a2_146;
			word32 a3_147;
			word32 a5_148;
			word32 s2_149;
			word32 s3_150;
			word32 s4_151;
			word32 s8_152;
			ke_msg_send(a0_41, mstatus, out s1_19, out a0_144, out a1_145, out a2_146, out a3_147, out a4_33, out a5_148, out s2_149, out s3_150, out s4_151, out s8_152);
		}
	}
	word32 s2_129;
	word32 a3_128;
	word32 a0_127;
	word32 s1_126;
	word32 s0_125;
	word32 s3_130;
	word32 s4_131;
	word32 s8_132;
	ke_msg_send_basic(ra, 0x01000405, s1_19, a4_33, mstatus, dwLoc08, out s0_125, out s1_126, out a0_127, out a3_128, out s2_129, out s3_130, out s4_131, out s8_132);
	0x00 = dwArg38;
}

// 2301E064: void me_chan_config_req_handler(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus)
void me_chan_config_req_handler(Eq_2 ra, Eq_2 a1, ptr32 mstatus)
{
	Eq_2 a4_16;
	Eq_2 a3_21;
	word32 a1_64;
	word32 a2_65;
	word32 a5_66;
	word32 a6_67;
	word32 a7_68;
	memcpy(0x4201B004, a1, 0x00FE, out a1_64, out a2_65, out a3_21, out a4_16, out a5_66, out a6_67, out a7_68);
	word32 s0_69;
	word32 s1_70;
	word32 a0_71;
	word32 a3_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	word32 s8_76;
	ke_msg_send_basic(ra, 0x01000403, a3_21, a4_16, mstatus, dwLoc18, out s0_69, out s1_70, out a0_71, out a3_72, out s2_73, out s3_74, out s4_75, out s8_76);
}

// 2301E098: void mm_set_ps_mode_cfm_handler(Register Eq_2 ra, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_set_ps_mode_cfm_handler(Eq_2 ra, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_11;
	Eq_2 a4_13;
	word32 a2_87;
	word32 s2_88;
	ke_state_get(a2, dwArg28, out a0_11, out a2_87, out a4_13, out s2_88);
	Eq_2 s0_10 = a2;
	if (a0_11 == 0x01)
	{
		Eq_2 a1_25 = (word32) g_w4201AFDC;
		if (a1_25 != 0x00FF)
		{
			word32 s1_97;
			word32 a0_98;
			word32 a3_99;
			word32 s2_100;
			word32 s3_101;
			word32 s4_102;
			word32 s8_103;
			ke_msg_send_basic(ra, 0x01000414, a1_25, a4_13, mstatus, dwLoc08, out s0_10, out s1_97, out a0_98, out a3_99, out s2_100, out s3_101, out s4_102, out s8_103);
		}
		word32 s1_89;
		word32 a0_90;
		word32 a1_91;
		word32 a4_92;
		word32 a5_93;
		word32 s2_94;
		word32 s3_95;
		word32 s4_96;
		ke_state_set(s0_10, 0x00, mstatus, out s1_89, out a0_90, out a1_91, out a4_92, out a5_93, out s2_94, out s3_95, out s4_96);
	}
	else
		assert_err();
}

// 2301E0F2: void mm_set_idle_cfm_handler(Register Eq_2 ra, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_set_idle_cfm_handler(Eq_2 ra, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_11;
	Eq_2 a4_13;
	word32 a2_87;
	word32 s2_88;
	ke_state_get(a2, dwArg28, out a0_11, out a2_87, out a4_13, out s2_88);
	Eq_2 s0_10 = a2;
	if (a0_11 == 0x01)
	{
		Eq_2 a1_25 = (word32) g_w4201AFDC;
		if (a1_25 != 0x00FF)
		{
			word32 s1_97;
			word32 a0_98;
			word32 a3_99;
			word32 s2_100;
			word32 s3_101;
			word32 s4_102;
			word32 s8_103;
			ke_msg_send_basic(ra, 0x01000412, a1_25, a4_13, mstatus, dwLoc08, out s0_10, out s1_97, out a0_98, out a3_99, out s2_100, out s3_101, out s4_102, out s8_103);
		}
		word32 s1_89;
		word32 a0_90;
		word32 a1_91;
		word32 a4_92;
		word32 a5_93;
		word32 s2_94;
		word32 s3_95;
		word32 s4_96;
		ke_state_set(s0_10, 0x00, mstatus, out s1_89, out a0_90, out a1_91, out a4_92, out a5_93, out s2_94, out s3_95, out s4_96);
	}
	else
		assert_err();
}

// 2301E14C: void me_config_req_handler(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus)
void me_config_req_handler(Eq_2 ra, Eq_2 a4, Eq_2 s2, ptr32 mstatus)
{
	Eq_2 s1_39;
	Eq_2 s4_42;
	word32 s8_224;
	word32 s2_222;
	word32 s3_223;
	word32 a5_220;
	word32 a6_221;
	word32 a3_218;
	word32 a4_219;
	word32 a1_216;
	word32 a2_217;
	word32 s0_214;
	word32 a0_215;
	Eq_2 ra_37 = ke_msg_alloc(ra, 49, 0x00, 0x01, a4, mstatus, dwLoc08, out s0_214, out s1_39, out a0_215, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out a6_221, out s2_222, out s3_223, out s4_42, out s8_224);
	g_b4201B002 = (byte) (word32) *((word32) s1_39 + 46);
	Eq_2 a4_56;
	word32 a2_226;
	word32 a5_228;
	word32 a7_230;
	word32 a3_227;
	word32 a6_229;
	word32 a1_225;
	memcpy(1107406816, s1_39, 32, out a1_225, out a2_226, out a3_227, out a4_56, out a5_228, out a6_229, out a7_230);
	uint32 a0_73;
	struct Eq_87845 * s0_81;
	struct Eq_87846 * s1_82;
	struct Eq_87847 * s2_83;
	Eq_2 s3_84;
	word32 a3_231;
	word32 s4_232;
	word32 s8_233;
	ke_msg_send_basic(ra_37, 0x01000401, s4_42, a4_56, mstatus, s2, out s0_81, out s1_82, out a0_73, out a3_231, out s2_83, out s3_84, out s4_232, out s8_233);
	if ((word32) s2_83->b002E != 0x00)
	{
		word32 a0_94 = phy_get_nss(a0_73);
		ui32 a5_100 = (word32) s0_81->wFFFFFFE0 >> 1 & 0x01;
		s0_81->t0102 = (byte) (a0_94 + 0x01 >> 1);
		s0_81->b0103 = (byte) a5_100;
	}
	else
		s0_81->t0102.u1 = 0x00;
	s0_81->w0000 = (word16) (word32) s1_82->w002C;
	word32 a5_108 = (word32) s1_82->b0030;
	s0_81->b0104 = (byte) a5_108;
	if (a5_108 != 0x00)
	{
		s0_81->wFFFFFFDC = 0xFF;
		s3_84->u1 = 0x02;
		word32 s1_234;
		word32 a0_235;
		word32 a1_236;
		word32 a2_237;
		word32 a3_238;
		word32 a4_239;
		word32 a5_240;
		word32 s2_241;
		word32 s3_242;
		word32 s4_243;
		word32 s8_244;
		ke_msg_send(s3_84, mstatus, out s1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out s2_241, out s3_242, out s4_243, out s8_244);
		word32 s1_245;
		word32 a0_246;
		word32 a1_247;
		word32 a4_248;
		word32 a5_249;
		word32 s2_250;
		word32 s3_251;
		word32 s4_252;
		ke_state_set(0x05, 0x01, mstatus, out s1_245, out a0_246, out a1_247, out a4_248, out a5_249, out s2_250, out s3_251, out s4_252);
	}
}

