pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301E208: void me_set_ps_disable_req_handler(Register Eq_2 ra, Register (ptr32 Eq_87970) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void me_set_ps_disable_req_handler(Eq_2 ra, struct Eq_87970 * a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18)
{
	Eq_2 s2_126 = a3;
	if ((word32) g_b4201B104 != 0x00)
	{
		word32 a0_26;
		word32 a2_237;
		word32 a4_238;
		ke_state_get(0x05, dwArg18, out a0_26, out a2_237, out a4_238, out s2_126);
		if (a0_26 == 0x01)
			return;
		a4 = g_t4201AFD8;
		word32 a3_37 = (word32) a1->b0000;
		if (a4 != 0x00)
		{
			if (a3_37 != 0x00)
			{
				g_t4201AFD8 = 0x01 << (word32) a1->b0001 | a4;
				goto l2301E228;
			}
		}
		else if (a3_37 == 0x00)
			goto l2301E228;
		struct Eq_88035 * a5_77;
		struct Eq_88036 * s0_75;
		Eq_2 a0_53;
		word32 s2_63;
		struct Eq_88039 * s3_64;
		word32 s0_247;
		word32 s1_248;
		word32 a1_249;
		word32 a2_250;
		word32 a3_251;
		word32 a4_252;
		word32 a5_253;
		word32 a6_254;
		word32 s4_255;
		word32 s8_256;
		ke_msg_alloc(ra, 49, 0x00, 0x01, a4, mstatus, dwLoc08, out s0_247, out s1_248, out a0_53, out a1_249, out a2_250, out a3_251, out a4_252, out a5_253, out a6_254, out s2_63, out s3_64, out s4_255, out s8_256);
		struct Eq_88069 * a4_72 = (word32) s3_64->b0001;
		if ((word32) s3_64->b0000 != 0x00)
		{
			s0_75 = a4_72->ptr0004;
			a5_77 = 0x01 << a4_72 | a4_72;
		}
		else
		{
			s0_75 = a4_72->ptr0004;
			a5_77 = ~(0x01 << a4_72) & a4_72;
		}
		a5_77->ptr0004 = s0_75;
		s0_75->w0008 = (word16) s2_63;
		a0_53->u1 = (byte) ((word32) (a5_77 < (struct Eq_88035 *) 1) << 1);
		Eq_2 s1_99;
		word32 a0_257;
		word32 a1_258;
		word32 a2_259;
		word32 a3_260;
		word32 a4_261;
		word32 a5_262;
		word32 s2_263;
		word32 s3_264;
		word32 s4_265;
		word32 s8_266;
		ke_msg_send(a0_53, mstatus, out s1_99, out a0_257, out a1_258, out a2_259, out a3_260, out a4_261, out a5_262, out s2_263, out s3_264, out s4_265, out s8_266);
		word32 s1_267;
		word32 a0_268;
		word32 a1_269;
		word32 a4_270;
		word32 a5_271;
		word32 s2_272;
		word32 s3_273;
		word32 s4_274;
		ke_state_set(s1_99, 0x01, mstatus, out s1_267, out a0_268, out a1_269, out a4_270, out a5_271, out s2_272, out s3_273, out s4_274);
	}
	else
	{
l2301E228:
		word32 a3_242;
		word32 s3_244;
		word32 a0_241;
		word32 s1_240;
		word32 s4_245;
		word32 s8_246;
		word32 s2_243;
		word32 s0_239;
		ke_msg_send_basic(ra, 0x01000414, s2_126, a4, mstatus, s2, out s0_239, out s1_240, out a0_241, out a3_242, out s2_243, out s3_244, out s4_245, out s8_246);
	}
}

// 2301E2CE: void me_set_active_req_handler(Register Eq_2 ra, Register (ptr32 Eq_88153) a1, Register (ptr32 Eq_2) a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void me_set_active_req_handler(Eq_2 ra, struct Eq_88153 * a1, union Eq_2 * a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18)
{
	word32 a0_21;
	Eq_2 s2_26;
	word32 a2_227;
	word32 a4_228;
	ke_state_get(0x05, dwArg18, out a0_21, out a2_227, out a4_228, out s2_26);
	if (a0_21 == 0x01)
		return;
	Eq_2 a4_31 = *a3;
	word32 a2_32 = (word32) a1->b0000;
	if (a3 != null)
	{
		if (a2_32 == 0x00)
		{
l2301E304:
			struct Eq_88197 ** a5_102;
			struct Eq_88197 * s0_100;
			Eq_2 a0_78;
			word32 s2_88;
			struct Eq_88200 * s3_89;
			word32 s0_229;
			word32 s1_230;
			word32 a1_231;
			word32 a2_232;
			word32 a3_233;
			word32 a4_234;
			word32 a5_235;
			word32 a6_236;
			word32 s4_237;
			word32 s8_238;
			ke_msg_alloc(ra, 0x0022, 0x00, 0x01, a4_31, mstatus, dwLoc08, out s0_229, out s1_230, out a0_78, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235, out a6_236, out s2_88, out s3_89, out s4_237, out s8_238);
			struct Eq_88197 ** a4_97 = (word32) s3_89->b0001;
			if ((word32) s3_89->b0000 != 0x00)
			{
				s0_100 = (struct Eq_88197 *) *a4_97;
				a5_102 = 0x01 << a4_97 | a4_97;
			}
			else
			{
				s0_100 = (struct Eq_88197 *) *a4_97;
				a5_102 = ~(0x01 << a4_97) & a4_97;
			}
			*a5_102 = (struct Eq_88197 **) s0_100;
			s0_100->w0008 = (word16) s2_88;
			a0_78->u1 = (byte) (word32) (a5_102 < (struct Eq_88197 **) 1);
			Eq_2 s1_123;
			word32 a0_239;
			word32 a1_240;
			word32 a2_241;
			word32 a3_242;
			word32 a4_243;
			word32 a5_244;
			word32 s2_245;
			word32 s3_246;
			word32 s4_247;
			word32 s8_248;
			ke_msg_send(a0_78, mstatus, out s1_123, out a0_239, out a1_240, out a2_241, out a3_242, out a4_243, out a5_244, out s2_245, out s3_246, out s4_247, out s8_248);
			word32 s1_249;
			word32 a0_250;
			word32 a1_251;
			word32 a4_252;
			word32 a5_253;
			word32 s2_254;
			word32 s3_255;
			word32 s4_256;
			ke_state_set(s1_123, 0x01, mstatus, out s1_249, out a0_250, out a1_251, out a4_252, out a5_253, out s2_254, out s3_255, out s4_256);
			return;
		}
		*(0x01 << (word32) a1->b0001 | a3) = (union Eq_2 *) a4_31;
	}
	else if (a2_32 != 0x00)
		goto l2301E304;
	word32 s0_257;
	word32 s1_258;
	word32 a0_259;
	word32 a3_260;
	word32 s2_261;
	word32 s3_262;
	word32 s4_263;
	word32 s8_264;
	ke_msg_send_basic(ra, 0x01000412, s2_26, a4_31, mstatus, s2, out s0_257, out s1_258, out a0_259, out a3_260, out s2_261, out s3_262, out s4_263, out s8_264);
}

// 2301E382: void me_sta_add_req_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_26613) s4, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack word32 dwArg0138)
void me_sta_add_req_handler(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, struct Eq_26613 * s4, Eq_2 s7, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, word32 dwArg0138)
{
	word16 wLoc46_502 = SLICE(dwLoc48, word16, 16);
	Eq_2 s2_112;
	struct Eq_10270 * s1_107;
	byte * a0_35;
	word32 a3_679;
	word32 s0_675;
	word32 a2_678;
	word32 s1_676;
	word32 a1_677;
	word32 a4_680;
	word32 a5_681;
	word32 s3_684;
	word32 a6_682;
	word32 s4_685;
	word32 s2_683;
	word32 s8_686;
	Eq_2 ra_42 = ke_msg_alloc(ra, 0x01000408, a3, 0x03, a4, mstatus, dwLoc48, out s0_675, out s1_676, out a0_35, out a1_677, out a2_678, out a3_679, out a4_680, out a5_681, out a6_682, out s2_683, out s3_684, out s4_685, out s8_686);
	struct Eq_42483 * a5_55 = rxu_cntrl_get_pm();
	Eq_2 s0_56 = a5_55->t0040;
	if ((a5_55 & 0x02) != 0x00)
	{
		int32 a5_62 = (word32) *((word32) s0_56 + 22);
		s2_112.u0 = 0x01;
		int32 a5_67 = a5_62 >> 2 & 0x07;
		if (a5_67 > 0x02)
			s2_112 = 0x01 << a5_67 + ~0x02 & 0x00FF;
		s1_107 = (word32) (word16) ((0x01 << (a5_62 & 3) + 0x0D) + ~0x00);
	}
	else
	{
		s2_112.u0 = 0x00;
		s1_107 = null;
	}
	Eq_2 a4_86;
	word32 a3_689;
	word32 a6_691;
	word32 a7_692;
	word32 a5_690;
	word32 a2_688;
	word32 a1_687;
	memcpy(fp + -70, s0_56, 0x06, out a1_687, out a2_688, out a3_689, out a4_86, out a5_690, out a6_691, out a7_692);
	Eq_2 a5_99 = (word32) *((word32) s0_56 + 84);
	Eq_2 dwLoc48_504 = SEQ(wLoc46_502, (word16) s1_107);
	word32 s0_135;
	word32 s4_141;
	word32 a0_154;
	Eq_2 s5_142;
	Eq_2 ra_134 = mm_sta_add(ra_42, s1_107, fp + -80, a0_35, a4_86, (word32) *((word32) *((word32) a5_99 + 80) + 0x0055), s2_112, s7, mstatus, dwLoc50, a5_99, dwLoc48_504, dwLoc28, dwLoc04, dwArg08, dwArg18, 0x00, s9, s1, dwArg58, dwArg78, dwArg98, dwArgB8, out s0_135, out a0_154, out s4_141, out s5_142);
	*((word32) s5_142 + 1) = (byte) a0_154;
	if (a0_154 != 0x00)
	{
l2301E56A:
		word32 s8_703;
		word32 a3_697;
		word32 a5_699;
		word32 s2_700;
		word32 s3_701;
		word32 s4_702;
		word32 a4_698;
		word32 a1_695;
		word32 a2_696;
		word32 s1_693;
		word32 a0_694;
		ke_msg_send(s5_142, mstatus, out s1_693, out a0_694, out a1_695, out a2_696, out a3_697, out a4_698, out a5_699, out s2_700, out s3_701, out s4_702, out s8_703);
		return;
	}
	Eq_2 s9_221;
	struct Eq_88509 * s1_156 = (word32) *s5_142;
	struct Eq_88514 * a5_169;
	word32 a7_709;
	word32 a2_705;
	word32 a3_706;
	word32 a4_707;
	word32 a6_708;
	word32 a1_704;
	memcpy(&s1_156->w420190E8 + 76, s0_135 + 6, 0x0D, out a1_704, out a2_705, out a3_706, out a4_707, out a5_169, out a6_708, out a7_709);
	struct Eq_88535 * s0_181 = a5_169->ptr0040;
	if ((a5_169 & 0x01) != 0x00)
	{
		int32 a5_183 = s1_156->dw420191BC;
		s1_156->dw420191BC = a5_183 | 1;
		s0_181 = (a5_183 | 1)->ptr0040;
		if (((a5_183 | 1) & 0x02) != 0x00 && (word32) g_b4201B002 != 0x00)
		{
			s1_156->dw420191BC = a5_183 | 3;
			word32 a1_713;
			word32 a7_719;
			word32 a3_715;
			word32 a4_716;
			word32 a5_717;
			word32 a6_718;
			word32 a2_714;
			memcpy(&s1_156->w420190E8 + 84, (char *) s0_181 + 20, 32, out a1_713, out a2_714, out a3_715, out a4_716, out a5_717, out a6_718, out a7_719);
			word32 a4_720;
			s9_221 = me_set_sta_ht_vht_param((char *) s1_156 + 0x420190D0, s4_141 + 1107406144, out a4_720);
l2301E46E:
			s1_156->b420191C2 = (byte) (word32) s0_181->b0046;
			s1_156->b420191C3 = (byte) (word32) s0_181->b0047;
			s1_156->w420190E8 = (word16) (word32) s0_181->w0044;
			struct Eq_88668 * a5_265;
			struct Eq_88579 * s8_279;
			word32 s9_280;
			word32 a3_721;
			ptr32 s1_270;
			int32 s3_274;
			word32 s7_278;
			word32 s6_277;
			word32 s4_275;
			Eq_2 ra_268 = me_init_rate(ra_134, (char *) s1_156 + 0x420190D0, s9_221, fflags, frm, mstatus, dwLoc54, s4, dwLoc28, dwArg08, dwArg88, dwArgB8, dwArg0138, out s1_270, out a3_721, out a5_265, out s3_274, out s4_275, out s5_142, out s6_277, out s7_278, out s8_279, out s9_280);
			struct Eq_88566 * s0_288 = a5_265->ptr0040;
			if ((a5_265 & 0x10) != 0x00)
			{
				uint32 a1_290 = (word32) s0_288->b0048;
				if ((int32) (byte) a1_290 >= 0x00)
				{
					word32 a4_711;
					word32 a5_712;
					word32 a1_710;
					ra_268 = me_sta_bw_nss_max_upd((word32) s8_279->b001B, a1_290 & 0x03, a1_290 >> 0x04, dwArg58, out s1_270, out a1_710, out a4_711, out a5_712, out s3_274, out s4_275, out s5_142, out s6_277, out s7_278);
				}
			}
			if (s9_280 != 0x00)
			{
				word32 a4_723;
				word32 a5_724;
				word32 a1_722;
				ra_268 = me_sta_bw_nss_max_upd((word32) (s1_270 + 432 + s3_274)->b001B, 0x00FF, 0x00, dwArg58, out s1_270, out a1_722, out a4_723, out a5_724, out s3_274, out s4_275, out s5_142, out s6_277, out s7_278);
			}
			struct Eq_88691 * a5_355 = s1_270 + 432 + s3_274;
			a5_355->b011A = (byte) ((word32) a5_355->b011A | 16);
			Eq_2 a4_366 = s4_275 + 0x05D8 + s7_278;
			a5_355->b0031 = (byte) ((word32) ((*((word32) a4_366 + 0x05C4) & 0x01) < 1) + 0x01);
			uint32 a3_372 = (word32) *((word32) a4_366 + 844);
			a5_355->w0038 = (word16) (a3_372 >> 8 | a3_372 << 0x08);
			*((word32) s5_142 + 2) = (byte) s6_277;
			if (s6_277 != 0x00)
			{
				a5_355->b001C = (byte) s6_277;
				if ((word32) *((word32) a4_366 + 842) == 0x00)
				{
					Eq_2 a0_397;
					word32 s0_405;
					int32 s2_407;
					ptr32 s3_408;
					word32 s8_733;
					word32 s1_725;
					word32 a6_731;
					word32 s4_732;
					word32 a2_727;
					word32 a3_728;
					word32 a4_729;
					word32 a5_730;
					word32 a1_726;
					ke_msg_alloc(ra_268, 73, 0x0D, 0x02, a4_366, mstatus, dwLoc48_504, out s0_405, out s1_725, out a0_397, out a1_726, out a2_727, out a3_728, out a4_729, out a5_730, out a6_731, out s2_407, out s3_408, out s4_732, out s8_733);
					(s3_408 + s2_407)->b001C = 0x01;
					a0_397->u1 = (byte) s0_405;
					((word32) a0_397 + 1)->u1 = 0x01;
					word32 s2_741;
					word32 s3_742;
					word32 s8_743;
					word32 a4_739;
					word32 a5_740;
					word32 a0_735;
					word32 a1_736;
					word32 a2_737;
					word32 a3_738;
					word32 s1_734;
					ke_msg_send(a0_397, mstatus, out s1_734, out a0_735, out a1_736, out a2_737, out a3_738, out a4_739, out a5_740, out s2_741, out s3_742, out s4_275, out s8_743);
				}
				struct Eq_88776 * s7_439 = s7_278 + (s4_275 + 0x05D8);
				s7_439->b034A = (byte) ((word32) s7_439->b034A + 0x01);
			}
			goto l2301E56A;
		}
	}
	s9_221.u0 = 0x00;
	goto l2301E46E;
}

// 2301E5E2: void cfm_raw_send(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cfm_raw_send(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t23078624, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

