pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301E5EE: void scanu_raw_send_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void scanu_raw_send_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a3_26;
	Eq_2 a4_27;
	Eq_2 a4_51;
	Eq_2 a5_52;
	word32 s1_206;
	word32 a0_207;
	word32 a1_208;
	word32 a2_209;
	word32 a5_210;
	word32 a7_211;
	word32 s2_212;
	word32 s3_213;
	word32 s4_214;
	word32 s5_215;
	word32 s6_216;
	word32 s7_217;
	word32 s8_218;
	word32 s9_219;
	word32 s10_220;
	word32 s11_221;
	word32 t4_222;
	Eq_2 ra_54 = scanu_raw_send_cfm(printf(ra, &g_t23078698, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_206, out a0_207, out a1_208, out a2_209, out a3_26, out a4_27, out a5_210, out a7_211, out s2_212, out s3_213, out s4_214, out s5_215, out s6_216, out s7_217, out s8_218, out s9_219, out s10_220, out s11_221, out t4_222), a3_26, a4_27, mstatus, s2, out a4_51, out a5_52);
	Eq_2 s1_76;
	struct Eq_88973 * a0_81;
	Eq_2 s2_85;
	word32 s0_223;
	word32 a1_224;
	word32 a3_225;
	word32 a4_226;
	word32 a5_227;
	word32 s3_228;
	word32 s4_229;
	word32 s5_230;
	word32 s6_231;
	word32 s7_232;
	word32 s8_233;
	word32 s9_234;
	word32 s10_235;
	word32 s11_236;
	txl_frame_get(ra_54, 0x00, (struct Eq_14556 *) 0x0100, a4_51, a5_52, fflags, frm, mstatus, dwArgE8, dwArg0108, dwArg0128, out s0_223, out s1_76, out a0_81, out a1_224, out a3_225, out a4_226, out a5_227, out s2_85, out s3_228, out s4_229, out s5_230, out s6_231, out s7_232, out s8_233, out s9_234, out s10_235, out s11_236);
	if (a0_81 != null)
	{
		struct Eq_89012 * a4_97;
		word32 a1_237;
		word32 a2_238;
		word32 a3_239;
		word32 a5_240;
		word32 a6_241;
		word32 a7_242;
		memcpy(a0_81->dw0068 + 332, s2_85, s1_76, out a1_237, out a2_238, out a3_239, out a4_97, out a5_240, out a6_241, out a7_242);
		a0_81->b0030 = ~0x00;
		a0_81->dw02CC = 0x2301E5E2;
		struct Eq_89041 * s0_115 = g_ptr2301E64E;
		s0_115->b002F = 0x00;
		s0_115->b005E = 0x00;
		s0_115->b0060 = 0x00;
		s0_115->ptr02D0 = s0_115;
		Eq_2 a5_120 = a4_97->t0014;
		*((char *) &(a4_97 + ((word32) s1_76 - 1) / 24)->t0014 + 4) = (struct Eq_89012 *) a5_120;
		*((word32) s1_76 + 32) = a5_120;
		txl_frame_push_force(ra_54, 0x03, (word32) s1_76 - 1, a5_120, mstatus, dwArg18, dwArg78, dwArgA8, dwArgDC);
	}
}

struct Eq_89041 * g_ptr2301E64E = &g_tF230204;
// 2301E680: void scanu_join_req_handler(Register Eq_2 ra, Register (ptr32 Eq_36534) s0, Register (ptr32 Eq_89079) a1, Register word32 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void scanu_join_req_handler(Eq_2 ra, struct Eq_36534 * s0, struct Eq_89079 * a1, word32 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	g_a4201ADC8[(word32) a1->b014E] = 0x00;
	g_w4201BBAC = (word16) a3;
	g_t4201BBAE.u1 = 0x01;
	Eq_34402 a4_20 = a1->t0140;
	a1->dw0000 = 0x4201BA44;
	g_t4201BBB0 = a4_20;
	g_t4201BBB4 = (word16) (word32) a1->w0144;
	if (((word32) a1->t0140 & 0x01) == 0x00)
		scanu_start(ra, s0, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158);
	else
		assert_err();
}

// 2301E6EE: void scanu_start_req_handler(Register Eq_2 ra, Register (ptr32 Eq_36534) s0, Register (ptr32 Eq_89132) a1, Register word32 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void scanu_start_req_handler(Eq_2 ra, struct Eq_36534 * s0, struct Eq_89132 * a1, word32 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	g_w4201BBAC = (word16) a3;
	g_t4201BBAE.u1 = 0x00;
	Eq_34402 a4_12 = a1->t0140;
	a1->dw0000 = 0x4201BA44;
	g_t4201BBB0 = a4_12;
	g_t4201BBB4 = (word16) (word32) a1->w0144;
	scanu_start(ra, s0, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158);
}

// 2301E720: void rxu_mgt_ind_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 s3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg98)
void rxu_mgt_ind_handler(Eq_2 ra, Eq_2 a1, Eq_2 s3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg98)
{
	scanu_frame_handler(ra, a1, s3, s6, dwArg08, dwArg98);
}

// 2301E726: void scan_done_ind_handler(Register Eq_2 ra, Register ptr32 mstatus)
void scan_done_ind_handler(Eq_2 ra, ptr32 mstatus)
{
	word32 a4_8 = (word32) g_b4201BBAF;
	g_b4201BBAF = (byte) (a4_8 + 0x01);
	scanu_scan_next(ra, a4_8 + 0x01, mstatus);
}

// 2301E748: void scan_start_cfm_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register Eq_2 a4, Register ptr32 mstatus)
void scan_start_cfm_handler(Eq_2 ra, byte * a1, Eq_2 a4, ptr32 mstatus)
{
	if ((word32) *a1 == 0x00)
		return;
	scanu_confirm(ra, a4, mstatus);
}

// 2301E762: void me_set_ps_disable_cfm_handler(Register ptr32 mstatus, Stack Eq_2 dwArg28)
void me_set_ps_disable_cfm_handler(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	word32 s2_107;
	word32 a4_106;
	word32 a2_105;
	ke_state_get(0x06, dwArg28, out a0_7, out a2_105, out a4_106, out s2_107);
	if (a0_7 != 0x04)
	{
		word32 a0_16;
		word32 s2_112;
		word32 a4_111;
		word32 a2_110;
		ke_state_get(0x06, dwArg28, out a0_16, out a2_110, out a4_111, out s2_112);
		if (a0_16 != 0x00)
		{
			word32 a0_24;
			word32 a2_113;
			word32 a4_114;
			word32 s2_115;
			ke_state_get(0x06, dwArg28, out a0_24, out a2_113, out a4_114, out s2_115);
			if (a0_24 != 0x08)
				assert_err();
		}
	}
	word32 a0_40;
	Eq_2 a4_42;
	word32 s2_109;
	word32 a2_108;
	ke_state_get(0x06, dwArg28, out a0_40, out a2_108, out a4_42, out s2_109);
	if (a0_40 == 0x04)
		sm_send_next_bss_param(a4_42, 0x04, mstatus);
}

// 2301E7B6: void mm_bss_param_setting_handler(Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_bss_param_setting_handler(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	Eq_2 a4_9;
	word32 a2_42;
	word32 s2_43;
	ke_state_get(0x06, dwArg28, out a0_7, out a2_42, out a4_9, out s2_43);
	if (a0_7 == 0x04)
		sm_send_next_bss_param(a4_9, 0x04, mstatus);
	else
		assert_err();
}

// 2301E7EA: void sm_rsp_timeout_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0118)
void sm_rsp_timeout_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgB8, Eq_2 dwArg0118)
{
	word32 a0_7;
	word32 a2_131;
	word32 a4_132;
	word32 s2_133;
	ke_state_get(0x06, dwArg28, out a0_7, out a2_131, out a4_132, out s2_133);
	if (a0_7 != 0x05)
	{
		word32 a0_16;
		word32 a2_134;
		word32 a4_135;
		word32 s2_136;
		ke_state_get(0x06, dwArg28, out a0_16, out a2_134, out a4_135, out s2_136);
		if (a0_16 != 0x06)
			return;
	}
	word32 a4_137;
	word32 s2_138;
	word32 s3_139;
	word32 s4_140;
	word32 s10_141;
	sm_connect_ind(ra, s0, s5, s6, mstatus, dwLoc08, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArg0118, out a4_137, out s2_138, out s3_139, out s4_140, out s10_141);
}

