pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301E816: void scanu_start_cfm_handler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg0178)
void scanu_start_cfm_handler(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg0178)
{
	word32 a0_9;
	word32 a2_169;
	word32 a4_170;
	word32 s2_171;
	Eq_2 s1_13 = ke_state_get(0x06, dwArg18, out a0_9, out a2_169, out a4_170, out s2_171);
	if (a0_9 == 0x01)
	{
		Eq_2 a0_25;
		word32 a1_26;
		Eq_2 a4_29;
		Eq_2 s5_41;
		Eq_2 s6_42;
		Eq_2 ra_33 = sm_get_bss_params(ra, s1_13, fp + ~0x17, fp + ~0x13, a3, dwArg10, dwArg14, dwArg5C, dwArgC8, dwArg0178, out a0_25, out a1_26, out a4_29, out s5_41, out s6_42);
		if (a0_25 != 0x00 && a1_26 != 0x00)
			sm_join_bss(ra_33, a0_25, a4_29, mstatus);
		else
		{
			word32 a4_172;
			word32 s2_173;
			word32 s3_174;
			word32 s4_175;
			word32 s10_176;
			sm_connect_ind(ra_33, dwArg24, s5_41, s6_42, mstatus, dwLoc18, dwArg20, dwArg24, dwArg48, ra, dwArgA8, dwArg0108, out a4_172, out s2_173, out s3_174, out s4_175, out s10_176);
		}
	}
	else
		assert_err();
}

// 2301E868: void mm_connection_loss_ind_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0138)
void mm_connection_loss_ind_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg68, Eq_2 dwArgD8, Eq_2 dwArg0138)
{
	word32 a0_15;
	struct Eq_89408 * s2_20;
	word32 a2_133;
	word32 a4_134;
	ke_state_get(0x06, dwArg28, out a0_15, out a2_133, out a4_134, out s2_20);
	if (a0_15 == 0x00 && ((word32) s2_20->b4201AA3E == 0x00 && (word32) s2_20->b4201AA40 != 0x00))
	{
		Eq_2 a4_36;
		word32 s1_135;
		word32 a0_136;
		word32 a1_137;
		word32 a5_138;
		word32 s2_139;
		word32 s3_140;
		word32 s4_141;
		ke_state_set(0x06, 0x08, mstatus, out s1_135, out a0_136, out a1_137, out a4_36, out a5_138, out s2_139, out s3_140, out s4_141);
		word32 a4_142;
		word32 s4_143;
		sm_disconnect_process(ra, a4_36, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg68, dwArgD8, dwArg0138, out a4_142, out s4_143);
	}
	0x00 = dwArg38;
}

// 2301E8BE: void scanu_join_cfm_handler(Register Eq_2 ra, Register Eq_2 s3, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void scanu_join_cfm_handler(Eq_2 ra, Eq_2 s3, word32 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgF8, word32 dwArg0128)
{
	Eq_2 s3_12 = g_t4201BBD8;
	word32 a0_19;
	word32 s2_403;
	word32 a2_401;
	word32 a4_402;
	ke_state_get(0x06, dwArg08, out a0_19, out a2_401, out a4_402, out s2_403);
	byte bLoc21_303 = SLICE(s4, byte, 24);
	if (a0_19 == 0x02)
	{
		struct Eq_89492 * s4_33 = (word32) *((word32) s3_12 + 61);
		if (s4_33->dw4201ADC8 < 0x00)
		{
			word32 s2_133;
			struct Eq_89511 * s3_134;
			word32 s4_135;
			word32 a0_102;
			Eq_2 a4_106;
			Eq_2 s5_114;
			Eq_2 s6_115;
			Eq_2 s0_109 = sm_add_chan_ctx(fp + -33, dwArg58, out a0_102, out a4_106, out s5_114, out s6_115);
			if (a0_102 == 0x00)
			{
				Eq_2 a3_155;
				Eq_2 s2_162;
				struct Eq_89542 * s3_163;
				struct Eq_89543 * s1_181;
				struct Eq_89544 * s3_183;
				word32 s2_417;
				word32 s4_418;
				word32 s8_415;
				word32 a4_416;
				word32 a6_413;
				word32 s4_414;
				word32 a4_411;
				word32 a5_412;
				word32 a1_409;
				word32 a2_410;
				word32 s1_407;
				word32 a0_408;
				word32 s0_406;
				Eq_2 s0_180 = chan_ctxt_link(ke_msg_alloc(ra, 0x0A, 0x00, 32, a4_106, mstatus, dwLoc18, out s0_406, out s1_407, out a0_408, out a1_409, out a2_410, out a3_155, out a4_411, out a5_412, out a6_413, out s2_162, out s3_163, out s4_414, out s8_415), (word32) s3_163->b003D, (word32) bLoc21_303, a3_155, s2_162, mstatus, out s1_181, out a4_416, out s2_417, out s3_183, out s4_418);
				*((word32) s0_180 + 0x0011) = (byte) (word32) s3_183->b003D;
				word32 a3_421;
				word32 a4_422;
				word32 a5_423;
				word32 a6_424;
				word32 a7_425;
				word32 a1_419;
				word32 a2_420;
				memcpy((word32) s0_180 + 0x0A, &s1_181->b035A + 30, 0x06, out a1_419, out a2_420, out a3_421, out a4_422, out a5_423, out a6_424, out a7_425);
				((word32) s0_180 + 18)->u1 = 0x00;
				if ((s1_181->dw03E0 & 0x02) != 0x00)
				{
					int32 a5_208 = (word32) s1_181->b035A;
					ui32 a4_210 = 0x01;
					int32 a5_213 = a5_208 >> 2 & 0x07;
					if (a5_213 > 0x02)
						a4_210 = 0x01 << a5_213 + ~0x02 & 0x00FF;
					((word32) s0_180 + 16)->u1 = (byte) a4_210;
					*((word32) s0_180 + 8) = (word16) ((0x01 << (a5_208 & 3) + 0x0D) + ~0x00);
				}
				*((word32) s0_180 + 4) = 0x00;
				word32 s1_426;
				word32 a0_427;
				word32 a1_428;
				word32 a2_429;
				word32 a3_430;
				word32 a4_431;
				word32 a5_432;
				word32 s2_433;
				word32 s3_434;
				word32 s4_435;
				word32 s8_436;
				ke_msg_send(s0_180, mstatus, out s1_426, out a0_427, out a1_428, out a2_429, out a3_430, out a4_431, out a5_432, out s2_433, out s3_434, out s4_435, out s8_436);
				word32 s1_437;
				word32 a0_438;
				word32 a1_439;
				word32 a4_440;
				word32 a5_441;
				ke_state_set(0x06, 0x03, mstatus, out s1_437, out a0_438, out a1_439, out a4_440, out a5_441, out s2_133, out s3_134, out s4_135);
			}
			else
			{
				word32 s10_405;
				word32 a4_404;
				sm_connect_ind(ra, s0_109, s5_114, s6_115, mstatus, dwLoc28, dwArg10, dwArg14, dwArg38, s3, dwArg98, dwArgF8, out a4_404, out s2_133, out s3_134, out s4_135, out s10_405);
			}
			struct Eq_89729 * a5_269 = s4_135 + 0x05D8 + s2_133;
			a5_269->dw05C4 = s3_134->dw0030;
			if ((s3_134->dw0030 & 0x04) != 0x00)
				a5_269->dw03E0 &= ~0x06;
		}
		else
		{
			Eq_2 a4_41 = (word32) g_b4201BBE8;
			if (a4_41 != 0x00)
				sm_join_bss(ra, (char *) s4_33 + 1107406176, a4_41, mstatus);
			else
			{
				word32 a4_442;
				word32 s2_443;
				word32 s3_444;
				word32 s4_445;
				word32 s10_446;
				sm_connect_ind(ra, 1107409880, s5, s6, mstatus, dwLoc28, dwArg10, dwArg14, dwArg38, s3, dwArg98, dwArgF8, out a4_442, out s2_443, out s3_444, out s4_445, out s10_446);
			}
		}
		0x00 = dwArg0128;
	}
	else
		assert_err();
}

// 2301EA0A: void sm_connect_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB8, Stack word32 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack word32 dwArg0168)
void sm_connect_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgB8, word32 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128, word32 dwArg0168)
{
	word32 a0_30;
	Eq_2 a4_32;
	word32 a2_596;
	word32 s2_597;
	ke_state_get(0x06, dwArg08, out a0_30, out a2_596, out a4_32, out s2_597);
	if (a0_30 == 0x08)
	{
l2301EB48:
		0x00 = dwArg0128;
		return;
	}
	word32 a5_103;
	Eq_2 a0_45;
	struct Eq_89788 * s0_53;
	struct Eq_89789 * s3_56;
	word32 s1_598;
	word32 a1_599;
	word32 a3_601;
	word32 a2_600;
	word32 a5_603;
	word32 a4_602;
	word32 s2_605;
	word32 a6_604;
	word32 s8_607;
	word32 s4_606;
	Eq_2 ra_52 = ke_msg_alloc(ra, 33552385, a3, 0x01, a4_32, mstatus, dwLoc18, out s0_53, out s1_598, out a0_45, out a1_599, out a2_600, out a3_601, out a4_602, out a5_603, out a6_604, out s2_605, out s3_56, out s4_606, out s8_607);
	word32 a0_65;
	word32 a4_609;
	word32 a2_608;
	word32 s2_610;
	ke_state_get(0x06, dwArg08, out a0_65, out a2_608, out a4_609, out s2_610);
	Eq_2 s4_249 = a0_45;
	if (a0_65 != 0x00)
	{
		a5_103 = 0x08;
		goto l2301EB3E;
	}
	word32 a3_78 = (word32) s0_53->b003B;
	Eq_2 a4_136 = (word32) s3_56->b4201AA3E;
	if (a4_136 == 0x00)
	{
		a4_136 = (word32) s3_56->b4201AA40;
		if (a4_136 == 0x00)
		{
			a4_136.u0 = 0x02;
			if (a3_78 != 0x02)
			{
				a4_136 = (word32) s3_56->b4201AA48;
				if (a4_136 != 0x00FF)
					assert_err();
				if (s3_56->dw4201AA28 != 0x00)
					assert_err();
			}
l2301EA82:
			Eq_2 a5_107 = g_t4201BBD8;
			if (a5_107 != 0x00)
				assert_err();
			s0_53->dw0000 = (word32) *((word32) a5_107 + 4);
			if (a5_107 != 0x00)
				assert_err();
			word32 a1_622;
			word32 a2_623;
			word32 a5_625;
			word32 a4_624;
			word32 a6_626;
			word32 s2_627;
			word32 s4_629;
			word32 s3_628;
			struct Eq_89909 * a0_140;
			Eq_2 a3_143;
			struct Eq_89911 * s0_148;
			Eq_2 s1_149;
			word32 s8_630;
			Eq_2 ra_147 = ke_msg_alloc(ra_52, 0x01FFF802, a3, 852, a4_136, mstatus, dwLoc18, out s0_148, out s1_149, out a0_140, out a1_622, out a2_623, out a3_143, out a4_624, out a5_625, out a6_626, out s2_627, out s3_628, out s4_629, out s8_630);
			a0_140->t0004 = s1_149;
			*(union Eq_2 *) 0x13 = s1_149;
			((word32) s1_149 + 0x0011)->u1 = 0x00;
			word32 a2_631;
			Eq_2 a3_170;
			Eq_2 s1_174;
			word32 s2_177;
			word32 a4_632;
			word32 a5_633;
			word32 a7_634;
			word32 s3_635;
			word32 s4_636;
			word32 s5_637;
			word32 s6_638;
			word32 s7_639;
			word32 s8_640;
			word32 s9_641;
			word32 s10_642;
			word32 s11_643;
			word32 t4_644;
			Eq_2 a0_165;
			word32 a1_168;
			Eq_2 ra_173 = printf(ra_147, &g_t230788EC, a3_143, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_174, out a0_165, out a1_168, out a2_631, out a3_170, out a4_632, out a5_633, out a7_634, out s2_177, out s3_635, out s4_636, out s5_637, out s6_638, out s7_639, out s8_640, out s9_641, out s10_642, out s11_643, out t4_644);
			if ((word32) s0_148->b003B == 0x02)
			{
				word32 a1_283 = (word32) s0_148->b003D;
				((word32) s1_174 + 0x0011)->u1 = 0x01;
				word32 a1_645;
				word32 a2_646;
				word32 a3_647;
				word32 a4_648;
				word32 a5_649;
				word32 a6_650;
				word32 a7_651;
				memcpy(1107409904, a1_283 + 1552 + s2_177, 0x06, out a1_645, out a2_646, out a3_647, out a4_648, out a5_649, out a6_650, out a7_651);
				Eq_2 a4_310;
				word32 s1_652;
				word32 a0_653;
				word32 a1_654;
				word32 a5_655;
				word32 s2_656;
				word32 s3_657;
				word32 s4_658;
				ke_state_set(0x06, 0x08, mstatus, out s1_652, out a0_653, out a1_654, out a4_310, out a5_655, out s2_656, out s3_657, out s4_658);
				word32 a4_659;
				sm_disconnect_process(ra_173, a4_310, mstatus, s6, dwLoc18, dwLoc08, dwArg08, dwArg48, dwArgB8, dwArg0118, out a4_659, out s4_249);
			}
			else
			{
				Eq_2 a4_189 = (word32) s0_148->w0028;
				if (a4_189 == 0x0FFFFFFF)
				{
					word32 s5_660;
					word32 s6_661;
					ra_173 = sm_get_bss_params(ra_173, s1_174, fp + -40, fp + -36, a3_170, dwArg00, dwArg04, dwArg4C, dwArgB8, dwArg0168, out a0_165, out a1_168, out a4_189, out s5_660, out s6_661);
				}
				if (a0_165 != 0x00 && a1_168 != 0x00)
					s4_249 = sm_join_bss(ra_173, a0_165, a4_189, mstatus);
				else
					s4_249 = sm_scan_bss(ra_173, a4_189, mstatus, dwArgF8);
			}
			a5_103 = 0x00;
l2301EB3E:
			s4_249->u1 = (byte) a5_103;
			word32 s4_620;
			word32 s8_621;
			word32 s2_618;
			word32 s3_619;
			word32 a4_616;
			word32 a5_617;
			word32 a2_614;
			word32 a3_615;
			word32 a0_612;
			word32 a1_613;
			word32 s1_611;
			ke_msg_send(s4_249, mstatus, out s1_611, out a0_612, out a1_613, out a2_614, out a3_615, out a4_616, out a5_617, out s2_618, out s3_619, out s4_620, out s8_621);
			goto l2301EB48;
		}
	}
	if (a3_78 != 0x02)
	{
		a5_103 = 0x09;
		goto l2301EB3E;
	}
	goto l2301EA82;
}

// 2301EBF8: void rxu_mgt_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register (ptr32 byte) s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack word32 dwArg0148, Stack word32 dwArg0188)
void rxu_mgt_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s10, byte * s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, word32 dwArg0148, word32 dwArg0188)
{
	ui32 a5_5 = (word32) *((word32) a1 + 2);
	if ((a5_5 & 252) != 0x00B0)
	{
		if ((a5_5 & 252) != 0x10 && (a5_5 & 252) != 48)
		{
			if ((a5_5 & 252) != 0x00C0 && (a5_5 & 252) != 0x00A0)
				return;
			word32 a0_21;
			Eq_2 s2_26;
			word32 a4_349;
			word32 a2_348;
			ke_state_get(0x06, dwArg28, out a0_21, out a2_348, out a4_349, out s2_26);
			if (a0_21 != 0x00)
				return;
			sm_deauth_handler(ra, a3, s2_26, s5, s6, mstatus, dwArg08, dwArg18, dwArg20, dwArg24, dwArg48, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgA8, dwArgC8, dwArg0108, dwArg0128);
		}
		else
		{
			word32 a0_73;
			word32 s2_347;
			word32 a4_346;
			word32 a2_345;
			Eq_2 s1_77 = ke_state_get(0x06, dwArg28, out a0_73, out a2_345, out a4_346, out s2_347);
			if (a0_73 == 0x06)
				sm_assoc_rsp_handler(ra, a1, s1_77, a1, s7, s9, fflags, frm, mstatus, dwLoc10, s0, dwArg18, dwArg20, dwArg24, dwArg38, dwArg6C, dwArg78, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0188);
		}
	}
	else
	{
		word32 a0_122;
		word32 s2_344;
		word32 a4_343;
		word32 a2_342;
		Eq_2 s1_126 = ke_state_get(0x06, dwArg28, out a0_122, out a2_342, out a4_343, out s2_344);
		if (a0_122 == 0x05)
			sm_auth_handler(ra, a1, s1_126, a1, s5, s6, s7, s9, s10, s11, fflags, frm, mstatus, dwLoc10, s0, dwLoc08, dwArg08, dwArg18, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0188);
	}
}

// 2301EC72: void mm_set_vif_state_cfm_handler(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0108)
void mm_set_vif_state_cfm_handler(Eq_2 ra, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArgA8, Eq_2 dwArg0108)
{
	word32 a0_17;
	Eq_2 a4_19;
	word32 s2_275;
	word32 a2_274;
	ke_state_get(0x06, dwArg18, out a0_17, out a2_274, out a4_19, out s2_275);
	if (a0_17 == 0x07)
	{
		Eq_2 a0_40;
		struct Eq_90236 * s1_49;
		word32 a4_280;
		word32 a5_281;
		word32 a3_279;
		word32 a2_278;
		word32 a1_277;
		word32 s0_276;
		word32 a6_282;
		word32 s2_283;
		word32 s3_284;
		word32 s4_285;
		word32 s8_286;
		Eq_2 ra_107 = ke_msg_alloc(ra, 75, 0x00, 0x06, a4_19, mstatus, dwLoc08, out s0_276, out s1_49, out a0_40, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a6_282, out s2_283, out s3_284, out s4_285, out s8_286);
		((word32) a0_40 + 4)->u1 = (byte) (word32) s1_49->b003A;
		*((word32) a0_40 + 2) = (word16) (word32) s1_49->w0038;
		a0_40->u1 = (byte) (word32) s1_49->b003D;
		struct Eq_90292 * s1_71;
		struct Eq_90293 * s3_73;
		struct Eq_90294 * s4_74;
		word32 a0_287;
		word32 a1_288;
		word32 a2_289;
		word32 a3_290;
		word32 a4_291;
		word32 a5_292;
		word32 s8_293;
		word32 s2_129;
		Eq_2 s0_127 = ke_msg_send(a0_40, mstatus, out s1_71, out a0_287, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out s2_129, out s3_73, out s4_74, out s8_293);
		word32 a5_85 = (word32) ((s3_73->dw05C4 & 0x01) < 1);
		s4_74->b42019101 = (byte) (a5_85 + 0x01);
		uint32 a3_89 = (word32) s1_71->w0034;
		s4_74->w42019108 = (word16) (a3_89 >> 8 | a3_89 << 0x08);
		if (a5_85 == ~0x00)
		{
			Eq_2 a0_100;
			struct Eq_90360 * s1_109;
			word32 s0_294;
			word32 a1_295;
			word32 a2_296;
			word32 a3_297;
			word32 a4_298;
			word32 a5_299;
			word32 a6_300;
			word32 s2_301;
			word32 s3_302;
			word32 s4_303;
			word32 s8_304;
			ra_107 = ke_msg_alloc(ra_107, 0x01000413, 0x05, 0x02, 0x02, mstatus, dwLoc08, out s0_294, out s1_109, out a0_100, out a1_295, out a2_296, out a3_297, out a4_298, out a5_299, out a6_300, out s2_301, out s3_302, out s4_303, out s8_304);
			a0_100->u1 = 0x00;
			*((word32) a0_100 + 1) = (byte) (word32) s1_109->b003D;
			word32 s1_305;
			word32 a0_306;
			word32 a1_307;
			word32 a2_308;
			word32 a3_309;
			word32 a4_310;
			word32 a5_311;
			word32 s3_312;
			word32 s4_313;
			word32 s8_314;
			s0_127 = ke_msg_send(a0_100, mstatus, out s1_305, out a0_306, out a1_307, out a2_308, out a3_309, out a4_310, out a5_311, out s2_129, out s3_312, out s4_313, out s8_314);
		}
		Eq_2 s0_142 = (word32) s0_127 + (s2_129 + 0x05D8);
		if ((*((word32) s0_142 + 1000) & 0x12FFF800) == 0x00)
		{
			word32 a4_315;
			word32 s2_316;
			word32 s3_317;
			word32 s4_318;
			word32 s10_319;
			sm_connect_ind(ra_107, s0_142, s5, s6, mstatus, s2, dwArg20, dwArg24, dwArg48, ra, dwArgA8, dwArg0108, out a4_315, out s2_316, out s3_317, out s4_318, out s10_319);
		}
	}
}

// 2301ED64: void me_set_active_cfm_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register (ptr32 byte) s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0178)
void me_set_active_cfm_handler(Eq_2 ra, Eq_2 a3, Eq_2 s5, Eq_2 s7, Eq_2 s9, Eq_2 s10, byte * s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0178)
{
	word32 a0_7;
	word32 s2_295;
	word32 a4_294;
	word32 a2_293;
	ke_state_get(0x06, dwArg18, out a0_7, out a2_293, out a4_294, out s2_295);
	if (a0_7 != 0x04)
	{
		word32 a0_16;
		word32 a2_298;
		word32 a4_299;
		word32 s2_300;
		ke_state_get(0x06, dwArg18, out a0_16, out a2_298, out a4_299, out s2_300);
		if (a0_16 != 0x08)
			assert_err();
	}
	word32 a0_32;
	Eq_2 s2_37;
	word32 a4_297;
	word32 a2_296;
	Eq_2 s1_36 = ke_state_get(0x06, dwArg18, out a0_32, out a2_296, out a4_297, out s2_37);
	word32 a5_42 = (word32) g_b4201BBE9;
	if (a0_32 == 0x08)
	{
		if (a5_42 != 0x00)
		{
			Eq_2 a0_139;
			Eq_2 a4_143;
			word32 a1_309;
			word32 s5_310;
			word32 s6_311;
			sm_join_bss(sm_get_bss_params(ra, s1_36, fp + ~0x17, fp + ~0x13, a3, dwArg10, dwArg14, dwArg5C, dwArgC8, dwArg0178, out a0_139, out a1_309, out a4_143, out s5_310, out s6_311), a0_139, a4_143, mstatus);
		}
		else
		{
			word32 s1_301;
			word32 a0_302;
			word32 a1_303;
			word32 a4_304;
			word32 a5_305;
			word32 s2_306;
			word32 s3_307;
			word32 s4_308;
			ke_state_set(0x06, 0x00, mstatus, out s1_301, out a0_302, out a1_303, out a4_304, out a5_305, out s2_306, out s3_307, out s4_308);
		}
	}
	else if (a5_42 != 0x00)
		sm_assoc_req_send(ra, 0x08, s2_37, s7, s9, s10, s11, fflags, frm, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg48, dwArg58, dwArg68, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178);
	else
		sm_auth_send(ra, 0x01, 0x00, s5, fflags, frm, mstatus, dwLoc18, dwArg20, dwArg24, dwArg48, dwArg58, dwArg68, ra, dwArg9C, dwArgA8, dwArgB8, dwArgC4, dwArgD8, dwArgF8, dwArg0108);
}

