pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301EDEC: void mm_sta_add_cfm_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108)
void mm_sta_add_cfm_handler(Eq_2 ra, Eq_2 a1, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0108)
{
	word32 a0_21;
	word32 a2_261;
	word32 a4_262;
	word32 s2_263;
	ke_state_get(0x06, dwArg18, out a0_21, out a2_261, out a4_262, out s2_263);
	if (a0_21 == 0x03)
	{
		if ((word32) *a1 == 0x00)
		{
			struct Eq_90614 * s4_66 = (word32) *((word32) a1 + 1);
			struct Eq_90619 * s1_77 = (word32) s4_66->b420190EA;
			word32 a1_269;
			word32 a2_270;
			word32 a3_271;
			word32 a4_272;
			word32 a5_273;
			word32 a6_274;
			word32 a7_275;
			memcpy(&s4_66->b420190EA + 0x0096, (char *) s1_77 + 1107406232, 0x0D, out a1_269, out a2_270, out a3_271, out a4_272, out a5_273, out a6_274, out a7_275);
			int32 a5_96 = s1_77->dw4201ADC8;
			Eq_2 a4_140 = a5_96 & 1;
			if ((a5_96 & 1) != 0x00)
			{
				int32 a4_98 = s4_66->dw420191BC;
				s4_66->dw420191BC = a4_98 | 1;
				a4_140 = a4_98 | 1;
			}
			if ((a5_96 & 0x02) != 0x00)
			{
				s4_66->dw420191BC |= 2;
				word32 a1_276;
				word32 a2_277;
				word32 a3_278;
				word32 a4_279;
				word32 a5_280;
				word32 a6_281;
				word32 a7_282;
				memcpy(&s4_66->b420190EA + 166, (char *) s1_77 + 1107406144, 32, out a1_276, out a2_277, out a3_278, out a4_279, out a5_280, out a6_281, out a7_282);
				me_set_sta_ht_vht_param((char *) s4_66 + 0x420190D0, (char *) s1_77 + 1107406144, out a4_140);
			}
			sm_set_bss_param(ra, a4_140, mstatus, dwArgD8, dwArg0108);
		}
		else
		{
			word32 a4_264;
			word32 s3_266;
			word32 s2_265;
			word32 s4_267;
			word32 s10_268;
			sm_connect_ind(ra, a1, s5, s6, mstatus, s2, dwArg20, dwArg24, dwArg48, ra, dwArgA8, dwArg0108, out a4_264, out s2_265, out s3_266, out s4_267, out s10_268);
		}
	}
	else
		assert_err();
}

// 2301EEE2: void sm_disconnect_req_handler(Register Eq_2 ra, Register (ptr32 Eq_90709) a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack word32 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void sm_disconnect_req_handler(Eq_2 ra, struct Eq_90709 * a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg88, word32 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 a0_11;
	word32 a2_141;
	word32 a4_142;
	word32 s2_143;
	Eq_2 s1_15 = ke_state_get(0x06, dwArg28, out a0_11, out a2_141, out a4_142, out s2_143);
	if (a0_11 == 0x00)
	{
		Eq_2 a4_35;
		word32 s0_144;
		word32 s1_145;
		word32 a0_146;
		word32 a3_147;
		word32 s2_148;
		word32 s3_149;
		word32 s4_150;
		word32 s8_151;
		ke_msg_send_basic(sm_disconnect(ra, s1_15, (word32) a1->b0002, (word32) a1->w0000, fflags, frm, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg68, dwArg88, dwArg98, dwArgBC, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a4_35), 33552388, 0x0D, a4_35, mstatus, dwLoc08, out s0_144, out s1_145, out a0_146, out a3_147, out s2_148, out s3_149, out s4_150, out s8_151);
	}
}

// 2301EF1A: void apm_sta_connect_timeout_ind_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void apm_sta_connect_timeout_ind_handler(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	word32 a5_155;
	Eq_2 s4_105 = xTaskGetTickCount(out a5_155);
	struct Eq_90785 * s1_21 = &g_t42018F20;
	ui32 s0_22 = 0x00;
	int32 s2_106 = 0x07000530;
	ui32 s3_24 = 0x0C;
	do
	{
		int32 a5_27 = s1_21->dw01A8;
		if (a5_27 != 0x00 && s2_106 < s4_105 - a5_27)
			ra = apm_sta_fw_delete(ra, a4, mstatus, s1, dwArgD8, out s0_22, out s1_21, out a3, out a4, out s2_106, out s3_24, out s4_105);
		ui32 s0_60 = s0_22 + 0x01;
		s0_22 = s0_60 & 0x00FF;
		++s1_21;
	} while ((s0_60 & 0x00FF) != s3_24);
	ke_timer_set(ra, 0x01FFFC0A, 0x07, 5000000, a3, a4, mstatus, dwLoc08, dwArg88, dwArgE8);
}

// 2301EF88: void rxu_mgt_ind_handler(Register Eq_2 ra, Register (ptr32 Eq_45301) a1, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void rxu_mgt_ind_handler(Eq_2 ra, struct Eq_45301 * a1, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	ui32 a5_7 = (word32) a1->w0002;
	if ((a5_7 & 252) != 64)
	{
		Eq_2 a4_11 = 0x00B0;
		if ((a5_7 & 252) != 0x00B0)
		{
			word32 a1_12 = 0x00;
			if ((a5_7 & 252) != 0x00)
			{
				a4_11.u0 = 32;
				if ((a5_7 & 252) != 32)
				{
					if ((a5_7 & 252) == 0x00C0)
						apm_deauth_handler(ra, a1, mstatus, dwArg78, dwArgE8);
					else if ((a5_7 & 252) == 0x00A0)
						apm_disassoc_handler(ra, a1, 0x00A0, fflags, frm, mstatus, dwArg28, dwArg58, dwArg64, dwArg78, dwArgA8, dwArgC8, dwArgD4, dwArgDC, dwArgE8, dwArg0108, dwArg0118, dwArg0158);
					else if ((a5_7 & 252) == 0x0080)
						apm_beacon_handler();
					return;
				}
				a1_12 = 0x01;
			}
			apm_assoc_req_handler(ra, a1, a1_12, a4_11, s10, fflags, frm, mstatus, dwArg04, dwArg18, dwArg48, dwArg68, ra, dwArg7C, dwArg88, dwArgA8, dwArgB8, dwArgF8);
		}
		else
			apm_auth_handler(ra, a1, fflags, frm, mstatus, dwArg00, dwArg28, dwArg68, dwArg78, dwArgA8, dwArgC8, dwArgD4, dwArgD8, dwArgDC, dwArgE8, dwArg0108, dwArg0118, dwArg0158);
	}
	else
		apm_probe_req_handler(ra, a1, fflags, frm, mstatus, dwArg28, dwArg78, dwArgA8, dwArgC8, dwArgD4, dwArgDC, dwArgE8, dwArg0108, dwArg0118, dwArg0158);
}

// 2301EFF6: void apm_sta_add_cfm_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 byte) a1, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
void apm_sta_add_cfm_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, byte * a1, Eq_2 a3, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	Eq_2 a4_5 = g_t4201B9C4;
	word32 a0_10 = (word32) *a1;
	if (a4_5 != 0x00)
	{
		*((word32) a4_5 + 1) = (byte) a0_10;
		SendEAPOLMsgUsingBufDesc(ra, s0, s1, g_t4201B9C4, a3, fflags, frm, mstatus, dwLoc08, dwArg14, dwArg18, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0148);
	}
	else
	{
		word32 a4_128;
		apm_sta_add(ra, a4_5, mstatus, dwLoc08, dwArg28, out a4_128);
	}
}

// 2301F024: void apm_sta_del_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void apm_sta_del_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	Eq_2 a0_19;
	struct Eq_90973 * s1_28;
	word32 s8_180;
	word32 s4_179;
	word32 s3_178;
	word32 s2_177;
	word32 a6_176;
	word32 a5_175;
	word32 a4_174;
	word32 a3_173;
	word32 a2_172;
	word32 a1_171;
	word32 s0_170;
	Eq_2 ra_26 = ke_msg_alloc(ra, 0x01FFFC0C, a3, 0x03, a4, mstatus, dwArg08, out s0_170, out s1_28, out a0_19, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out a6_176, out s2_177, out s3_178, out s4_179, out s8_180);
	struct Eq_46396 * a0_38 = (word32) s1_28->b0000;
	Eq_2 s0_37 = a0_19;
	if ((word32) a0_38->b4201AA3E == 0x02)
	{
		up32 a1_46 = (word32) s1_28->b0001;
		if (a1_46 <= 0x0C)
		{
			s0_37 = apm_sta_remove(ra_26, a0_38, a1_46, fflags, frm, mstatus, dwArg18, dwArg54, dwArg68, dwArg78, dwArg98, dwArgB8, dwArgC4, dwArgCC, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0148);
			s0_37->u1 = 0x00;
l2301F070:
			word32 s1_181;
			word32 a0_182;
			word32 a1_183;
			word32 a2_184;
			word32 a3_185;
			word32 a4_186;
			word32 a5_187;
			word32 s2_188;
			word32 s3_189;
			word32 s4_190;
			word32 s8_191;
			ke_msg_send(s0_37, mstatus, out s1_181, out a0_182, out a1_183, out a2_184, out a3_185, out a4_186, out a5_187, out s2_188, out s3_189, out s4_190, out s8_191);
			return;
		}
	}
	a0_19->u1 = ~0x00;
	goto l2301F070;
}

// 2301F08A: void apm_stop_cac_req_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0148)
void apm_stop_cac_req_handler(Eq_2 ra, Eq_2 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArg0148)
{
	struct Eq_91066 * a4_11 = (word32) *a1;
	Eq_2 s1_13 = a3;
	Eq_2 a3_19 = (word32) a4_11->b4201AA3E;
	Eq_2 a4_20 = 0x02;
	if (a3_19 == 0x02 && (word32) a4_11->b4201AA40 == 0x00)
	{
		word32 a0_26;
		word32 a2_133;
		word32 s2_134;
		s1_13 = ke_state_get(0x07, dwArg18, out a0_26, out a2_133, out a4_20, out s2_134);
		if (a0_26 == 0x00)
		{
			struct Eq_91119 * a4_40;
			word32 s6_135;
			word32 s10_136;
			ra = chan_ctxt_unlink(ra, a1, (word32) *a1, a3_19, mstatus, dwLoc18, dwArg08, dwArg18, dwArg78, dwArgE8, dwArg0148, out s1_13, out a4_40, out s6_135, out s10_136);
			__csrrc(mstatus, 0x08);
			(a4_40 & ~0x10)->dw0004 = a4_40->dw0004;
			__csrrs(mstatus, 0x08);
			a4_20 = a4_40 & ~0x10;
		}
	}
	word32 s0_125;
	word32 s1_126;
	word32 a0_127;
	word32 a3_128;
	word32 s2_129;
	word32 s3_130;
	word32 s4_131;
	word32 s8_132;
	ke_msg_send_basic(ra, 33553415, s1_13, a4_20, mstatus, dwLoc18, out s0_125, out s1_126, out a0_127, out a3_128, out s2_129, out s3_130, out s4_131, out s8_132);
}

// 2301F100: void apm_conf_max_sta_req_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register Eq_2 a3, Register ptr32 mstatus)
void apm_conf_max_sta_req_handler(Eq_2 ra, byte * a1, Eq_2 a3, ptr32 mstatus)
{
	Eq_2 a4_10 = (word32) *a1;
	if (a4_10 > 0x0C)
		a4_10.u0 = 0x0C;
	g_b4201BC0F = (byte) a4_10;
	word32 s0_50;
	word32 s1_51;
	word32 a0_52;
	word32 a3_53;
	word32 s2_54;
	word32 s3_55;
	word32 s4_56;
	word32 s8_57;
	ke_msg_send_basic(ra, 33553422, a3, a4_10, mstatus, dwLoc08, out s0_50, out s1_51, out a0_52, out a3_53, out s2_54, out s3_55, out s4_56, out s8_57);
}

// 2301F130: void apm_start_cac_req_handler(Register Eq_2 ra, Register (ptr32 Eq_91183) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg78, Stack word32 dwArg0128)
void apm_start_cac_req_handler(Eq_2 ra, struct Eq_91183 * a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg78, word32 dwArg0128)
{
	struct Eq_91189 * a4_15 = (word32) a1->b0011;
	Eq_2 s2_17 = a3;
	Eq_2 a3_27 = (word32) a4_15->b4201AA3E;
	Eq_2 a4_103 = 0x02;
	if (a3_27 == 0x02)
	{
		if ((word32) a4_15->b4201AA40 != 0x00)
		{
l2301F16C:
			goto l2301F16E;
		}
		word32 a0_32;
		word32 a2_212;
		ke_state_get(0x07, dwArg08, out a0_32, out a2_212, out a4_103, out s2_17);
		if (a0_32 != 0x00)
			goto l2301F16C;
		word32 a0_51;
		word32 s1_213;
		word32 s3_214;
		word32 s5_215;
		word32 s6_216;
		Eq_2 s0_56 = chan_ctxt_add(fp + -44, fp + -45, a4_103, dwArg78, out s1_213, out a0_51, out a4_103, out s2_17, out s3_214, out s5_215, out s6_216);
		if (a0_51 == 0x00)
		{
			struct Eq_91307 * a4_75;
			word32 s1_217;
			word32 s3_218;
			word32 s4_219;
			chan_ctxt_link(ra, (word32) *((word32) s0_56 + 0x0011), null, a3_27, s2_17, mstatus, out s1_217, out a4_75, out s2_17, out s3_218, out s4_219);
			__csrrc(mstatus, 0x08);
			(a4_75 | 16)->dw0004 = a4_75->dw0004;
			__csrrs(mstatus, 0x08);
			a4_103 = a4_75 | 16;
		}
	}
l2301F16E:
	Eq_2 a0_109;
	word32 s1_118;
	word32 s3_198;
	word32 s4_199;
	word32 a6_196;
	word32 s2_197;
	word32 a4_194;
	word32 a5_195;
	word32 a2_192;
	word32 a3_193;
	word32 s0_190;
	word32 a1_191;
	word32 s8_200;
	ke_msg_alloc(ra, 33553413, s2_17, 0x02, a4_103, mstatus, dwLoc18, out s0_190, out s1_118, out a0_109, out a1_191, out a2_192, out a3_193, out a4_194, out a5_195, out a6_196, out s2_197, out s3_198, out s4_199, out s8_200);
	a0_109->u1 = (byte) s1_118;
	((word32) a0_109 + 1)->u1 = 0x00;
	word32 s1_201;
	word32 a0_202;
	word32 a1_203;
	word32 a2_204;
	word32 a3_205;
	word32 a4_206;
	word32 a5_207;
	word32 s2_208;
	word32 s3_209;
	word32 s4_210;
	word32 s8_211;
	ke_msg_send(a0_109, mstatus, out s1_201, out a0_202, out a1_203, out a2_204, out a3_205, out a4_206, out a5_207, out s2_208, out s3_209, out s4_210, out s8_211);
	0x00 = dwArg0128;
}

