pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301F204: void me_set_ps_disable_cfm_handler(Register ptr32 mstatus, Stack Eq_2 dwArg28)
void me_set_ps_disable_cfm_handler(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	word32 s2_98;
	word32 a4_97;
	word32 a2_96;
	ke_state_get(0x07, dwArg28, out a0_7, out a2_96, out a4_97, out s2_98);
	if (a0_7 != 0x01)
	{
		word32 a0_16;
		word32 s2_103;
		word32 a4_102;
		word32 a2_101;
		ke_state_get(0x07, dwArg28, out a0_16, out a2_101, out a4_102, out s2_103);
		if (a0_16 != 0x00)
			assert_err();
	}
	word32 a0_31;
	Eq_2 a4_33;
	word32 s2_100;
	word32 a2_99;
	ke_state_get(0x07, dwArg28, out a0_31, out a2_99, out a4_33, out s2_100);
	if (a0_31 == 0x01)
		apm_send_next_bss_param(a4_33, 0x01, mstatus);
}

// 2301F24C: void mm_bss_param_setting_handler(Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_bss_param_setting_handler(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	Eq_2 a4_9;
	word32 a2_42;
	word32 s2_43;
	ke_state_get(0x07, dwArg28, out a0_7, out a2_42, out a4_9, out s2_43);
	if (a0_7 == 0x01)
		apm_send_next_bss_param(a4_9, 0x01, mstatus);
	else
		assert_err();
}

// 2301F280: void mm_bcn_change_cfm_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArgC8, Stack word32 dwArg0118)
void mm_bcn_change_cfm_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArgC8, word32 dwArg0118)
{
	word32 a0_7;
	Eq_2 a4_9;
	word32 a2_51;
	word32 s2_52;
	ke_state_get(0x07, dwArg28, out a0_7, out a2_51, out a4_9, out s2_52);
	if (a0_7 == 0x02)
		apm_start_cfm(ra, 0x00, a4_9, mstatus, dwArg68, dwArgC8, dwArg0118);
	else
		assert_err();
}

// 2301F2B6: void apm_stop_req_handler(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 byte) a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void apm_stop_req_handler(Eq_2 ra, Eq_2 s1, byte * a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	struct Eq_91444 * s0_15 = (word32) *a1;
	Eq_2 s2_108 = a3;
	Eq_2 a4_113 = 0x02;
	if ((word32) s0_15->b4201AA3E == 0x02 && (word32) s0_15->b4201AA40 != 0x00)
	{
		word32 a0_30;
		word32 a2_232;
		word32 a4_233;
		word32 s2_234;
		ke_state_get(0x07, dwArg18, out a0_30, out a2_232, out a4_233, out s2_234);
		if (a0_30 != 0x00)
			return;
		Eq_2 a4_40 = (word32) g_b4201BC0C;
		if (a4_40 != 0x00)
			g_b4201BC0C = 0x00;
		struct Eq_91502 * s0_62;
		ra = apm_stop(ra, a4_40, mstatus, s2, dwLoc08, dwArg08, dwArg18, s1, dwArgD8, dwArgE8, dwArg0138, out s0_62, out a4_113, out s2_108);
		Eq_2 a0_72 = s0_62->tFFFFF9C4;
		if (a0_72 != 0x00)
			cm_DeleteConnection(s0_62->tFFFFF9C4, RemoveAPKeyInfo(a0_72, dwArgF8, out s2_108), mstatus, dwLoc10, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a4_113)->dw09C4 = 0x00;
	}
	word32 s0_224;
	word32 s1_225;
	word32 a0_226;
	word32 a3_227;
	word32 s2_228;
	word32 s3_229;
	word32 s4_230;
	word32 s8_231;
	ke_msg_send_basic(ra, 33553411, s2_108, a4_113, mstatus, s2, out s0_224, out s1_225, out a0_226, out a3_227, out s2_228, out s3_229, out s4_230, out s8_231);
}

// 2301F354: void apm_start_req_handler(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_91537) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register word32 s8, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0164, Stack word32 dwArg0198)
void apm_start_req_handler(Eq_2 ra, Eq_2 s1, struct Eq_91537 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s6, word32 s8, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0164, word32 dwArg0198)
{
	Eq_2 a3_42;
	word32 s10_940;
	word32 s11_941;
	word32 t4_942;
	word32 s3_933;
	word32 s9_939;
	word32 s4_934;
	word32 s5_935;
	word32 s8_938;
	word32 s6_936;
	word32 s7_937;
	word32 s2_932;
	word32 a1_927;
	word32 a2_928;
	word32 a7_931;
	word32 a4_929;
	word32 a5_930;
	word32 s1_925;
	word32 a0_926;
	Eq_2 ra_368 = printf(ra, &g_t23078A2C, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_925, out a0_926, out a1_927, out a2_928, out a3_42, out a4_929, out a5_930, out a7_931, out s2_932, out s3_933, out s4_934, out s5_935, out s6_936, out s7_937, out s8_938, out s9_939, out s10_940, out s11_941, out t4_942);
	byte bLoc33_692 = SLICE(s8, byte, 8);
	if ((word32) (&g_b4201AA3E)[(word32) a1->b0033] == 0x02)
	{
		word32 a0_69;
		struct Eq_91730 * a2_70;
		word32 s2_982;
		word32 a4_981;
		Eq_2 s1_73 = ke_state_get(0x07, dwLoc08, out a0_69, out a2_70, out a4_981, out s2_982);
		if (a0_69 == 0x00)
		{
			word32 a5_77 = (word32) *((word32) s1_73 + 88);
			if (a5_77 == 0x00)
			{
				if (a5_77 != 0x00)
					assert_err();
				Eq_2 a4_86 = (word32) a1->b001C;
				g_dw4201CBF8 = a2_70->dw0014;
				word32 a0_93;
				Eq_2 s2_101;
				word32 s3_102;
				struct Eq_91766 * s6_105;
				struct Eq_91767 * s0_99 = me_add_chan_ctx(fp + -0x0033, a4_86, s9, out a0_93, out s2_101, out s3_102, out s6_105);
				if (a0_93 == 0x00)
				{
					Eq_2 a3_189;
					struct Eq_25380 * a0_188 = me_freq_to_chan_ptr((word32) s0_99->b0010, (word32) s0_99->w000E, out a3_189);
					struct Eq_91796 * a5_194 = (word32) s2_101 + (s3_102 + 0x05D8);
					a5_194->ptr03A4 = a0_188;
					struct Eq_91803 * a4_196 = (int32) s0_99->b0012;
					a0_188->b0004 = (byte) a4_196;
					a5_194->w03A8 = (word16) a4_196;
					struct Eq_91816 * s0_200 = a4_196->ptr0018;
					a5_194->w03AA = (word16) a4_196;
					word32 a5_202 = (word32) s0_200->b001C;
					if (a5_202 == 0x04)
						a5_202 = 0x03;
					Eq_2 s5_212 = (word32) s2_101 + (s3_102 + 0x05D8);
					((word32) s5_212 + 986)->u1 = (byte) a5_202;
					word32 a5_216 = (word32) s0_200->b001C;
					((word32) s5_212 + 988)->u1 = 0x00;
					((word32) s5_212 + 987)->u1 = (byte) a5_216;
					struct Eq_91852 * s3_233;
					word32 a4_984;
					word32 s1_983;
					word32 s4_234;
					int32 s2_232;
					Eq_2 s0_230 = chan_ctxt_link(ra_368, (word32) s0_200->b0033, (word32) bLoc33_692, a3_189, s2_101, mstatus, out s1_983, out a4_984, out s2_232, out s3_233, out s4_234);
					s6_105->bFFFFFC0C = (byte) (word32) *((word32) s0_230 + 52);
					s6_105->bFFFFFC0D = (byte) (word32) *((word32) s0_230 + 29);
					Eq_2 a4_245;
					if (apm_embedded_enabled(s5_212, out a4_245) != 0x00)
					{
						me_get_basic_rates((word32) s0_230 + 53, s0_230);
						if ((word32) *((word32) s0_230 + 67) != 0x00)
							*((word32) s5_212 + 992) |= 1;
						if ((word32) g_b4201B002 != 0x00)
						{
							struct Eq_92212 * a5_264 = (char *) s3_233 + 0x05D8 + s2_232;
							a5_264->dw03E0 |= 2;
						}
						struct Eq_92045 * s1_278 = (char *) s3_233 + 0x05D8 + s2_232;
						s1_278->w0412 = (word16) (word32) *((word32) s0_230 + 40);
						s1_278->w03AC = (word16) (word32) *((word32) s0_230 + 66);
						s1_278->b0418 = (byte) (word32) *((word32) s0_230 + 0x0066);
						word32 a5_1022;
						word32 a6_1023;
						word32 a7_1024;
						word32 a2_1019;
						word32 a3_1020;
						word32 a4_1021;
						word32 a1_1018;
						memcpy(&s1_278->b037E, (word32) s0_230 + 0x0044, 0x0022, out a1_1018, out a2_1019, out a3_1020, out a4_1021, out a5_1022, out a6_1023, out a7_1024);
						struct Eq_92094 * a5_303 = s1_278 + (word32) s1_278->b037E / 0x0419;
						a5_303->b037F = 0x00;
						struct Eq_92104 * s1_305 = a5_303->ptr0050;
						s1_305->ptr0378 = a5_303;
						s1_305->w037C = (word16) (word32) s1_305->w0054;
						Eq_2 a3_315;
						word32 a5_1028;
						word32 a6_1029;
						word32 a7_1030;
						word32 a1_1025;
						word32 a2_1026;
						word32 a4_1027;
						memcpy(&s1_305->w037C + 26, (word32) s0_230 + 53, 0x0D, out a1_1025, out a2_1026, out a3_315, out a4_1027, out a5_1028, out a6_1029, out a7_1030);
						*((word32) *(union Eq_2 *) 0x44B00200 + 8) = s1_305;
						*((word32) *(union Eq_2 *) 0x44B00204 + 0x0C) = s1_305;
						Eq_2 a4_329 = *(union Eq_2 *) 0x44B00208;
						*((word32) a4_329 + 16) = s1_305;
						Eq_2 a5_331 = *(union Eq_2 *) 0x44B0020C;
						s1_305->b03C0 = 0x00;
						*((word32) a5_331 + 20) = s1_305;
						s3_233->dw4201ADFC = 0xF0000000;
						struct Eq_85617 * a0_343;
						word32 a5_1031;
						word32 s2_1032;
						struct Eq_26465 * a1_349 = (word32) *((word32) ke_malloc((struct Eq_47150 *) 333, a3_315, a4_329, mstatus, dwLoc08, out a0_343, out a5_1031, out s2_1032) + 87);
						s6_105->ptrFFFFFC08 = a0_343;
						word32 a0_360;
						ra_368 = me_build_beacon(ra_368, a0_343, a1_349, (word32) s0_230 + 38, (word32) s0_230 + 50, s5_212, dwLoc20, dwLoc1C, dwArg2C, s3, out s0_230, out a0_360, out a4_245, out s2_232, out s4_234);
						word32 a5_385 = (word32) *((word32) s0_230 + 0x0066);
						*((word32) s0_230 + 36) = (word16) a0_360;
						if (a5_385 != 0x00)
						{
							word32 s0_404;
							struct Eq_92228 * s1_405;
							word32 s2_406;
							Eq_2 a0_419;
							Eq_2 ra_412 = cm_InitConnection(ra_368, s4_234 + 888 + s2_232, 0x00, 0x00, mstatus, s6, s4, s2, dwLoc20, dwLoc1C, dwArg1C, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_404, out s1_405, out a0_419, out s2_406);
							s1_405->t09C4 = a0_419;
							Eq_2 s6_420 = s4_234 + 895 + s2_406;
							struct Eq_92251 * s1_427 = ap_setpsk(a0_419, s6_420, s0_404 + 0x0067);
							Eq_2 a3_447;
							s0_230 = cm_SetComData(s1_427->ptrFFFFF9C4, s6_420, out a3_447);
							s1_427->ptrFFFFF9C4->b0002 = (byte) (word32) *((word32) s0_230 + 0x0033);
							Eq_2 s1_477;
							word32 s11_1049;
							word32 t4_1050;
							word32 s8_1046;
							word32 s9_1047;
							word32 s10_1048;
							word32 s5_1043;
							word32 s6_1044;
							word32 s7_1045;
							word32 s2_1040;
							word32 s3_1041;
							word32 s4_1042;
							word32 a4_1037;
							word32 a5_1038;
							word32 a7_1039;
							word32 a1_1034;
							word32 a2_1035;
							word32 a3_1036;
							word32 a0_1033;
							ra_368 = InitGroupKey(printf(ra_412, &g_t23078A4C, a3_447, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_477, out a0_1033, out a1_1034, out a2_1035, out a3_1036, out a4_1037, out a5_1038, out a7_1039, out s2_1040, out s3_1041, out s4_1042, out s5_1043, out s6_1044, out s7_1045, out s8_1046, out s9_1047, out s10_1048, out s11_1049, out t4_1050), s1_477, *((word32) s1_477 - 0x063C), mstatus, dwLoc38, dwLoc20, dwLoc1C, dwLoc18, dwArg08, dwArg2C, s9, s1, dwArg78, dwArg7C, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0108, dwArg0164, out a4_245, out s2_232, out s4_234);
						}
						else
							g_dw4201C9C4 = 0x00;
					}
					if ((word32) *((word32) s0_230 + 16) == 0x00)
					{
						ui32 a0_527;
						int32 s2_535;
						ptr32 s3_536;
						word32 s8_1016;
						word32 s5_1013;
						word32 s6_1014;
						word32 s7_1015;
						word32 s1_1010;
						word32 a4_1011;
						word32 s4_1012;
						me_legacy_rate_bitfield_build(s4_234 + 944 + s2_232, 0x01, dwArgE8, out s1_1010, out a0_527, out a4_1011, out s2_535, out s3_536, out s4_1012, out s5_1013, out s6_1014, out s7_1015, out s8_1016);
						if ((a0_527 & 0x0F) != 0x00)
						{
							word32 a4_1017;
							(s3_536 + 0x05D8 + s2_535)->b03D7 = (byte) (0x1F - __clzsi2(a0_527 & 0x0F, out a4_1017));
							a4_245.u0 = 0x1F;
						}
						else
						{
							(s3_536 + 0x05D8 + s2_535)->b03D7 = 0x01;
							a4_245.u0 = 0x01;
						}
					}
					Eq_2 a3_570;
					Eq_2 s5_581;
					word32 s3_986;
					word32 s2_985;
					Eq_2 ra_575 = apm_set_bss_param(ra_368, a4_245, mstatus, dwArgB8, dwArgE8, out a3_570, out s2_985, out s3_986, out s5_581);
					Eq_2 a3_618;
					word32 s2_989;
					word32 s3_990;
					word32 a4_988;
					word32 s1_987;
					tpc_update_vif_tx_power(ra_575, s5_581, fp + -50, fp + -49, a3_570, fflags, frm, out s1_987, out a3_618, out a4_988, out s2_989, out s3_990);
					word32 s10_1007;
					word32 s11_1008;
					word32 t4_1009;
					word32 s7_1004;
					word32 s8_1005;
					word32 s9_1006;
					word32 s4_1001;
					word32 s5_1002;
					word32 s6_1003;
					word32 a7_998;
					word32 s2_999;
					word32 s3_1000;
					word32 a3_995;
					word32 a4_996;
					word32 a5_997;
					word32 s1_991;
					word32 a2_994;
					word32 a0_992;
					word32 a1_993;
					printf(ra_575, &g_t23078A70, a3_618, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_991, out a0_992, out a1_993, out a2_994, out a3_995, out a4_996, out a5_997, out a7_998, out s2_999, out s3_1000, out s4_1001, out s5_1002, out s6_1003, out s7_1004, out s8_1005, out s9_1006, out s10_1007, out s11_1008, out t4_1009);
l2301F63A:
					0x00 = dwArg0198;
					return;
				}
			}
		}
	}
	Eq_2 a4_126;
	Eq_2 s5_135;
	Eq_2 a0_149;
	struct Eq_91625 * s0_157;
	word32 s4_161;
	word32 s8_969;
	word32 a2_962;
	word32 s3_968;
	word32 a3_963;
	word32 a4_964;
	word32 s2_967;
	word32 a5_965;
	word32 a6_966;
	word32 s8_955;
	word32 a1_961;
	word32 s9_956;
	word32 s10_957;
	word32 s1_960;
	word32 s11_958;
	word32 t4_959;
	word32 s3_951;
	word32 s7_954;
	word32 s4_952;
	word32 s6_953;
	word32 a3_947;
	word32 s2_950;
	word32 a5_948;
	word32 a7_949;
	word32 a2_946;
	word32 a1_945;
	word32 s1_943;
	word32 a0_944;
	ke_msg_alloc(printf(ra_368, &g_t23078A94, a3_42, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_943, out a0_944, out a1_945, out a2_946, out a3_947, out a4_126, out a5_948, out a7_949, out s2_950, out s3_951, out s4_952, out s5_135, out s6_953, out s7_954, out s8_955, out s9_956, out s10_957, out s11_958, out t4_959), 0x01FFFC01, s5_135, 0x04, a4_126, mstatus, s2, out s0_157, out s1_960, out a0_149, out a1_961, out a2_962, out a3_963, out a4_964, out a5_965, out a6_966, out s2_967, out s3_968, out s4_161, out s8_969);
	a0_149->u1 = (byte) s4_161;
	*((word32) a0_149 + 1) = (byte) (word32) s0_157->b0033;
	word32 s8_980;
	word32 s3_978;
	word32 s4_979;
	word32 a5_976;
	word32 s2_977;
	word32 a4_975;
	word32 s1_970;
	word32 a0_971;
	word32 a3_974;
	word32 a1_972;
	word32 a2_973;
	ke_msg_send(a0_149, mstatus, out s1_970, out a0_971, out a1_972, out a2_973, out a3_974, out a4_975, out a5_976, out s2_977, out s3_978, out s4_979, out s8_980);
	goto l2301F63A;
}

// 2301F6AA: void me_set_active_cfm_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg28)
void me_set_active_cfm_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	word32 s2_134;
	word32 a4_133;
	word32 a2_132;
	ke_state_get(0x07, dwArg28, out a0_7, out a2_132, out a4_133, out s2_134);
	if (a0_7 != 0x01)
	{
		word32 a0_16;
		word32 s2_139;
		word32 a4_138;
		word32 a2_137;
		ke_state_get(0x07, dwArg28, out a0_16, out a2_137, out a4_138, out s2_139);
		if (a0_16 != 0x00)
			assert_err();
	}
	word32 a0_31;
	Eq_2 a4_33;
	word32 s2_136;
	word32 a2_135;
	ke_state_get(0x07, dwArg28, out a0_31, out a2_135, out a4_33, out s2_136);
	if (a0_31 != 0x01)
		return;
	if (g_dw4201BBFC == 0x00)
		apm_bcn_set(ra, a4_33, mstatus, dwLoc08, dwArg28);
	else
		assert_err();
}

