pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301F714: void hostapd_mgt_ind_handler(Register (ptr32 Eq_92383) a1, Stack Eq_2 dwArg28)
void hostapd_mgt_ind_handler(struct Eq_92383 * a1, Eq_2 dwArg28)
{
	ui32 a5_5 = (word32) a1->w0002;
	if ((a5_5 & 252) != 64 && (a5_5 & 252) != 0x00B0)
		return;
	word32 a0_43;
	word32 a2_44;
	word32 a4_45;
	word32 s2_46;
	ke_state_get(0x0A, dwArg28, out a0_43, out a2_44, out a4_45, out s2_46);
}

// 2301F742: Register Eq_2 dump_cfg_entries(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack word32 dwArg0198, Register out Eq_2 s1Out, Register out ptr32 a4Out)
// Called from:
//      cfg_start_req_handler
Eq_2 dump_cfg_entries(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, word32 dwArg0198, union Eq_2 & s1Out, ptr32 & a4Out)
{
	Eq_2 s0_183 = 0x2308E3E0;
	word32 a0_325;
	word32 a1_326;
	word32 a2_327;
	word32 a4_328;
	word32 a5_329;
	word32 s4_330;
	word32 s8_331;
	Eq_2 s1_240 = (word32) puts(0x23078BB8, out a0_325, out a1_326, out a2_327, out a4_328, out a5_329, out s4_330, out s8_331) + 0x0434;
	word32 s2_222 = 0x23079000;
	while (s0_183 < s1_240)
	{
		struct Eq_92486 ** a1_59;
		Eq_2 a3_61;
		word32 s3_69;
		word32 s1_332;
		word32 a0_333;
		word32 a2_334;
		word32 a4_335;
		word32 a5_336;
		word32 a7_337;
		word32 s2_338;
		word32 s4_339;
		word32 s5_340;
		word32 s6_341;
		word32 s7_342;
		word32 s8_343;
		word32 s9_344;
		word32 s10_345;
		word32 s11_346;
		word32 t4_347;
		Eq_2 ra_64 = printf(ra, s2_222 + -0x0418, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_332, out a0_333, out a1_59, out a2_334, out a3_61, out a4_335, out a5_336, out a7_337, out s2_338, out s3_69, out s4_339, out s5_340, out s6_341, out s7_342, out s8_343, out s9_344, out s10_345, out s11_346, out t4_347);
		struct Eq_92486 * s0_78 = *a1_59;
		Eq_2 a3_86;
		word32 s4_95;
		Eq_2 a3_110;
		word32 s5_120;
		Eq_2 a3_134;
		word32 s6_145;
		Eq_2 a3_158;
		word32 s7_170;
		Eq_2 a3_191;
		word32 s8_204;
		word32 s1_348;
		word32 a0_349;
		word32 a1_350;
		word32 a2_351;
		word32 a4_352;
		word32 a5_353;
		word32 a7_354;
		word32 s2_355;
		word32 s3_356;
		word32 s5_357;
		word32 s6_358;
		word32 s7_359;
		word32 s8_360;
		word32 s9_361;
		word32 s10_362;
		word32 s11_363;
		word32 t4_364;
		word32 s1_365;
		word32 a0_366;
		word32 a1_367;
		word32 a2_368;
		word32 a4_369;
		word32 a5_370;
		word32 a7_371;
		word32 s2_372;
		word32 s3_373;
		word32 s4_374;
		word32 s6_375;
		word32 s7_376;
		word32 s8_377;
		word32 s9_378;
		word32 s10_379;
		word32 s11_380;
		word32 t4_381;
		word32 s1_382;
		word32 a0_383;
		word32 a1_384;
		word32 a2_385;
		word32 a4_386;
		word32 a5_387;
		word32 a7_388;
		word32 s2_389;
		word32 s3_390;
		word32 s4_391;
		word32 s5_392;
		word32 s7_393;
		word32 s8_394;
		word32 s9_395;
		word32 s10_396;
		word32 s11_397;
		word32 t4_398;
		word32 s1_399;
		word32 a0_400;
		word32 a1_401;
		word32 a2_402;
		word32 a4_403;
		word32 a5_404;
		word32 a7_405;
		word32 s2_406;
		word32 s3_407;
		word32 s4_408;
		word32 s5_409;
		word32 s6_410;
		word32 s8_411;
		word32 s9_412;
		word32 s10_413;
		word32 s11_414;
		word32 t4_415;
		word32 s1_416;
		word32 a0_417;
		word32 a1_418;
		word32 a2_419;
		word32 a4_420;
		word32 a5_421;
		word32 a7_422;
		word32 s2_423;
		word32 s3_424;
		word32 s4_425;
		word32 s5_426;
		word32 s6_427;
		word32 s7_428;
		word32 s9_429;
		word32 s10_430;
		word32 s11_431;
		word32 t4_432;
		word32 s1_433;
		word32 a0_434;
		word32 a1_435;
		word32 a2_436;
		word32 a4_437;
		word32 a5_438;
		word32 a7_439;
		word32 s3_440;
		word32 s4_441;
		word32 s5_442;
		word32 s6_443;
		word32 s7_444;
		word32 s8_445;
		word32 s9_446;
		word32 s10_447;
		word32 s11_448;
		word32 t4_449;
		ra = printf(printf(cfg_api_element_dump(printf(printf(printf(printf(ra_64, s3_69 + -0x040C, a3_61, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_348, out a0_349, out a1_350, out a2_351, out a3_86, out a4_352, out a5_353, out a7_354, out s2_355, out s3_356, out s4_95, out s5_357, out s6_358, out s7_359, out s8_360, out s9_361, out s10_362, out s11_363, out t4_364), s4_95 + -1016, a3_86, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_365, out a0_366, out a1_367, out a2_368, out a3_110, out a4_369, out a5_370, out a7_371, out s2_372, out s3_373, out s4_374, out s5_120, out s6_375, out s7_376, out s8_377, out s9_378, out s10_379, out s11_380, out t4_381), s5_120 + -996, a3_110, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_382, out a0_383, out a1_384, out a2_385, out a3_134, out a4_386, out a5_387, out a7_388, out s2_389, out s3_390, out s4_391, out s5_392, out s6_145, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398), s6_145 + -976, a3_134, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_399, out a0_400, out a1_401, out a2_402, out a3_158, out a4_403, out a5_404, out a7_405, out s2_406, out s3_407, out s4_408, out s5_409, out s6_410, out s7_170, out s8_411, out s9_412, out s10_413, out s11_414, out t4_415), &s0_78->b0006 + 22, (word32) s0_78->b0006, fp + -64, out s0_183), s7_170 + -956, a3_158, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_416, out a0_417, out a1_418, out a2_419, out a3_191, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_204, out s9_429, out s10_430, out s11_431, out t4_432), s8_204 + -936, a3_191, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_433, out a0_434, out a1_435, out a2_436, out a3, out a4_437, out a5_438, out a7_439, out s2_222, out s3_440, out s4_441, out s5_442, out s6_443, out s7_444, out s8_445, out s9_446, out s10_447, out s11_448, out t4_449);
		word32 a0_450;
		word32 a1_451;
		word32 a2_452;
		word32 a4_453;
		word32 a5_454;
		word32 s4_455;
		word32 s8_456;
		s1_240 = puts(587720696, out a0_450, out a1_451, out a2_452, out a4_453, out a5_454, out s4_455, out s8_456);
	}
	ptr32 a4_251;
	word32 a0_457;
	word32 a1_458;
	word32 a2_459;
	word32 a5_460;
	word32 s4_461;
	word32 s8_462;
	Eq_2 s1_252 = puts(587722596, out a0_457, out a1_458, out a2_459, out a4_251, out a5_460, out s4_461, out s8_462);
	0x00 = dwArg0198;
	s1Out = s1_252;
	a4Out = a4_251;
	return ra;
}

