pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301F822: void cfg_start_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_92809)) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArg0108, Stack word32 dwArg0178)
void cfg_start_req_handler(Eq_2 ra, Eq_2 a3, struct Eq_92809 ** a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArg0108, word32 dwArg0178)
{
	Eq_2 a4_116;
	struct Eq_92809 * a1_13 = *a5;
	Eq_2 s1_109 = a3;
	if (a5 != null)
	{
		a4_116.u0 = 0x02;
		if (a5 > (struct Eq_92809 **) 0x02)
			ra = dump_cfg_entries(ra, a3, a3, dwArg10, dwArg14, dwArg5C, dwArg0178, out s1_109, out a4_116);
	}
	else
	{
		utils_tlv_bl_unpack_auto(a1_13->dw0010, (word32) a1_13->w000C, fp + ~0x13);
		Eq_2 a0_29;
		Eq_2 a5_30;
		Eq_2 a1_32;
		ptr32 a2_33;
		Eq_2 s6_45;
		word32 s1_203;
		word32 a3_204;
		word32 a4_205;
		word32 a7_206;
		word32 s2_207;
		word32 s3_208;
		word32 s4_209;
		word32 s5_210;
		word32 s7_211;
		word32 s8_212;
		word32 s9_213;
		word32 s10_214;
		word32 s11_215;
		word32 t4_216;
		ra = cfg_api_element_set(printf(ra, &g_t23078B94, fp + ~0x13, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_203, out a0_29, out a1_32, out a2_33, out a3_204, out a4_205, out a5_30, out a7_206, out s2_207, out s3_208, out s4_209, out s5_210, out s6_45, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216), a0_29, a1_32, a2_33, fp + ~0x13, 0x00, a5_30, s6_45, dwArg20, dwArg24, dwArg48, ra, dwArg0108, out s1_109, out a4_116);
	}
	Eq_2 a0_119;
	word32 s0_217;
	word32 s1_218;
	word32 a1_219;
	word32 a2_220;
	word32 a3_221;
	word32 a4_222;
	word32 a5_223;
	word32 a6_224;
	word32 s2_225;
	word32 s3_226;
	word32 s4_227;
	word32 s8_228;
	ke_msg_alloc(ra, 0x03000001, s1_109, 0x01, a4_116, mstatus, dwLoc08, out s0_217, out s1_218, out a0_119, out a1_219, out a2_220, out a3_221, out a4_222, out a5_223, out a6_224, out s2_225, out s3_226, out s4_227, out s8_228);
	a0_119->u1 = 0x00;
	word32 s1_229;
	word32 a0_230;
	word32 a1_231;
	word32 a2_232;
	word32 a3_233;
	word32 a4_234;
	word32 a5_235;
	word32 s2_236;
	word32 s3_237;
	word32 s4_238;
	word32 s8_239;
	ke_msg_send(a0_119, mstatus, out s1_229, out a0_230, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235, out s2_236, out s3_237, out s4_238, out s8_239);
}

// 2301F896: Register Eq_2 dbg_init(Register Eq_2 ra)
// Called from:
//      bl_init
Eq_2 dbg_init(Eq_2 ra)
{
	word32 t1_32;
	word32 a0_33;
	word32 a1_34;
	word32 a2_35;
	word32 a3_36;
	word32 a4_37;
	word32 a5_38;
	Eq_2 ra_18 = memset(ra, 1107416484, 0x00, 0x08, out t1_32, out a0_33, out a1_34, out a2_35, out a3_36, out a4_37, out a5_38);
	((union Eq_2 *) ~0x00)->u0 = 1107416484;
	((union Eq_2 *) 0x06)->u0 = 1107416484;
	return ra_18;
}

// 2301F8C0: Register word32 dbg_test_print(Register (ptr32 byte) a0, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_48308) s1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out (ptr32 byte) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      GetTxEAPOLBuffer
//      UpdateEAPOLWcbLenAndTransmit
//      keyMgmtProcessMsgExt
//      KeyMgmtInitSta
//      keyMgmtSta_StartSession
//      init_customApp_mibs
//      supplicantIsEnabled
//      supplicantInitSession
//      supplicantDisable
//      supplicantEnable
//      keyMgmtFormatWpaRsnIe
//      GeneratePWKMsg2
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      supplicantInit
//      keyMgmtGetKeySize
//      keyMgmtKeyGroupTxDone.isra.1
//      GenerateGrpMsg2
//      KeyMgmtStaHsk_Recvd_GrpMsg1
//      keyMgmtPlumbPairwiseKey
//      keyMgmtKeyPairwiseTxDone.isra.2
//      GeneratePWKMsg4
//      KeyMgmtStaHsk_Recvd_PWKMsg3
//      ProcessKeyMgmtDataSta
//      ProcessEAPoLPkt
//      keyMgmtStaRsnSecuredTimeoutHandler
//      supplicantGenerateRand
//      isApReplayCounterFresh
//      updateApReplayCounter
//      formEAPOLEthHdr
//      IsEAPOL_MICValid
//      KeyMgmtSta_PopulateEAPOLLengthMic
//      parseKeyKDE
//      parseKeyKDE_DataType
//      parseKeyDataGTK
//      KeyMgmtSta_ApplyKEK
//      KeyMgmtSta_IsRxEAPOLValid
//      KeyMgmtSta_PrepareEAPOLFrame
//      supplicantAkmIsWpaWpa2
//      supplicantAkmIsWpa2
//      supplicantAkmIsWpaWpa2Psk
//      supplicantAkmUsesKdf
//      supplicantConstructContext
//      KeyMgmt_DerivePTK
//      KeyMgmtSta_DeriveKeys
//      SetEAPOLKeyDescTypeVersion
//      GetKeyMsgNonceFromEAPOL
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
//      KeyMgmtResetCounter
//      keyMgmtSta_StartSession_internal
//      KeyMgmtSta_InitSession
//      set_psk
//      remove_psk
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
//      pmkCacheInit
//      pmkCacheRomInit
//      pmkCacheNewElement
//      pmkCacheUpdateReplacementRank
//      pmkCacheFindPSKElement
//      pmkCacheAddPSK
//      pmkCacheDeletePSK
//      pmkCacheGetHexNibble
//      pmkCacheGeneratePSK
//      bl_init
//      supplicantRestoreDefaults
//      supplicantFuncInit
word32 dbg_test_print(byte * a0, Eq_2 dwArg0178, struct Eq_48308 & s1Out, ptr32 & a2Out, union Eq_2 & a5Out, ptr32 & a6Out, byte & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	struct Eq_48308 * s1_156 = &g_t4201D000;
	Eq_2 a5_155 = g_t4201D5A8;
	if (a5_155 != 0x00)
	{
		s2 = a0;
		s1_156 = (struct Eq_48308 *) &g_t4201D5A4;
		s3 = a0 + 2;
		s5 = 0x05;
		s6 = 0x23074000;
		s7 = 0x23079000;
		do
		{
			Eq_93000 s0_49 = (word32) *s2;
			if ((int32) (byte) s0_49 >= 0x00)
				break;
			if (s0_49 <= 0x0087)
			{
				a5_155 = ~(int32) (byte) s0_49;
				s1_156 = null[(int32) (byte) s0_49 / 4];
				if ((a5_155 >> (word32) s0_49.u1 - 0x0080 & 0x01) != 0x00)
					goto l2301F918;
			}
			else
			{
				a5_155 = (word32) s0_49.u1 + 0x0066 & 0x00FF;
				if (a5_155 > 0x05)
					assert_err();
				s1_156 = (struct Eq_48308 *) *((word32) a5_155 + 4);
				if ((word32) s0_49.u1 - 0x009A >= a5_155)
					goto l2301F918;
			}
			++s2;
		} while (a0 + 2 != s2);
		a5_155 = fp + -28;
	}
l2301F918:
	0x00 = (uint16) dwArg0178;
	s1Out = s1_156;
	a2Out = dwArg0118;
	a5Out = a5_155;
	a6Out = dwArgF8;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArgD4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArgB4;
	return dwArg0138;
}

// 2301F974: void dbg_get_sys_stat_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void dbg_get_sys_stat_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_12;
	word32 s0_54;
	word32 s1_55;
	word32 a1_56;
	word32 a2_57;
	word32 a3_58;
	word32 a4_59;
	word32 a5_60;
	word32 a6_61;
	word32 s2_62;
	word32 s3_63;
	word32 s4_64;
	word32 s8_65;
	ke_msg_alloc(ra, 0x040A, a3, 0x0C, a4, mstatus, dwArg08, out s0_54, out s1_55, out a0_12, out a1_56, out a2_57, out a3_58, out a4_59, out a5_60, out a6_61, out s2_62, out s3_63, out s4_64, out s8_65);
	*a0_12 = 0x00;
	*((word32) a0_12 + 4) = 0x00;
	*((word32) a0_12 + 8) = 0x00;
	word32 s1_66;
	word32 a0_67;
	word32 a1_68;
	word32 a2_69;
	word32 a3_70;
	word32 a4_71;
	word32 a5_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	word32 s8_76;
	ke_msg_send(a0_12, mstatus, out s1_66, out a0_67, out a1_68, out a2_69, out a3_70, out a4_71, out a5_72, out s2_73, out s3_74, out s4_75, out s8_76);
}

// 2301F99C: void dbg_mem_write_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void dbg_mem_write_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_16;
	union Eq_2 ** a3_19;
	union Eq_2 * a4_20;
	word32 s0_64;
	word32 s1_65;
	word32 a1_66;
	word32 a2_67;
	word32 a5_68;
	word32 a6_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s8_73;
	ke_msg_alloc(ra, 0x0403, a3, 0x08, a4, mstatus, dwArg08, out s0_64, out s1_65, out a0_16, out a1_66, out a2_67, out a3_19, out a4_20, out a5_68, out a6_69, out s2_70, out s3_71, out s4_72, out s8_73);
	*a3_19 = (union Eq_2 **) a4_20;
	*a4_20 = (union Eq_2 *) a0_16;
	*((char *) *a4_20 + 4) = (union Eq_2 *) a0_16;
	word32 s1_74;
	word32 a0_75;
	word32 a1_76;
	word32 a2_77;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	word32 s2_81;
	word32 s3_82;
	word32 s4_83;
	word32 s8_84;
	ke_msg_send(a0_16, mstatus, out s1_74, out a0_75, out a1_76, out a2_77, out a3_78, out a4_79, out a5_80, out s2_81, out s3_82, out s4_83, out s8_84);
}

