pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301F9CC: void dbg_mem_read_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void dbg_mem_read_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_16;
	struct Eq_93224 ** a4_20;
	word32 s0_62;
	word32 s1_63;
	word32 a1_64;
	word32 a2_65;
	word32 a3_66;
	word32 a5_67;
	word32 a6_68;
	word32 s2_69;
	word32 s3_70;
	word32 s4_71;
	word32 s8_72;
	ke_msg_alloc(ra, 0x0401, a3, 0x08, a4, mstatus, dwArg08, out s0_62, out s1_63, out a0_16, out a1_64, out a2_65, out a3_66, out a4_20, out a5_67, out a6_68, out s2_69, out s3_70, out s4_71, out s8_72);
	struct Eq_93224 * a4_35 = *a4_20;
	a4_35->t0004 = a0_16;
	a4_35->t0000 = a0_16;
	word32 s1_73;
	word32 a0_74;
	word32 a1_75;
	word32 a2_76;
	word32 a3_77;
	word32 a4_78;
	word32 a5_79;
	word32 s2_80;
	word32 s3_81;
	word32 s4_82;
	word32 s8_83;
	ke_msg_send(a0_16, mstatus, out s1_73, out a0_74, out a1_75, out a2_76, out a3_77, out a4_78, out a5_79, out s2_80, out s3_81, out s4_82, out s8_83);
}

// 2301F9F8: void dbg_set_sev_filter_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
void dbg_set_sev_filter_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	g_t4201D5A8 = a4;
	word32 s0_38;
	word32 s1_39;
	word32 a0_40;
	word32 a3_41;
	word32 s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 s8_45;
	ke_msg_send_basic(ra, 1031, a3, a4, mstatus, dwLoc08, out s0_38, out s1_39, out a0_40, out a3_41, out s2_42, out s3_43, out s4_44, out s8_45);
}

// 2301FA18: void dbg_set_mod_filter_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
void dbg_set_mod_filter_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	g_t4201D5A4 = a4;
	word32 s0_38;
	word32 s1_39;
	word32 a0_40;
	word32 a3_41;
	word32 s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 s8_45;
	ke_msg_send_basic(ra, 0x0405, a3, a4, mstatus, dwLoc08, out s0_38, out s1_39, out a0_40, out a3_41, out s2_42, out s3_43, out s4_44, out s8_45);
}

// 2301FA38: Register Eq_2 ke_queue_extract(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register ui32 a2, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 s2Out)
// Called from:
//      mm_back_to_host_idle
//      ke_timer_set
//      ke_timer_clear
Eq_2 ke_queue_extract(Eq_2 ra, Eq_2 s0, Eq_2 a1, ui32 a2, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & s2Out)
{
	struct Eq_93310 * sp_23 = fp + -48;
	Eq_2 s2_15 = *s0;
	Eq_2 s3_17 = a1;
	Eq_2 s1_18 = 0x00;
	while (true)
	{
		ui32 a2_42;
		if (s0 == 0x00)
			break;
		sp_23->dw0084 = a2;
		word32 a0_35;
		Eq_2 a5_38;
		s3_17();
		Eq_2 s0_41 = *a5_38;
		a2_42 = sp_23->dw0084;
		if (a0_35 != 0x00)
		{
			if (s1_18 != 0x00)
				*a5_38 = s1_18;
			else
				*s2_15 = a5_38;
			s0 = *a5_38;
			if (a5_38 != 0x00)
				s0->u0 = 0x00;
			else
				*((word32) s2_15 + 4) = s1_18;
			break;
		}
		s1_18 = s0_41;
		s0 = a5_38;
		a2 = a2_42;
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_18;
	a0Out = s0;
	s2Out = s2_15;
	return ra;
}

// 2301FA8A: Register (ptr32 Eq_53953) bl_aes_128(Register Eq_2 a0, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      generate_subkey
//      bl_aes_cmac
struct Eq_53953 * bl_aes_128(Eq_2 a0, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s10Out)
{
	ptr32 s10_17;
	ptr32 s3_19;
	ptr32 s4_20;
	ptr32 s7_23;
	word32 s5_38;
	word32 s6_39;
	word32 s8_40;
	struct Eq_53953 * s2_18 = BL_AesEncrypt(a0, 0x02, out s3_19, out s4_20, out s5_38, out s6_39, out s7_23, out s8_40, out s10_17);
	s3Out = s3_19;
	s4Out = s4_20;
	s7Out = s7_23;
	s10Out = s10_17;
	return s2_18;
}

// 2301FA92: void xor_128(Register Eq_93394 a0, Register (arr byte) a1, Register (arr int8) a2)
// Called from:
//      generate_subkey
//      bl_aes_cmac
void xor_128(Eq_93394 a0, byte a1[], int8 a2[])
{
	int32 a5_15;
	for (a5_15 = 0x00; a5_15 != 0x10; ++a5_15)
		a2[a5_15] = (byte) ((word32) *((word32) a0.u1 + a5_15) ^ (word32) a1[a5_15]);
}

// 2301FABA: void leftshift_onebit(Register (arr int8) a0, Register (arr int8) a1)
// Called from:
//      generate_subkey
void leftshift_onebit(int8 a0[], int8 a1[])
{
	uint32 a5_15 = 0x00;
	int32 a4_13;
	for (a4_13 = 0x0F; a4_13 != ~0x00; a4_13 += ~0x00)
	{
		byte * a2_8 = a0 + a4_13;
		a1[a4_13] = (byte) (a5_15 | (word32) (*a2_8) << 1);
		a5_15 = (word32) *a2_8 >> 7;
	}
}

// 2301FAE2: Register Eq_2 generate_subkey(Register Eq_2 ra, Register Eq_2 a0, Register (arr int8) a1, Register (ptr32 (arr int8)) a2, Register out (ptr32 (arr int8)) s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      bl_aes_cmac
Eq_2 generate_subkey(Eq_2 ra, Eq_2 a0, int8 a1[], int8 (* a2)[], int8 (& s1Out, ptr32 & s2Out, ptr32 & s4Out)
{
	word32 a4_185;
	word32 a5_186;
	word32 a2_183;
	word32 a3_184;
	word32 a0_181;
	word32 a1_182;
	word32 t1_180;
	Eq_2 ra_27 = memset(ra, fp + -48, 0x00, 0x10, out t1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186);
	word32 s7_189;
	word32 s10_190;
	word32 s3_187;
	word32 s4_188;
	ptr32 s2_42 = bl_aes_128(a0, out s3_187, out s4_188, out s7_189, out s10_190);
	if ((int32) bLoc40 >= 0x00)
		leftshift_onebit(fp + -64, a1);
	else
	{
		leftshift_onebit(fp + -64, fp + -32);
		xor_128(fp + -32, g_a23078CC4, a1);
	}
	if ((int32) a1[0] >= 0x00)
		leftshift_onebit(a1, a2);
	else
	{
		leftshift_onebit(a1, fp + -32);
		xor_128(fp + -32, g_a23078CC4, a2);
	}
	s1Out = a2;
	s2Out = s2_42;
	s4Out = dwArgF4;
	return ra_27;
}

// 2301FB66: void padding(Register Eq_93520 a0, Register (arr byte) a1, Register int32 a2)
// Called from:
//      bl_aes_cmac
void padding(Eq_93520 a0, byte a1[], int32 a2)
{
	int32 a5_24;
	byte * a3_6 = a1 + a2;
	for (a5_24 = 0x00; a5_24 != 0x10; ++a5_24)
	{
		if (a5_24 < a2)
			a1[a5_24] = (byte) (word32) *((word32) a0.u1 + a5_24);
		else if (a2 == a5_24)
			*a3_6 = 0x80;
		else
			a1[a5_24] = 0x00;
	}
}

