pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0001.c
// 2301FBA2: Register Eq_2 bl_aes_cmac(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out (ptr32 (arr byte)) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      ComputeEAPOL_MIC
Eq_2 bl_aes_cmac(Eq_2 ra, Eq_2 a0, ptr32 & s1Out, ptr32 & s2Out, byte (& s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	byte (* a1_75)[];
	Eq_93394 a0_76;
	ui32 s1_35;
	ptr32 s2_113;
	Eq_2 s4_123;
	Eq_2 ra_33 = generate_subkey(ra, a0, fp + -64, fp + -48, out s1_35, out s2_113, out s4_123);
	ui32 s0_106 = s1_35 + 0x0F ^ 0x10;
	if (s0_106 != 0x00)
	{
		if ((s1_35 & 0x0F) == 0x00)
		{
			a1_75 = fp + -64;
			a0_76 = (s0_106 + -1 << 4) + s2_113;
l2301FBDE:
			xor_128(a0_76, a1_75, fp + -96);
			word32 a3_282;
			word32 a1_280;
			word32 a0_279;
			word32 t1_278;
			word32 a5_284;
			word32 a4_283;
			word32 a2_281;
			Eq_2 ra_102 = memset(ra_33, fp + -0x0080, 0x00, 0x10, out t1_278, out a0_279, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284);
			int32 s1_105;
			int32 s0_107 = s0_106 + ~0x00;
			for (s1_105 = 0x00; s1_105 < s0_107; ++s1_105)
			{
				xor_128(fp + -0x0080, (s1_105 << 0x04) + s2_113, fp + -112);
				word32 s10_277;
				word32 s7_276;
				word32 s3_275;
				s2_113 = bl_aes_128(s4_123, out s3_275, out s4_123, out s7_276, out s10_277);
			}
			xor_128(fp + -0x0080, fp + -96, fp + -112);
			ptr32 s10_170;
			byte s3_172[];
			ptr32 s4_173;
			ptr32 s7_176;
			ptr32 s2_171 = bl_aes_128(s4_123, out s3_172, out s4_173, out s7_176, out s10_170);
			int32 a5_187;
			for (a5_187 = 0x00; a5_187 != 0x10; ++a5_187)
				s3_172[a5_187] = (byte) (word32) (fp + -0x0080 + a5_187);
			s1Out = dwArg0118;
			s2Out = s2_171;
			s3Out = s3_172;
			s4Out = s4_173;
			s5Out = dwArgB4;
			s7Out = s7_176;
			s9Out = dwArg94;
			s10Out = s10_170;
			return ra_102;
		}
	}
	else
		s0_106 = 0x01;
	padding((s0_106 + -1 << 4) + s2_113, fp + -80, s1_35 | 0x10);
	a1_75 = fp + -48;
	a0_76 = fp + -80;
	goto l2301FBDE;
}

// 2301FC6C: Register ptr32 BL_AES_MEMCMP(Register ptr32 a0, Register (arr byte) a1, Register int32 a2, Register out ptr32 a3Out)
// Called from:
//      BL_AesUnWrap
ptr32 BL_AES_MEMCMP(ptr32 a0, byte a1[], int32 a2, ptr32 & a3Out)
{
	int32 a5_18 = 0x00;
	a2_15 = a2;
	while (true)
	{
		int32 a2_15;
		if (a2 == a5_18)
			break;
		a3 = (word32) (a0 + a5_18);
		if (a3 == (word32) a1[a5_18])
			a2_15 += ~0x00;
		++a5_18;
	}
	a3Out = a3;
	return 0x00 - (word32) (a2_15 != 0x00);
}

// 2301FC98: void BL_AES_MEMSET(Register (ptr32 Eq_93707) a0, Register word32 a1, Register word32 a2)
// Called from:
//      BL_AesWrap
//      BL_AesUnWrap
void BL_AES_MEMSET(struct Eq_93707 * a0, word32 a1, word32 a2)
{
	struct Eq_93707 * a2_5 = a0 + a2;
	while (a0 != a2_5)
	{
		++a0;
		a0[0x0FFF] = (struct Eq_93707) (byte) a1;
	}
}

// 2301FCA8: void BL_AES_MEMCPY(Register (ptr32 Eq_53953) a0, Register (ptr32 Eq_53953) a1, Register int32 a2)
// Called from:
//      BL_AesWrap
//      BL_AesUnWrap
void BL_AES_MEMCPY(struct Eq_53953 * a0, struct Eq_53953 * a1, int32 a2)
{
	if (a0 >= a1)
	{
		while (true)
		{
			a2 += ~0x00;
			if (a2 == ~0x00)
				break;
			a0[a2 / 0x0C] = (struct Eq_53953) (byte) (word32) a1[a2 / 0x0C];
		}
	}
	else
	{
		int32 a5_16;
		for (a5_16 = 0x00; a5_16 != a2; ++a5_16)
			a0[a5_16 / 0x0C] = (struct Eq_53953) (byte) (word32) a1[a5_16 / 0x0C];
	}
}

// 2301FCE2: Register word32 BL_AesEncrypt(Register Eq_2 a0, Register ui32 a1, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_93383 s8Out, Register out ptr32 s10Out)
// Called from:
//      bl_aes_128
//      BL_AesWrap
word32 BL_AesEncrypt(Eq_2 a0, ui32 a1, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_93383 & s8Out, ptr32 & s10Out)
{
	struct Eq_93745 * s1_29;
	ptr32 s10_49;
	ptr32 s3_51;
	ptr32 s4_52;
	ptr32 s5_53;
	ptr32 s6_54;
	ptr32 s7_55;
	Eq_93383 s8_56;
	word32 s2_84;
	word32 s3_85;
	word32 s2_50 = rijndael_encrypt(rijndael_set_key(fp + -416, a0, a1 << 0x06, (struct Eq_93775 *) 0x01, out s1_29, out s2_84, out s3_85), s1_29, dwLoc0164, dwLocBC, dwLoc58, out s3_51, out s4_52, out s5_53, out s6_54, out s7_55, out s8_56, out s10_49);
	s3Out = s3_51;
	s4Out = s4_52;
	s5Out = s5_53;
	s6Out = s6_54;
	s7Out = s7_55;
	s8Out = s8_56;
	s10Out = s10_49;
	return s2_50;
}

// 2301FD1E: Register word32 BL_AesWrap(Register Eq_2 a0, Register ui32 a1, Register uint32 a2, Register (ptr32 Eq_53953) a3, Register (ptr32 Eq_53953) a4, Register (ptr32 Eq_53953) a5, Register out ptr32 s0Out, Register out (ptr32 Eq_53953) s2Out, Register out Eq_60572 s3Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      Encrypt_keyData
word32 BL_AesWrap(Eq_2 a0, ui32 a1, uint32 a2, struct Eq_53953 * a3, struct Eq_53953 * a4, struct Eq_53953 * a5, ptr32 & s0Out, struct Eq_53953 & s2Out, union Eq_60572 & s3Out, ptr32 & s5Out, ptr32 & s10Out)
{
	if (a2 == 0x00)
	{
		s0Out = s0;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s10Out = s10;
		return ra;
	}
	else
	{
		BL_AES_MEMSET(fp + -64, 0x00, 0x10);
		ui32 s7_110 = a1;
		Eq_2 s6_109 = a0;
		struct Eq_53953 * s2_105 = a5;
		struct Eq_53953 * a1_44 = a4;
		if (a4 == null)
			a1_44 = &g_t2308DE40;
		BL_AES_MEMCPY(fp + -72, a1_44, 0x08);
		BL_AES_MEMCPY(&a5->dw0008, a3, a2 << 0x03);
		ui32 s8_111 = a2 & 0x00FF;
		Eq_60572 s3_106 = 0x00;
		ptr32 s5_108;
		for (s5_108 = 0x06; s5_108 != 0x00; s5_108 += ~0x00)
		{
			ui32 s1_136 = 0x01;
			while (true)
			{
				struct Eq_53953 * s4_73 = s2_105 + (s1_136 << 0x03) / 0x0C;
				if (s1_136 == a2 + 0x01)
					break;
				BL_AES_MEMCPY(fp + -64, fp + -72, 0x08);
				BL_AES_MEMCPY(fp + -56, s4_73, 0x08);
				struct Eq_53953 * s4_107;
				s2_105 = BL_AesEncrypt(s6_109, s7_110, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out s8_111, out s10);
				BL_AES_MEMCPY(fp + -72, fp + -64, 0x08);
				BL_AES_MEMCPY(s4_107, fp + -56, 0x08);
				++s1_136;
			}
			s3_106 = (word32) s3_106.u0 + s8_111 & 0x00FF;
		}
		BL_AES_MEMCPY(s2_105, fp + -72, 0x08);
		s0Out = dwArgCC;
		s2Out = s2_105;
		s3Out = s3_106;
		s5Out = s5_108;
		s10Out = s10;
		return dwLoc08;
	}
}

// 2301FE02: Register (ptr32 Eq_53953) BL_AesUnWrap(Register Eq_2 a0, Register ui32 a1, Register uint32 a2, Register (ptr32 Eq_53953) a3, Register (ptr32 Eq_53953) a5, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtSta_ApplyKEK
struct Eq_53953 * BL_AesUnWrap(Eq_2 a0, ui32 a1, uint32 a2, struct Eq_53953 * a3, struct Eq_53953 * a5, ptr32 & s9Out, ptr32 & s10Out)
{
	if (a2 == 0x00)
	{
		s9Out = s9;
		s10Out = s10;
		return a3;
	}
	else
	{
		BL_AES_MEMSET(fp + -472, 0x00, 0x08);
		BL_AES_MEMSET(fp + -464, 0x00, 0x10);
		BL_AES_MEMCPY(fp + -472, a3, 0x08);
		BL_AES_MEMCPY(a5, &a3->dw0008, a2 << 0x03);
		ptr32 s3_129;
		int32 s2_128;
		struct Eq_53953 * s1_126;
		rijndael_set_key(fp + -448, a0, a1 << 0x06, null, out s1_126, out s2_128, out s3_129);
		word32 s6_132;
		for (s6_132 = 0x06; s6_132 != 0x00; s6_132 += ~0x00)
		{
			int32 s4_159 = s2_128;
			struct Eq_53953 * s5_104 = s1_126;
			while (s4_159 > 0x00)
			{
				BL_AES_MEMCPY(fp + -464, fp + -472, 0x08);
				BL_AES_MEMCPY(fp + -456, s5_104, 0x08);
				word32 s4_130;
				struct Eq_53953 * s5_131;
				s1_126 = rijndael_decrypt(fp + -464, fp + -464, dwLoc01A4, dwLocFC, dwLoc98, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s9, out s10);
				BL_AES_MEMCPY(fp + -472, fp + -464, 0x08);
				BL_AES_MEMCPY(s5_131, fp + -456, 0x08);
				s5_104 = (struct Eq_53953 *) ((char *) s5_131 - 8);
				s4_159 = s4_130 + ~0x00;
			}
		}
		ptr32 a0_171 = s3_129;
		if (s3_129 == 0x00)
			a0_171 = 587783744;
		struct Eq_53953 * a3_179;
		BL_AES_MEMCMP(a0_171, fp + -472, 0x08, out a3_179);
		s9Out = s9;
		s10Out = s10;
		return a3_179;
	}
}

